{"id":138768,"date":"2020-05-25T12:11:16","date_gmt":"2020-05-25T11:11:16","guid":{"rendered":"https:\/\/tintyoga.com\/?page_id=138768"},"modified":"2020-05-25T12:11:16","modified_gmt":"2020-05-25T11:11:16","slug":"privacy-policy","status":"publish","type":"page","link":"https:\/\/tintyoga.com\/privacy-policy\/","title":{"rendered":"Privacy Policy"},"content":{"rendered":"<p>[et_pb_section fb_built=&#8221;1&#8243; _builder_version=&#8221;4.4.6&#8243;][et_pb_row _builder_version=&#8221;4.4.6&#8243;][et_pb_column type=&#8221;4_4&#8243; _builder_version=&#8221;4.4.6&#8243;][et_pb_text _builder_version=&#8221;4.4.6&#8243; text_font=&#8221;|||on|||||&#8221; header_font=&#8221;Josefin Sans|||on|||||&#8221;]<\/p>\n<h1>Privacy Policy<\/h1>\n<p>[\/et_pb_text][\/et_pb_column][\/et_pb_row][et_pb_row _builder_version=&#8221;4.4.6&#8243;][et_pb_column type=&#8221;4_4&#8243; _builder_version=&#8221;4.4.6&#8243;][et_pb_text _builder_version=&#8221;4.4.6&#8243; header_font=&#8221;Josefin Sans|||on|||||&#8221; header_2_font=&#8221;Josefin Sans|||on|||||&#8221;]<\/p>\n<h2>§ 1 &#8211; Overview of data protection<\/h2>\n<p><strong>General<\/strong><\/p>\n<p>The following gives a simple overview of what happens to your personal information when you visit our website. Personal information is any data with which you could be personally identified. Detailed information on the subject of data protection can be found in our privacy policy found below.<\/p>\n<p>Data collection on our website<\/p>\n<p><strong>Who is responsible for the data collection on this website?<\/strong><\/p>\n<p>The data collected on this website are processed by the website operator. The operator&#8217;s contact details can be found in the website&#8217;s required legal notice.<\/p>\n<p><strong>How do we collect your data?<\/strong><\/p>\n<p>Some data are collected when you provide it to us. This could, for example, be data you enter on a contact form or data you provide to us in order to sign up for a user account.<\/p>\n<p>Other data are collected automatically by our IT systems when you visit the website. These data are primarily technical data such as the browser and operating system you are using or when you accessed the page. These data are collected automatically as soon as you enter our website.<\/p>\n<p><strong>What do we use your data for?<\/strong><\/p>\n<p>Part of the data is collected to ensure the proper functioning of the website, e. g. your username or email to log on in order to use the entire member area and watch free and purchased videos. Other data can be used to analyse how visitors use the site.<\/p>\n<p><strong>What rights do you have regarding your data?<\/strong><\/p>\n<p>You always have the right to request information about your stored data, its origin, its recipients, and the purpose of its collection at no charge. You also have the right to request that it be corrected, blocked, or deleted. You can contact us at any time using the address given in the legal notice if you have further questions about the issue of privacy and data protection. You may also, of course, file a complaint with the competent regulatory authorities.<\/p>\n<p><strong>Analytics and third-party tools<\/strong><\/p>\n<p>When visiting our website, statistical analyses may be made of your surfing behaviour. This happens primarily using cookies and analytics. The analysis of your surfing behaviour is usually anonymous, i.e. we will not be able to identify you from this data. You can object to this analysis or prevent it by not using certain tools. Detailed information can be found in the following privacy policy.<\/p>\n<p>You can object to this analysis. We will inform you below about how to exercise your options in this regard.<\/p>\n<h2><\/h2>\n<p>&nbsp;<\/p>\n<h2>§ 2 &#8211; General information and mandatory information<\/h2>\n<p><strong>Data protection<\/strong><\/p>\n<p>The operators of this website take the protection of your personal data very seriously. We treat your personal data as confidential and in accordance with the statutory data protection regulations and this privacy policy.<\/p>\n<p>If you use this website, various pieces of personal data will be collected. Personal information is any data with which you could be personally identified. This privacy policy explains what information we collect and what we use it for. It also explains how and for what purpose this happens.<\/p>\n<p>Please note that data transmitted via the internet (e.g. via email communication) may be subject to security breaches. Complete protection of your data from third-party access is not possible.<\/p>\n<p><strong>Notice concerning the party responsible for this website<\/strong><\/p>\n<p>The party responsible for processing data on this website is:<\/p>\n<p>TINT GmbH<br \/> Mainzer Landstraße 17-190<br \/> 60327 Frankfurt<\/p>\n<p>Phone: +44 7889 380938<br \/> Email: privacy@tintyoga.com<\/p>\n<p>The responsible party is the natural or legal person who alone or jointly with others decides on the purposes and means of processing personal data (names, email addresses, etc.).<\/p>\n<p><strong>Right to file complaints with regulatory authorities<\/strong><\/p>\n<p>If there has been a breach of data protection legislation, the person affected may file a complaint with the competent regulatory authorities. The competent regulatory authority for matters related to data protection legislation is the data protection officer of the German state in which our company is headquartered. A list of data protection officers and their contact details can be found at the following link:<span> <\/span><a href=\"https:\/\/www.bfdi.bund.de\/DE\/Infothek\/Anschriften_Links\/anschriften_links-node.html\">https:\/\/www.bfdi.bund.de\/DE\/Infothek\/Anschriften_Links\/anschriften_links-node.html<\/a>.<\/p>\n<p><strong>Right to data portability<\/strong><\/p>\n<p>You have the right to have data which we process based on your consent or in fulfilment of a contract automatically delivered to yourself or to a third party in a standard, machine-readable format. If you require the direct transfer of data to another responsible party, this will only be done to the extent technically feasible.<\/p>\n<p><strong>Revocation of your consent to the processing of your data<\/strong><\/p>\n<p>Many data processing operations are only possible with your express consent. You may revoke your consent at any time with future effect. An informal email making this request is sufficient. The data processed before we receive your request may still be legally processed.<\/p>\n<p><strong>SSL or TLS encryption<\/strong><\/p>\n<p>This site uses SSL or TLS encryption for security reasons and for the protection of the transmission of confidential content, such as the inquiries you send to us as the site operator. You can recognise an encrypted connection in your browser&#8217;s address line when it changes from &#8220;http:\/\/&#8221; to &#8220;https:\/\/&#8221; and the lock icon is displayed in your browser&#8217;s address bar.<\/p>\n<p>If SSL or TLS encryption is activated, the data you transfer to us cannot be read by third parties.<\/p>\n<p><strong>Information, blocking, deletion<\/strong><\/p>\n<p>As permitted by law, you have the right to be provided at any time with information free of charge about any of your personal data that is stored as well as its origin, the recipient and the purpose for which it has been processed. You also have the right to have this data corrected, blocked or deleted. You can contact us at any time using the address given in our legal notice if you have further questions on the topic of personal data.<\/p>\n<p><strong>Limitation of liability for internal content<\/strong><\/p>\n<p>Pursuant to section 7, para. 1 of the TMG (Telemediengesetz – Tele Media Act by German law), we as service providers are liable for our own content on these pages in accordance with general laws. However, pursuant to sections 8 to 10 of the TMG, we as service providers are not under obligation to monitor external information provided or stored on our website. Once we have become aware of a specific infringement of the law, we will immediately remove the content in question. Any liability concerning this matter can only be assumed from the point in time at which the infringement becomes known to us.<\/p>\n<p><strong>Copyright<\/strong><\/p>\n<p>The content and works published on this website are governed by the copyright laws of Germany. Any duplication, processing, distribution or any form of utilisation beyond the scope of copyright law shall require the prior written consent of the author or authors in question.<\/p>\n<p><strong>Limitation of liability for external links<\/strong><\/p>\n<p>Our website contains links to the websites of third parties (“external links”). As the content of these websites is not under our control, we cannot assume any liability for such external content. In all cases, the provider of information of the linked websites is liable for the content and accuracy of the information provided. At the point in time when the links were placed, no infringements of the law were recognisable to us. As soon as an infringement of the law becomes known to us, we will immediately remove the link in question.<\/p>\n<p><strong>Opposition to promotional emails<\/strong><\/p>\n<p>We hereby expressly prohibit the use of contact data published in the context of website legal notice requirements with regard to sending promotional and informational materials not expressly requested. The website operator reserves the right to take specific legal action if unsolicited advertising material, such as email spam, is received.<\/p>\n<p>&nbsp;<\/p>\n<h2>§ 3 &#8211; Data protection officer<\/h2>\n<p>Statutory data protection officer<br \/> We have appointed a data protection officer for our company: Stina Henrikson<br \/> Email:<span> <\/span><a href=\"mailto:privacy@tintyoga.com\">privacy@tintyoga.com<\/a><\/p>\n<p>&nbsp;<\/p>\n<h2>§ 4 &#8211; Data collection on our website<\/h2>\n<p><strong>Cookies<\/strong><\/p>\n<p>Some of our web pages use cookies. Cookies do not harm your computer and do not contain any viruses. Cookies help make our website more user-friendly, efficient, and secure. Cookies are small text files that are stored on your computer and saved by your browser.<\/p>\n<p>Most of the cookies we use are so-called &#8220;session cookies.&#8221; They are automatically deleted after your visit. Other cookies remain in your device&#8217;s memory until you delete them. These cookies make it possible to recognise your browser when you next visit the site.<\/p>\n<p>You can configure your browser to inform you about the use of cookies so that you can decide on a case-by-case basis whether to accept or reject a cookie. Alternatively, your browser can be configured to automatically accept cookies under certain conditions or to always reject them, or to automatically delete cookies when closing your browser. Disabling cookies may limit the functionality of this website.<\/p>\n<p>Cookies which are necessary to allow electronic communications or to provide certain functions you wish to use (such as the shopping cart) are stored pursuant to Art. 6 paragraph 1, letter f of DSGVO. The website operator has a legitimate interest in the storage of cookies to ensure an optimised service provided free of technical errors. If other cookies (such as those used to analyse your surfing behaviour) are also stored, they will be treated separately in this privacy policy.<\/p>\n<p><strong>Server log files<\/strong><\/p>\n<p>The website provider automatically collects and stores information that your browser automatically transmits to us in &#8220;server log files&#8221;. These are:<\/p>\n<p><em>Browser type and browser version, operating system used, referrer URL, host name of the accessing computer, time of the server request and IP address.<\/em><\/p>\n<p>These data will not be combined with data from other sources.<\/p>\n<p>The basis for data processing is Art. 6 (1) (b) DSGVO, which allows the processing of data to fulfil a contract or for measures preliminary to a contract.<\/p>\n<p><strong>Contact form<\/strong><\/p>\n<p>Should you send us questions via the contact form, we will collect the data entered on the form, including the contact details you provide, to answer your question and any follow-up questions. We do not share this information without your permission.<\/p>\n<p>We will, therefore, process any data you enter onto the contact form only with your consent per Art. 6 (1) (a) DSGVO. You may revoke your consent at any time. An informal email making this request is sufficient. The data processed before we receive your request may still be legally processed.<\/p>\n<p>We will retain the data you provide on the contact form until you request its deletion, revoke your consent for its storage, or the purpose for its storage no longer pertains (e.g. after fulfilling your request). Any mandatory statutory provisions, especially those regarding mandatory data retention periods, remain unaffected by this provision.<\/p>\n<p><strong>Registration on TINT.<\/strong><\/p>\n<p>You can register on our website in order to access additional functions offered here. The input data will only be used for the purpose of using the respective site or service for which you have registered. The mandatory information requested during registration must be provided in full. Otherwise, we will reject your registration.<\/p>\n<p>To inform you about important changes such as those within the scope of our site or technical changes, we will use the email address specified during registration.<\/p>\n<p>We will process the data provided during registration only based on your consent per Art. 6 (1) (a) DSGVO. You may revoke your consent at any time with future effect. An informal email making this request is sufficient. The data processed before we receive your request may still be legally processed.<\/p>\n<p>We will continue to store the data collected during registration for as long as you remain registered on our website. Statutory retention periods remain unaffected.<\/p>\n<p>Data transferred when signing up for services and digital content<\/p>\n<p>We transmit personally identifiable data to third parties only to the extent required to fulfil the terms of your contract with us, for example, to banks entrusted to process your payments.<\/p>\n<p>Your data will not be transmitted for any other purpose unless you have given your express permission to do so. Your data will not be disclosed to third parties for advertising purposes without your express consent.<\/p>\n<p>The basis for data processing is Art. 6 (1) (b) DSGVO, which allows the processing of data to fulfil a contract or for measures preliminary to a contract.<\/p>\n<p><strong>Processing of data (customer and contract data)<\/strong><\/p>\n<p>We collect, process, and use personal data only insofar as it is necessary to establish, or modify legal relationships with us (master data). This is done based on Art. 6 (1) (b) DSGVO, which allows the processing of data to fulfil a contract or for measures preliminary to a contract. We collect, process and use your personal data when accessing our website (usage data) only to the extent required to enable you to access our service or to bill you for the same.<\/p>\n<p>Collected customer data shall be deleted after completion of the order or termination of the business relationship. Legal retention periods remain unaffected.<\/p>\n<p>Data transmitted when entering into a contract with online shops, retailers, and mail order<\/p>\n<p>We transmit personally identifiable data to third parties only to the extent required to fulfil the terms of your contract, for example, to companies entrusted to deliver goods to your location or banks entrusted to process your payments. Your data will not be transmitted for any other purpose unless you have given your express permission to do so. Your data will not be disclosed to third parties for advertising purposes without your express consent.<\/p>\n<p>The basis for data processing is Art. 6 (1) (b) DSGVO, which allows the processing of data to fulfil a contract or for measures preliminary to a contract.<\/p>\n<p>&nbsp;<\/p>\n<h2>§ 5 Social Media<\/h2>\n<p><strong>Share content via plugins (Facebook, Google+1, Twitter, etc.)<\/strong><\/p>\n<p>The content on our pages can be shared on other social networks like Facebook, Twitter, or Google+. Our users can share the content of this page on social networks without their providers creating profiles of users&#8217; surfing behaviour.<\/p>\n<p><strong>Google+ plugin<\/strong><\/p>\n<p>Our pages use Google+ functions. It is operated by Google Inc., 1600 Amphitheatre Parkway, Mountain View, CA 94043, USA.<\/p>\n<p>Collection and disclosure of information: Using the Google +1 button allows you to publish information worldwide. By means of the Google+ button, you and other users can receive custom content from Google and our partners. Google stores both the fact that you have +1&#8217;d a piece of content and information about the page you were viewing when you clicked +1. Your +1 can be displayed together with your profile name and photo in Google services, for example in search results or in your Google profile, or in other places on websites and advertisements on the Internet.<\/p>\n<p>Google records information about your +1 activities to improve Google services for you and others. To use the Google + button, you need a globally visible, public Google profile that must contain at least the name chosen for the profile. This name is used by all Google services. In some cases, this name may also replace a different name that you have used to share content via your Google account. The identity of your Google profile can be shown to users who know your email address or other information that can identify you.<\/p>\n<p>Use of collected data: In addition to the uses mentioned above, the information you provide is used in accordance with the applicable Google data protection policies. Google may publish summary statistics about users&#8217; +1 activity or share it with users and partners, such as publishers, advertisers, or affiliate websites.<\/p>\n<p><strong>Instagram plugin<\/strong><\/p>\n<p>Our website contains functions of the Instagram service. These functions are offered by Instagram Inc., 1601 Willow Road, Menlo Park, CA 94025, USA.<\/p>\n<p>If you are logged into your Instagram account, you can click the Instagram button to link the content of our pages with your Instagram profile. This means that Instagram can associate visits to our pages with your user account. As the provider of this website, we expressly point out that we receive no information on the content of the transmitted data or its use by Instagram.<\/p>\n<p>For more information, see the Instagram Privacy Policy:<span> <\/span><a href=\"https:\/\/instagram.com\/about\/legal\/privacy\/\">https:\/\/instagram.com\/about\/legal\/privacy\/<\/a>.<\/p>\n<p>&nbsp;<\/p>\n<h2>§ 6 Analytics and advertising<\/h2>\n<p><strong>Google Analytics<\/strong><\/p>\n<p>TINT GmbH uses Google Analytics, a web analytics service. It is operated by Google Inc., 1600 Amphitheatre Parkway, Mountain View, CA 94043, USA.<\/p>\n<p>Google Analytics uses so-called &#8220;cookies&#8221;. These are text files that are stored on your computer and that allow an analysis of the use of the website by you. The information generated by the cookie about your use of this website is usually transmitted to a Google server in the USA and stored there.<\/p>\n<p>Google Analytics cookies are stored based on Art. 6 (1) (f) DSGVO. The website operator has a legitimate interest in analysing user behaviour to optimise both its website and its advertising.<\/p>\n<p><strong>Browser plugin<\/strong><\/p>\n<p>You can prevent these cookies being stored by selecting the appropriate settings in your browser. However, we wish to point out that doing so may mean you will not be able to enjoy the full functionality of TINT. You can also prevent the data generated by cookies about your use of the website (incl. your IP address) from being passed to Google, and the processing of these data by Google, by downloading and installing the browser plugin available at the following link:<span> <\/span><a href=\"https:\/\/tools.google.com\/dlpage\/gaoptout?hl=en\">https:\/\/tools.google.com\/dlpage\/gaoptout?hl=en<\/a>.<\/p>\n<p><strong>Objecting to the collection of data<\/strong><\/p>\n<p>You can prevent the collection of your data by Google Analytics by clicking on the following link. An opt-out cookie will be set to prevent your data from being collected on future visits to this site: Disable Google Analytics.<\/p>\n<p>For more information about how Google Analytics handles user data, see Google&#8217;s privacy policy:<span> <\/span><a href=\"https:\/\/support.google.com\/analytics\/answer\/6004245?hl=en\">https:\/\/support.google.com\/analytics\/answer\/6004245?hl=en<\/a>.<\/p>\n<p><strong>Outsourced data processing<\/strong><\/p>\n<p>We have entered into an agreement with Google for the outsourcing of our data processing and fully implement the strict requirements of the German data protection authorities when using Google Analytics.<\/p>\n<p><strong>IP anonymization<\/strong><\/p>\n<p>We have activated the IP anonymization feature on this website. Your IP address will be shortened by Google within the European Union or other parties to the Agreement on the European Economic Area prior to transmission to the United States. Only in exceptional cases is the full IP address sent to a Google server in the US and shortened there. Google will use this information on behalf of the operator of this website to evaluate your use of the website, to compile reports on website activity, and to provide other services regarding website activity and Internet usage for the website operator. The IP address transmitted by your browser as part of Google Analytics will not be merged with any other data held by Google.<\/p>\n<p><strong>WordPress Stats<\/strong><\/p>\n<p>TINT GmbH uses the WordPress Stats tool to perform statistical analyses of visitor traffic. This service is provided by Automattic Inc., 60 29th Street # 343, San Francisco, CA 94110-4929, USA.<\/p>\n<p>WordPress Stats uses cookies that are stored on your computer and allow an analysis of the use of the website. The information generated by the cookies about the use of our website is stored on servers in the USA. Your IP address will be anonymised after processing and before storage.<\/p>\n<p>WordPress Stats cookies remain on your device until you delete them.<\/p>\n<p>The storage of &#8220;WordPress Stats&#8221; cookies is based on Art. 6 (1) (f) DSGVO. The website operator has a legitimate interest in analysing user behaviour to optimise both its website and its advertising.<\/p>\n<p>You can configure your browser to inform you about the use of cookies so that you can decide on a case-by-case basis whether to accept or reject a cookie. Alternatively, your browser can be configured to automatically accept cookies under certain conditions or to always reject them, or to automatically delete cookies when closing your browser. The functionality of our services may be limited when cookies are disabled.<\/p>\n<p>You can object to the collection and use of your data at any time with future effect by clicking on this link and setting an opt-out cookie in your browser:<span> <\/span><a href=\"https:\/\/www.quantcast.com\/opt-out\/\">https:\/\/www.quantcast.com\/opt-out\/<\/a>.<\/p>\n<p>If you delete the cookies on your computer, you will have to set the opt-out cookie again.<\/p>\n<p><strong>Google Analytics Remarketing<\/strong><\/p>\n<p>Our websites use the features of Google Analytics Remarketing combined with the cross-device capabilities of Google AdWords and DoubleClick. This service is provided by Google Inc., 1600 Amphitheater Parkway, Mountain View, CA 94043, USA.<\/p>\n<p>This feature makes it possible to link target audiences for promotional marketing created with Google Analytics Remarketing to the cross-device capabilities of Google AdWords and Google DoubleClick. This allows advertising to be displayed based on your personal interests, identified based on your previous usage and surfing behaviour on one device (e.g. your mobile phone), on other devices (such as a tablet or computer).<\/p>\n<p>Once you have given your consent, Google will associate your web and app browsing history with your Google Account for this purpose. That way, any device that signs in to your Google Account can use the same personalised promotional messaging.<\/p>\n<p>To support this feature, Google Analytics collects Google-authenticated IDs of users that are temporarily linked to our Google Analytics data to define and create audiences for cross-device ad promotion.<\/p>\n<p>You can permanently opt out of cross-device remarketing\/targeting by turning off personalised advertising in your Google Account; follow this link:<span> <\/span><a href=\"https:\/\/www.google.com\/settings\/ads\/onweb\/\">https:\/\/www.google.com\/settings\/ads\/onweb\/<\/a>.<\/p>\n<p>The aggregation of the data collected in your Google Account data is based solely on your consent, which you may give or withdraw from Google per Art. 6 (1) (a) DSGVO. For data collection operations not merged into your Google Account (for example, because you do not have a Google Account or have objected to the merge), the collection of data is based on Art. 6 (1) (f) DSGVO. The website operator has a legitimate interest in analysing anonymous user behaviour for promotional purposes.<\/p>\n<p>For more information and the Google Privacy Policy, go to:<span> <\/span><a href=\"https:\/\/www.google.com\/policies\/technologies\/ads\/\">https:\/\/www.google.com\/policies\/technologies\/ads\/<\/a>.<\/p>\n<p><strong>Google AdWords and Google Conversion Tracking<\/strong><\/p>\n<p>This website uses Google AdWords. AdWords is an online advertising program from Google Inc., 1600 Amphitheater Parkway, Mountain View, CA 94043, United States (&#8220;Google&#8221;).<\/p>\n<p>As part of Google AdWords, we use so-called conversion tracking. When you click on an ad served by Google, a conversion tracking cookie is set. Cookies are small text files that your internet browser stores on your computer. These cookies expire after 30 days and are not used for personal identification of the user. Should the user visit certain pages of the website and the cookie has not yet expired, Google and the website can tell that the user clicked on the ad and proceeded to that page.<\/p>\n<p>Each Google AdWords advertiser has a different cookie. Thus, cookies cannot be tracked using the website of an AdWords advertiser. The information obtained using the conversion cookie is used to create conversion statistics for the AdWords advertisers who have opted for conversion tracking. Customers are told the total number of users who clicked on their ad and were redirected to a conversion tracking tag page. However, advertisers do not obtain any information that can be used to personally identify users. If you do not want to participate in tracking, you can opt-out of this by easily disabling the Google Conversion Tracking cookie by changing your browser settings. In doing so, you will not be included in the conversion tracking statistics.<\/p>\n<p>Conversion cookies are stored based on Art. 6 (1) (f) DSGVO. The website operator has a legitimate interest in analysing user behaviour to optimise both its website and its advertising.<\/p>\n<p>For more information about Google AdWords and Google Conversion Tracking, see the Google Privacy Policy:<span> <\/span><a href=\"https:\/\/www.google.de\/policies\/privacy\/\">https:\/\/www.google.de\/policies\/privacy\/<\/a>.<\/p>\n<p>You can configure your browser to inform you about the use of cookies so that you can decide on a case-by-case basis whether to accept or reject a cookie. Alternatively, your browser can be configured to automatically accept cookies under certain conditions or to always reject them, or to automatically delete cookies when closing your browser. Please notice that disabling cookies may limit the functionality of this website.<\/p>\n<p><strong>Facebook Retargeting<\/strong><\/p>\n<p>We are further using your data to retarget you via Facebook. This makes it possible to link target audiences for promotional marketing. It allows advertising to be displayed based on your previous usage of our website.<\/p>\n<p>You can permanently opt out of this direct remarketing\/retargeting by sending an email to<span> <\/span><a href=\"mailto:privacy@tintyoga.com\">privacy@tintyoga.com<\/a><span> <\/span>and declaring that you do not wish to be retargeted by us via Facebook.<\/p>\n<p>&nbsp;<\/p>\n<h2>§ 7 &#8211; Newsletter<\/h2>\n<p><strong>Newsletter data<\/strong><\/p>\n<p>If you would like to receive our newsletter, we require a valid email address as well as information that allows us to verify that you are the owner of the specified email address and that you agree to receive this newsletter. No additional data is collected or is only collected on a voluntary basis. We only use this data to send the requested information and do not pass it on to third parties.<\/p>\n<p>We will, therefore, process any data you enter onto the contact form only with your consent per Art. 6 (1) (a) DSGVO. You can revoke consent to the storage of your data and email address as well as their use for sending the newsletter at any time, e.g. through the &#8220;unsubscribe&#8221; link in the newsletter. The data processed before we receive your request may still be legally processed.<\/p>\n<p>The data provided when registering for the newsletter will be used to distribute the newsletter until you cancel your subscription when said data will be deleted. Data we have stored for other purposes (e.g. email addresses for the members area) remain unaffected.<\/p>\n<p><strong>MailChimp<\/strong><\/p>\n<p>TINT GmbH uses the services of MailChimp to send newsletters. This service is provided by Rocket Science Group LLC, 675 Ponce De Leon Ave NE, Suite 5000, Atlanta, GA 30308, USA.<\/p>\n<p>MailChimp is a service which organises and analyses the distribution of newsletters. If you provide data (e.g. your email address) to subscribe to our newsletter, it will be stored on MailChimp servers in the USA.<\/p>\n<p>MailChimp is certified under the EU-US Privacy Shield. The Privacy Shield is an agreement between the European Union (EU) and the US to ensure compliance with European privacy standards in the United States.<\/p>\n<p>We use MailChimp to analyse our newsletter campaigns. When you open an email sent by MailChimp, a file included in the email (called a web beacon) connects to MailChimp&#8217;s servers in the United States. This allows us to determine if a newsletter message has been opened and which links you click on. In addition, technical information is collected (e.g. time of retrieval, IP address, browser type, and operating system). This information cannot be assigned to a specific recipient. It is used exclusively for the statistical analysis of our newsletter campaigns. The results of these analyses can be used to better tailor future newsletters to your interests.<\/p>\n<p>If you do not want your usage of the newsletter to be analysed by MailChimp, you will have to unsubscribe from the newsletter. For this purpose, we provide a link in every newsletter we send. You can also unsubscribe from the newsletter directly on the website.<\/p>\n<p>Data processing is based on Art. 6 (1) (a) DSGVO. You may revoke your consent at any time by unsubscribing to the newsletter. The data processed before we receive your request may still be legally processed.<\/p>\n<p>The data provided when registering for the newsletter will be used to distribute the newsletter until you cancel your subscription when said data will be deleted from our servers and those of MailChimp. Data we have stored for other purposes (e.g. email addresses for the members area) remains unaffected.<\/p>\n<p>For details, see the MailChimp privacy policy at<span> <\/span><a href=\"https:\/\/mailchimp.com\/legal\/terms\/\">https:\/\/mailchimp.com\/legal\/terms\/<\/a>.<\/p>\n<p>Completion of a data processing agreement<\/p>\n<p>We have entered into a data processing agreement with MailChimp, in which we require MailChimp to protect the data of our customers and not to disclose said data to third parties. This agreement may be viewed at the following link:<span> <\/span><a href=\"https:\/\/mailchimp.com\/legal\/forms\/data-processing-agreement\/sample-agreement\/\">https:\/\/mailchimp.com\/legal\/forms\/data-processing-agreement\/sample-agreement\/<\/a>.<\/p>\n<p>&nbsp;<\/p>\n<h2>§ 8 &#8211; Plugins and tools<\/h2>\n<p><strong>YouTube<\/strong><\/p>\n<p>Our website uses plugins from YouTube, which is operated by Google. The operator of the pages is YouTube LLC, 901 Cherry Ave., San Bruno, CA 94066, USA.<\/p>\n<p>If you visit one of our pages featuring a YouTube plugin, a connection to the YouTube servers is established. Here the YouTube server is informed about which of our pages you have visited.<\/p>\n<p>If you&#8217;re logged in to your YouTube account, YouTube allows you to associate your browsing behaviour directly with your personal profile. You can prevent this by logging out of your YouTube account.<\/p>\n<p>YouTube is used to help make our website appealing. This constitutes a justified interest pursuant to Art. 6 (1) (f) DSGVO.<\/p>\n<p>Further information about handling user data, can be found in the data protection declaration of YouTube under<span> <\/span><a href=\"https:\/\/www.google.de\/intl\/de\/policies\/privacy\">https:\/\/www.google.de\/intl\/de\/policies\/privacy<\/a>.<\/p>\n<p><strong>Vimeo<\/strong><\/p>\n<p>Our website uses features provided by the Vimeo video portal. This service is provided by Vimeo Inc., 555 West 18th Street, New York, New York 10011, USA.<\/p>\n<p>If you visit one of our pages featuring a Vimeo plugin, a connection to the Vimeo servers is established. Here the Vimeo server is informed about which of our pages you have visited. In addition, Vimeo will receive your IP address. This also applies if you are not logged in to Vimeo when you visit our website or do not have a Vimeo account. The information is transmitted to a Vimeo server in the US, where it is stored.<\/p>\n<p>If you are logged in to your Vimeo account, Vimeo allows you to associate your browsing behavior directly with your personal profile. You can prevent this by logging out of your Vimeo account.<\/p>\n<p>For more information on how to handle user data, please refer to the Vimeo Privacy Policy at<span> <\/span><a href=\"https:\/\/vimeo.com\/privacy\">https:\/\/vimeo.com\/privacy<\/a>.<\/p>\n<p><strong>Google Web Fonts<\/strong><\/p>\n<p>For uniform representation of fonts, this page uses web fonts provided by Google. When you open a page, your browser loads the required web fonts into your browser cache to display texts and fonts correctly.<\/p>\n<p>When you call up a page of our website that contains a social plugin, your browser makes a direct connection with Google servers. Google thus becomes aware that our web page was accessed via your IP address. The use of Google Web fonts is done in the interest of a uniform and attractive presentation of our website. This constitutes a justified interest pursuant to Art. 6 (1) (f) DSGVO.<\/p>\n<p>If your browser does not support web fonts, a standard font is used by your computer.<\/p>\n<p>Further information about handling user data, can be found at<span> <\/span><a href=\"https:\/\/developers.google.com\/fonts\/faq\">https:\/\/developers.google.com\/fonts\/faq<\/a><span> <\/span>and in Google&#8217;s privacy policy at<span> <\/span><a href=\"https:\/\/www.google.com\/policies\/privacy\/\">https:\/\/www.google.com\/policies\/privacy\/<\/a>.<\/p>\n<p>&nbsp;<\/p>\n<h2>§ 9 &#8211; Payment service providers<\/h2>\n<p><strong>PayPal<\/strong><\/p>\n<p>Our website accepts payments via PayPal. The provider of this service is PayPal (Europe) S. à r. l. et Cie, S.C.A., 22-24 Boulevard Royal, L-2449 Luxembourg.<\/p>\n<p>If you select payment via PayPal, the payment data you provide will be supplied to PayPal based on Art. 6 (1) (a) (Consent) and Art. 6 (1) (b) DSGVO (Processing for contract purposes). You have the option to revoke your consent at any time with future effect. It does not affect the processing of data previously collected.<\/p>\n<p><strong>Stripe<\/strong><\/p>\n<p>Our website accepts payments via Stripe. The provider of this service is Stripe, Inc., 185 Berry Street, Suite 550, San Francisco, CA 94107, USA.<\/p>\n<p>If you select payment via Stripe, the payment data you provide will be supplied to Stripe based on Art. 6 (1) (a) (Consent) and Art. 6 (1) (b) DSGVO (Processing for contract purposes). You have the option to revoke your consent at any time with future effect. It does not affect the processing of data previously collected.<\/p>\n<p>[\/et_pb_text][\/et_pb_column][\/et_pb_row][\/et_pb_section]<\/p>\n","protected":false},"excerpt":{"rendered":"<p>Privacy Policy§ 1 &#8211; Overview of data protection General The following gives a simple overview of what happens to your personal information when you visit our website. Personal information is any data with which you could be personally identified. Detailed information on the subject of data protection can be found in our privacy policy found [&hellip;]<\/p>\n","protected":false},"author":7,"featured_media":0,"parent":0,"menu_order":0,"comment_status":"closed","ping_status":"closed","template":"","meta":{"_et_pb_use_builder":"on","_et_pb_old_content":"","_et_gb_content_width":""},"wf_page_folders":[18],"yoast_head":"<!-- This site is optimized with the Yoast SEO plugin v19.10 - https:\/\/yoast.com\/wordpress\/plugins\/seo\/ -->\n<title>TINT Yoga terms, conditions &amp; policies - TINT Yoga<\/title>\n<meta name=\"description\" content=\"Enjoy online yoga workshops with the world&#039;s most popular yoga teachers. Find your mentor and start working out with our online videos.\" \/>\n<meta name=\"robots\" content=\"index, follow, max-snippet:-1, max-image-preview:large, max-video-preview:-1\" \/>\n<link rel=\"canonical\" href=\"https:\/\/tintyoga.com\/privacy-policy\/\" \/>\n<meta property=\"og:locale\" content=\"en_US\" \/>\n<meta property=\"og:type\" content=\"article\" \/>\n<meta property=\"og:title\" content=\"TINT Yoga terms, conditions &amp; policies\" \/>\n<meta property=\"og:description\" content=\"Enjoy online yoga workshops with the world&#039;s most popular yoga teachers. Find your mentor and start working out with our online videos.\" \/>\n<meta property=\"og:url\" content=\"https:\/\/tintyoga.com\/privacy-policy\/\" \/>\n<meta property=\"og:site_name\" content=\"TINT Yoga\" \/>\n<meta property=\"article:publisher\" content=\"https:\/\/www.facebook.com\/tintyoga\/\" \/>\n<meta property=\"og:image\" content=\"https:\/\/tintyoga.com\/wp-content\/uploads\/2019\/06\/TINT_Goemboec.png\" \/>\n\t<meta property=\"og:image:width\" content=\"750\" \/>\n\t<meta property=\"og:image:height\" content=\"750\" \/>\n\t<meta property=\"og:image:type\" content=\"image\/png\" \/>\n<meta name=\"twitter:card\" content=\"summary_large_image\" \/>\n<meta name=\"twitter:label1\" content=\"Est. reading time\" \/>\n\t<meta name=\"twitter:data1\" content=\"27 minutes\" \/>\n<script type=\"application\/ld+json\" class=\"yoast-schema-graph\">{\"@context\":\"https:\/\/schema.org\",\"@graph\":[{\"@type\":\"WebPage\",\"@id\":\"https:\/\/tintyoga.com\/privacy-policy\/\",\"url\":\"https:\/\/tintyoga.com\/privacy-policy\/\",\"name\":\"TINT Yoga terms, conditions & policies - TINT Yoga\",\"isPartOf\":{\"@id\":\"https:\/\/tintyoga.com\/#website\"},\"datePublished\":\"2020-05-25T11:11:16+00:00\",\"dateModified\":\"2020-05-25T11:11:16+00:00\",\"description\":\"Enjoy online yoga workshops with the world's most popular yoga teachers. Find your mentor and start working out with our online videos.\",\"breadcrumb\":{\"@id\":\"https:\/\/tintyoga.com\/privacy-policy\/#breadcrumb\"},\"inLanguage\":\"en-US\",\"potentialAction\":[{\"@type\":\"ReadAction\",\"target\":[\"https:\/\/tintyoga.com\/privacy-policy\/\"]}]},{\"@type\":\"BreadcrumbList\",\"@id\":\"https:\/\/tintyoga.com\/privacy-policy\/#breadcrumb\",\"itemListElement\":[{\"@type\":\"ListItem\",\"position\":1,\"name\":\"Home\",\"item\":\"https:\/\/tintyoga.com\/\"},{\"@type\":\"ListItem\",\"position\":2,\"name\":\"Privacy Policy\"}]},{\"@type\":\"WebSite\",\"@id\":\"https:\/\/tintyoga.com\/#website\",\"url\":\"https:\/\/tintyoga.com\/\",\"name\":\"TINT Yoga\",\"description\":\"TINT Yoga offers premium online yoga classes with the world&#039;s most popular yoga and movement instructors. Learn and work out with our online yoga videos.\",\"publisher\":{\"@id\":\"https:\/\/tintyoga.com\/#organization\"},\"potentialAction\":[{\"@type\":\"SearchAction\",\"target\":{\"@type\":\"EntryPoint\",\"urlTemplate\":\"https:\/\/tintyoga.com\/?s={search_term_string}\"},\"query-input\":\"required name=search_term_string\"}],\"inLanguage\":\"en-US\"},{\"@type\":\"Organization\",\"@id\":\"https:\/\/tintyoga.com\/#organization\",\"name\":\"TINT Yoga\",\"url\":\"https:\/\/tintyoga.com\/\",\"logo\":{\"@type\":\"ImageObject\",\"inLanguage\":\"en-US\",\"@id\":\"https:\/\/tintyoga.com\/#\/schema\/logo\/image\/\",\"url\":\"https:\/\/tintyoga.com\/wp-content\/uploads\/2021\/08\/logo_color_black.png\",\"contentUrl\":\"https:\/\/tintyoga.com\/wp-content\/uploads\/2021\/08\/logo_color_black.png\",\"width\":1001,\"height\":301,\"caption\":\"TINT Yoga\"},\"image\":{\"@id\":\"https:\/\/tintyoga.com\/#\/schema\/logo\/image\/\"},\"sameAs\":[\"https:\/\/www.instagram.com\/tint_yoga\/\",\"https:\/\/de.linkedin.com\/company\/tint-gmbh\",\"https:\/\/www.pinterest.de\/tintyoga\/\",\"https:\/\/www.youtube.com\/channel\/UC2HjTe0TL20qSk8e3s1d0DA\",\"https:\/\/www.facebook.com\/tintyoga\/\"]}]}<\/script>\n<!-- \/ Yoast SEO plugin. -->","yoast_head_json":{"title":"TINT Yoga terms, conditions & policies - TINT Yoga","description":"Enjoy online yoga workshops with the world's most popular yoga teachers. Find your mentor and start working out with our online videos.","robots":{"index":"index","follow":"follow","max-snippet":"max-snippet:-1","max-image-preview":"max-image-preview:large","max-video-preview":"max-video-preview:-1"},"canonical":"https:\/\/tintyoga.com\/privacy-policy\/","og_locale":"en_US","og_type":"article","og_title":"TINT Yoga terms, conditions & policies","og_description":"Enjoy online yoga workshops with the world's most popular yoga teachers. Find your mentor and start working out with our online videos.","og_url":"https:\/\/tintyoga.com\/privacy-policy\/","og_site_name":"TINT Yoga","article_publisher":"https:\/\/www.facebook.com\/tintyoga\/","og_image":[{"width":750,"height":750,"url":"https:\/\/tintyoga.com\/wp-content\/uploads\/2019\/06\/TINT_Goemboec.png","type":"image\/png"}],"twitter_card":"summary_large_image","twitter_misc":{"Est. reading time":"27 minutes"},"schema":{"@context":"https:\/\/schema.org","@graph":[{"@type":"WebPage","@id":"https:\/\/tintyoga.com\/privacy-policy\/","url":"https:\/\/tintyoga.com\/privacy-policy\/","name":"TINT Yoga terms, conditions & policies - TINT Yoga","isPartOf":{"@id":"https:\/\/tintyoga.com\/#website"},"datePublished":"2020-05-25T11:11:16+00:00","dateModified":"2020-05-25T11:11:16+00:00","description":"Enjoy online yoga workshops with the world's most popular yoga teachers. Find your mentor and start working out with our online videos.","breadcrumb":{"@id":"https:\/\/tintyoga.com\/privacy-policy\/#breadcrumb"},"inLanguage":"en-US","potentialAction":[{"@type":"ReadAction","target":["https:\/\/tintyoga.com\/privacy-policy\/"]}]},{"@type":"BreadcrumbList","@id":"https:\/\/tintyoga.com\/privacy-policy\/#breadcrumb","itemListElement":[{"@type":"ListItem","position":1,"name":"Home","item":"https:\/\/tintyoga.com\/"},{"@type":"ListItem","position":2,"name":"Privacy Policy"}]},{"@type":"WebSite","@id":"https:\/\/tintyoga.com\/#website","url":"https:\/\/tintyoga.com\/","name":"TINT Yoga","description":"TINT Yoga offers premium online yoga classes with the world&#039;s most popular yoga and movement instructors. Learn and work out with our online yoga videos.","publisher":{"@id":"https:\/\/tintyoga.com\/#organization"},"potentialAction":[{"@type":"SearchAction","target":{"@type":"EntryPoint","urlTemplate":"https:\/\/tintyoga.com\/?s={search_term_string}"},"query-input":"required name=search_term_string"}],"inLanguage":"en-US"},{"@type":"Organization","@id":"https:\/\/tintyoga.com\/#organization","name":"TINT Yoga","url":"https:\/\/tintyoga.com\/","logo":{"@type":"ImageObject","inLanguage":"en-US","@id":"https:\/\/tintyoga.com\/#\/schema\/logo\/image\/","url":"https:\/\/tintyoga.com\/wp-content\/uploads\/2021\/08\/logo_color_black.png","contentUrl":"https:\/\/tintyoga.com\/wp-content\/uploads\/2021\/08\/logo_color_black.png","width":1001,"height":301,"caption":"TINT Yoga"},"image":{"@id":"https:\/\/tintyoga.com\/#\/schema\/logo\/image\/"},"sameAs":["https:\/\/www.instagram.com\/tint_yoga\/","https:\/\/de.linkedin.com\/company\/tint-gmbh","https:\/\/www.pinterest.de\/tintyoga\/","https:\/\/www.youtube.com\/channel\/UC2HjTe0TL20qSk8e3s1d0DA","https:\/\/www.facebook.com\/tintyoga\/"]}]}},"acf":[],"_links":{"self":[{"href":"https:\/\/tintyoga.com\/wp-json\/wp\/v2\/pages\/138768"}],"collection":[{"href":"https:\/\/tintyoga.com\/wp-json\/wp\/v2\/pages"}],"about":[{"href":"https:\/\/tintyoga.com\/wp-json\/wp\/v2\/types\/page"}],"author":[{"embeddable":true,"href":"https:\/\/tintyoga.com\/wp-json\/wp\/v2\/users\/7"}],"replies":[{"embeddable":true,"href":"https:\/\/tintyoga.com\/wp-json\/wp\/v2\/comments?post=138768"}],"version-history":[{"count":5,"href":"https:\/\/tintyoga.com\/wp-json\/wp\/v2\/pages\/138768\/revisions"}],"predecessor-version":[{"id":138777,"href":"https:\/\/tintyoga.com\/wp-json\/wp\/v2\/pages\/138768\/revisions\/138777"}],"wp:attachment":[{"href":"https:\/\/tintyoga.com\/wp-json\/wp\/v2\/media?parent=138768"}],"wp:term":[{"taxonomy":"wf_page_folders","embeddable":true,"href":"https:\/\/tintyoga.com\/wp-json\/wp\/v2\/wf_page_folders?post=138768"}],"curies":[{"name":"wp","href":"https:\/\/api.w.org\/{rel}","templated":true}]}}