{"id":138725,"date":"2020-05-25T11:42:23","date_gmt":"2020-05-25T10:42:23","guid":{"rendered":"https:\/\/tintyoga.com\/?page_id=138725"},"modified":"2022-09-16T10:45:51","modified_gmt":"2022-09-16T09:45:51","slug":"terms-of-use","status":"publish","type":"page","link":"https:\/\/tintyoga.com\/terms-of-use\/","title":{"rendered":"Terms of Use"},"content":{"rendered":"<p>[et_pb_section fb_built=&#8221;1&#8243; _builder_version=&#8221;4.4.6&#8243; global_colors_info=&#8221;{}&#8221;][et_pb_row _builder_version=&#8221;4.4.6&#8243; global_colors_info=&#8221;{}&#8221;][et_pb_column type=&#8221;4_4&#8243; _builder_version=&#8221;4.4.6&#8243; global_colors_info=&#8221;{}&#8221;][et_pb_text _builder_version=&#8221;4.4.6&#8243; text_font=&#8221;|||on|||||&#8221; header_font=&#8221;Josefin Sans|||on|||||&#8221; global_colors_info=&#8221;{}&#8221;]<\/p>\n<h1>Legal Notice &amp; Terms of Use<\/h1>\n<p>[\/et_pb_text][\/et_pb_column][\/et_pb_row][et_pb_row _builder_version=&#8221;4.4.6&#8243; global_colors_info=&#8221;{}&#8221;][et_pb_column type=&#8221;4_4&#8243; _builder_version=&#8221;4.4.6&#8243; global_colors_info=&#8221;{}&#8221;][et_pb_text _builder_version=&#8221;4.6.6&#8243; header_font=&#8221;Josefin Sans|||on|||||&#8221; header_2_font=&#8221;Josefin Sans|||on|||||&#8221; global_colors_info=&#8221;{}&#8221;]<\/p>\n<h2>Legal Notice<\/h2>\n<p><strong>Information provided according to Sec. 5 German Telemedia Act (TMG):<\/strong><\/p>\n<p>TINT GmbH<br \/>Mainzer Landstraße 178-190<br \/>60327 Frankfurt<\/p>\n<p><strong>Represented by:<br \/><\/strong>Young Ho Kim<br \/>Rüdiger Rohner<\/p>\n<p><strong>Contact:<br \/><\/strong>Telephone: +49 69 677785 12<br \/>Email: namaste@tintyoga.com<\/p>\n<p><strong>Register entry:<br \/><\/strong>Entry in the Handelsregister on 23 February 2016.<br \/>Registering court: Amtsgericht Frankfurt<br \/>Registration number: HRB 105303<\/p>\n<p><strong>VAT:<br \/><\/strong>VAT ID number according to Sec. 27 a German Value Added Tax Act:<br \/>DE306473707<\/p>\n<p><strong>Dispute resolution<\/strong><\/p>\n<p>The European Commission provides a platform for online dispute resolution (OS):<span> <\/span><a href=\"https:\/\/ec.europa.eu\/consumers\/odr\">https:\/\/ec.europa.eu\/consumers\/odr<\/a>.<\/p>\n<p>Please find our email in the legal notice. We do not take part in online dispute resolutions at consumer arbitration boards.<\/p>\n<p><strong>Liability for Contents<\/strong><\/p>\n<p>As service providers, we are liable for own contents of these websites according to Sec. 7, paragraph 1 German Telemedia Act (TMG). However, service providers are not obligated to permanently monitor submitted or stored information or to search evidence that indicates illegal activities, according to Sec. 8 to 10 German Telemedia Act (TMG).<\/p>\n<p>Legal obligations to removing information or to blocking the use of information remain unchallenged. In this case, liability is only possible at the time of knowledge about a specific violation of the law. Illegal contents will be removed immediately at the time we get knowledge of them.<\/p>\n<p><strong>Liability for Links<\/strong><\/p>\n<p>Our offer includes links to external third party websites. We have no influence on the contents of those websites, therefore we cannot guarantee for those contents. Providers or administrators of linked websites are always responsible for their own contents.<\/p>\n<p>The linked websites had been checked for possible violations of law at the time of the establishment of the link. Illegal contents were not detected at the time of the linking. Permanent monitoring of the contents of linked websites cannot be imposed without reasonable indications that there has been a violation of the law. Illegal links will be removed immediately at the time we get knowledge of them.<\/p>\n<p><strong>Copyright<\/strong><\/p>\n<p>Contents and compilations published on these websites by the providers are subject to German copyright laws. Reproduction, editing, distribution as well as the use of any kind outside the scope of the copyright law require written permission of the author or originator. Downloads and copies of these websites are permitted for private use only.<\/p>\n<p>The commercial use of our contents without permission of the originator is prohibited.<\/p>\n<p>Copyright laws of third parties are respected as long as the contents on these websites do not originate from the provider. Contributions of third parties on this site are indicated as such. However, if you notice any violations of copyright law, please inform us. Such contents will be removed immediately.<\/p>\n<h2><strong> <\/strong><\/h2>\n<h2><strong>TERMS OF USE<\/strong><\/h2>\n<p><strong>Introduction<\/strong><\/p>\n<p>These terms and conditions govern your use of our website; by using our website, you accept these terms and conditions in full. If you disagree with these terms and conditions or any part of these terms and conditions, you must not use our website. License to use website unless otherwise stated, we or our licensors own the intellectual property rights in the website and material on the website. Subject to the license below, all these intellectual property rights are reserved. You may view, download for caching purposes only, and print pages from the website for your own personal use, subject to the restrictions set out below and elsewhere in these terms and conditions.<\/p>\n<p>YOU MUST NOT:<\/p>\n<p>(a) republish material from this website (including republication on another website);<\/p>\n<p>(b) sell, rent or sub-license material from the website;<\/p>\n<p>(c) show any material from the website in public;<\/p>\n<p>(d) reproduce, duplicate, copy or otherwise exploit material on our website for a commercial purpose;<\/p>\n<p>(e) edit or otherwise modify any material on the website;<\/p>\n<p>(f) redistribute material from this website except for content specifically and expressly made available for redistribution (such as our newsletter).<\/p>\n<p><strong>Acceptable use<\/strong><\/p>\n<p>You must not use our website in any way that causes, or may cause, damage to the website or impairment of the availability or accessibility of the website; or in any way which is unlawful, illegal, fraudulent or harmful, or in connection with any unlawful, illegal, fraudulent or harmful purpose or activity. You must not use our website to copy, store, host, transmit, send, use, publish or distribute any material which consists of (or is linked to) any spyware, computer virus, Trojan horse, worm, keystroke logger, rootkit or other malicious computer software.<\/p>\n<p>You must not conduct any systematic or automated data collection activities (including without limitation scraping, data mining, data extraction, and data harvesting) on or in relation to our website without our express written consent.<\/p>\n<p>You must not use our website to transmit or send unsolicited commercial communications.<\/p>\n<p>You must not use our website for any purposes related to marketing without our express written consent.<\/p>\n<p><strong>Content access<\/strong><\/p>\n<p><strong><\/strong>With a membership, you have access to all restricted contents with the exception of our special TINT academy products that can be purchased individually. You have access to the contents as long as you are a member. If you cancel the subscription your access will be revoked at the end of your respective billing period.<\/p>\n<p>With a single purchase you have access to the individual program forever via the platform or as long as the platform is live. If the platform has to be terminated we will find a way to share your individual purchases with you (e.g. download or another solution).<\/p>\n<p><strong>Restricted access<\/strong><\/p>\n<p>Access to certain areas of our website is restricted. We reserve the right to restrict access to areas of our website, or indeed our whole website, at our discretion.<\/p>\n<p>If we provide you with a user ID and password to enable you to access restricted areas of our website or other content or services, you must ensure that that user ID and password is kept confidential.<\/p>\n<p>We may disable your user ID and password in our sole discretion without notice or explanation.<\/p>\n<p>User-generated content In these terms and conditions, “your user content” means material (including comments) that you submit to our website, for whatever purpose.<\/p>\n<p>You grant to us a worldwide, irrevocable, non-exclusive, royalty-free license to use, publish, translate and distribute your comments in any existing or future media as testimonials.<\/p>\n<p>Your user content must not be illegal or unlawful, must not infringe any third party’s legal rights, and must not be capable of giving rise to legal action whether against you or us or a third party (in each case under any applicable law).<\/p>\n<p>You must not submit any user content to the website that is or has ever been the subject of any threatened or actual legal proceedings or other similar complaints.<\/p>\n<p>We reserve the right to edit or remove any material submitted to our website, or stored on our servers, or hosted or published upon our website.<\/p>\n<p>Notwithstanding our rights under these terms and conditions in relation to user content, we do not undertake to monitor the submission of such content to, or the publication of such content on, our website. limited warranties Whilst we endeavor to ensure that the information on this website (excluding user content) is correct, we do not warrant its completeness or accuracy; nor do we commit to ensuring that the website remains available or that the material on the website is kept up-to-date.<\/p>\n<p>To the maximum extent permitted by applicable law we exclude all representations, warranties, and conditions relating to this website and the use of this website (including, without limitation, any warranties implied by law of satisfactory quality, fitness for purpose and\/or the use of reasonable care and skill). Limitations of liability Nothing in these terms and conditions (or elsewhere on our website) will exclude or limit our liability for fraud, for death or personal injury caused by our negligence, or for any other liability which cannot be excluded or limited under applicable law.<\/p>\n<p>Subject to this, our liability to you in relation to the use of our website or under or in connection with these terms and conditions, whether in contract, tort (including negligence) or otherwise, will be limited as follows:<\/p>\n<p>(a) to the extent that the website and the information and services on the website are provided free-of-charge, we will not be liable for any loss or damage of any nature;<\/p>\n<p>(b) we will not be liable for any consequential, indirect or special loss or damage;<\/p>\n<p>(c) we will not be liable for any loss of profit, income, revenue, anticipated savings, contracts, business, goodwill, reputation, data, or information;<\/p>\n<p>(d) we will not be liable for any loss or damage arising out of any event or events beyond our reasonable control;<\/p>\n<p>(e) our maximum liability in relation to any event or series of related events will be limited to £1.00 GBP.<\/p>\n<p><strong>Price and payment<\/strong><\/p>\n<p>(a) Prices and any additional related charges (where applicable) are as published on our website for the relevant Goods and\/or Services on the date of your order.<\/p>\n<p>(b) Where Value Added Tax (VAT) is chargeable, this will be added and displayed separately at the checkout, and on the order summary and receipt at the current prevailing rate. This rate may vary from time to time.<\/p>\n<p>(c) Payment for Goods and\/or Services is accepted through major credit and\/or debit cards excluding American Express, Diners, JCB and other corporate business cards. Your card will be charged directly after your order has been placed but the time taken to process the payment through your account will be dependant on your card supplier.<\/p>\n<p>(d) TINT GmbH accepts no liability if a payment is refused or declined by the credit or debit card supplier for any reason.<\/p>\n<p>(e) TINT GmbH accepts no liability for any loss or damage, arising directly or indirectly, as a result of a payment being refused or declined.<\/p>\n<p>(f) You will be charged in the currency you have set up within your profile, currently available for USD.<\/p>\n<p>(g) Confirmation of your payment will be displayed on screen once it has been authorized and accepted. You will also receive confirmation of the transaction to the email address you have provided.<\/p>\n<p>(h) We reserve the right to refuse to process payments.<\/p>\n<p>(i) We may at our sole discretion do such checks as we may deem fit before processing a credit or debit card payment from the user, for security reasons. As part of such checks, we may disclose personal data to third parties for the purpose of carrying out these security checks. In the event that we are not satisfied with the credibility of the User, we will have the right to reject the payment.<\/p>\n<p>(j) We will not be liable for any damages resulting from our decision not to process a payment made through our Online Payments facility.<\/p>\n<p>(k) We offer a 30-day money-back guarantee on our memberships and Academy trainings. The request to claim your money back must be made within 30 days from the date of purchase and in writing to <a href=\"mailto:namaste@tintyoga.com\">namaste@tintyoga.com<\/a>. The membership will be extended automatically by the end of the relevant billing period. <span>Each membership can be canceled until the last date of the relevant payment cycle.<\/span><\/p>\n<p>(l) In any other cases, we do not provide refunds.<\/p>\n<p><strong>Indemnity<\/strong><\/p>\n<p>You hereby indemnify us and undertake to keep us indemnified against any losses, damages, costs, liabilities and expenses (including without limitation legal expenses and any amounts paid by us to a third party in settlement of a claim or dispute on the advice of our legal advisers) incurred or suffered by us arising out of any breach by you of any provision of these terms and conditions, or arising out of any claim that you have breached any provision of these terms and conditions.<\/p>\n<p><strong>Breaches of these terms and conditions<\/strong><\/p>\n<p>Without prejudice to our other rights under these terms and conditions, if you breach these terms and conditions in any way, we may take such action as we deem appropriate to deal with the breach, including suspending your access to the website, prohibiting you from accessing the website, blocking computers using your IP address from accessing the website, contacting your internet service provider to request that they block your access to the website and\/or bringing court proceedings against you.<\/p>\n<p><strong>Variation<\/strong><\/p>\n<p>We may revise these terms and conditions from time-to-time. Revised terms and conditions will apply to the use of our website from the date of the publication of the revised terms and conditions on our website. Please check this page regularly to ensure you are familiar with the current version.<\/p>\n<p><strong>Assignment<\/strong><\/p>\n<p>We may transfer, sub-contract or otherwise deal with our rights and\/or obligations under these terms and conditions without notifying you or obtaining your consent.<\/p>\n<p>You may not transfer, sub-contract or otherwise deal with your rights and\/or obligations under these terms and conditions.<\/p>\n<p><strong>Severability<\/strong><\/p>\n<p>If a provision of these terms and conditions is determined by any court or other competent authority to be unlawful and\/or unenforceable, the other provisions will continue in effect. If any unlawful and\/or unenforceable provision would be lawful or enforceable if part of it were deleted, that part will be deemed to be deleted, and the rest of the provision will continue in effect.<\/p>\n<p><strong>Exclusion of third party rights<\/strong><\/p>\n<p>These terms and conditions are for the benefit of you and us and are not intended to benefit any third party or be enforceable by any third party. The exercise of our and your rights in relation to these terms and conditions is not subject to the consent of any third party.<\/p>\n<p><strong>Entire agreement<\/strong><\/p>\n<p>These terms and conditions, together with our privacy policy, constitute the entire agreement between you and us in relation to your use of our website and supersede all previous agreements in respect of your use of this website.<\/p>\n<p><strong>Law and jurisdiction<\/strong><\/p>\n<p>These terms and conditions will be governed by and construed in accordance with German law, and any disputes relating to these terms and conditions will be subject to the [non-]exclusive jurisdiction of the courts of Germany.<\/p>\n<p><strong>Our details<\/strong><\/p>\n<p>The full name of our company is TINT GmbH<\/p>\n<p>EU VAT No.: DE306473707<br \/>HRB 105303<br \/>Mainzer Landstraße 178-190<br \/>60327 Frankfurt<\/p>\n<p>[\/et_pb_text][\/et_pb_column][\/et_pb_row][\/et_pb_section]<\/p>\n","protected":false},"excerpt":{"rendered":"<p>Legal Notice &amp; Terms of UseLegal Notice Information provided according to Sec. 5 German Telemedia Act (TMG): TINT GmbHMainzer Landstraße 178-19060327 Frankfurt Represented by:Young Ho KimRüdiger Rohner Contact:Telephone: +49 69 677785 12Email: namaste@tintyoga.com Register entry:Entry in the Handelsregister on 23 February 2016.Registering court: Amtsgericht FrankfurtRegistration number: HRB 105303 VAT:VAT ID number according to Sec. 27 a German [&hellip;]<\/p>\n","protected":false},"author":1,"featured_media":0,"parent":0,"menu_order":0,"comment_status":"closed","ping_status":"closed","template":"","meta":{"_et_pb_use_builder":"on","_et_pb_old_content":"","_et_gb_content_width":""},"wf_page_folders":[18],"yoast_head":"<!-- This site is optimized with the Yoast SEO plugin v19.10 - https:\/\/yoast.com\/wordpress\/plugins\/seo\/ -->\n<title>TINT Yoga terms, conditions &amp; policies - TINT Yoga<\/title>\n<meta name=\"description\" content=\"Enjoy online yoga workshops with the world&#039;s most popular yoga teachers. Find your mentor and start working out with our online videos.\" \/>\n<meta name=\"robots\" content=\"index, follow, max-snippet:-1, max-image-preview:large, max-video-preview:-1\" \/>\n<link rel=\"canonical\" href=\"https:\/\/tintyoga.com\/terms-of-use\/\" \/>\n<meta property=\"og:locale\" content=\"en_US\" \/>\n<meta property=\"og:type\" content=\"article\" \/>\n<meta property=\"og:title\" content=\"TINT Yoga terms, conditions &amp; policies\" \/>\n<meta property=\"og:description\" content=\"Enjoy online yoga workshops with the world&#039;s most popular yoga teachers. Find your mentor and start working out with our online videos.\" \/>\n<meta property=\"og:url\" content=\"https:\/\/tintyoga.com\/terms-of-use\/\" \/>\n<meta property=\"og:site_name\" content=\"TINT Yoga\" \/>\n<meta property=\"article:publisher\" content=\"https:\/\/www.facebook.com\/tintyoga\/\" \/>\n<meta property=\"article:modified_time\" content=\"2022-09-16T09:45:51+00:00\" \/>\n<meta property=\"og:image\" content=\"https:\/\/tintyoga.com\/wp-content\/uploads\/2019\/06\/TINT_Goemboec.png\" \/>\n\t<meta property=\"og:image:width\" content=\"750\" \/>\n\t<meta property=\"og:image:height\" content=\"750\" \/>\n\t<meta property=\"og:image:type\" content=\"image\/png\" \/>\n<meta name=\"twitter:card\" content=\"summary_large_image\" \/>\n<meta name=\"twitter:label1\" content=\"Est. reading time\" \/>\n\t<meta name=\"twitter:data1\" content=\"12 minutes\" \/>\n<script type=\"application\/ld+json\" class=\"yoast-schema-graph\">{\"@context\":\"https:\/\/schema.org\",\"@graph\":[{\"@type\":\"WebPage\",\"@id\":\"https:\/\/tintyoga.com\/terms-of-use\/\",\"url\":\"https:\/\/tintyoga.com\/terms-of-use\/\",\"name\":\"TINT Yoga terms, conditions & policies - TINT Yoga\",\"isPartOf\":{\"@id\":\"https:\/\/tintyoga.com\/#website\"},\"datePublished\":\"2020-05-25T10:42:23+00:00\",\"dateModified\":\"2022-09-16T09:45:51+00:00\",\"description\":\"Enjoy online yoga workshops with the world's most popular yoga teachers. Find your mentor and start working out with our online videos.\",\"breadcrumb\":{\"@id\":\"https:\/\/tintyoga.com\/terms-of-use\/#breadcrumb\"},\"inLanguage\":\"en-US\",\"potentialAction\":[{\"@type\":\"ReadAction\",\"target\":[\"https:\/\/tintyoga.com\/terms-of-use\/\"]}]},{\"@type\":\"BreadcrumbList\",\"@id\":\"https:\/\/tintyoga.com\/terms-of-use\/#breadcrumb\",\"itemListElement\":[{\"@type\":\"ListItem\",\"position\":1,\"name\":\"Home\",\"item\":\"https:\/\/tintyoga.com\/\"},{\"@type\":\"ListItem\",\"position\":2,\"name\":\"Terms of Use\"}]},{\"@type\":\"WebSite\",\"@id\":\"https:\/\/tintyoga.com\/#website\",\"url\":\"https:\/\/tintyoga.com\/\",\"name\":\"TINT Yoga\",\"description\":\"TINT Yoga offers premium online yoga classes with the world&#039;s most popular yoga and movement instructors. Learn and work out with our online yoga videos.\",\"publisher\":{\"@id\":\"https:\/\/tintyoga.com\/#organization\"},\"potentialAction\":[{\"@type\":\"SearchAction\",\"target\":{\"@type\":\"EntryPoint\",\"urlTemplate\":\"https:\/\/tintyoga.com\/?s={search_term_string}\"},\"query-input\":\"required name=search_term_string\"}],\"inLanguage\":\"en-US\"},{\"@type\":\"Organization\",\"@id\":\"https:\/\/tintyoga.com\/#organization\",\"name\":\"TINT Yoga\",\"url\":\"https:\/\/tintyoga.com\/\",\"logo\":{\"@type\":\"ImageObject\",\"inLanguage\":\"en-US\",\"@id\":\"https:\/\/tintyoga.com\/#\/schema\/logo\/image\/\",\"url\":\"https:\/\/tintyoga.com\/wp-content\/uploads\/2021\/08\/logo_color_black.png\",\"contentUrl\":\"https:\/\/tintyoga.com\/wp-content\/uploads\/2021\/08\/logo_color_black.png\",\"width\":1001,\"height\":301,\"caption\":\"TINT Yoga\"},\"image\":{\"@id\":\"https:\/\/tintyoga.com\/#\/schema\/logo\/image\/\"},\"sameAs\":[\"https:\/\/www.instagram.com\/tint_yoga\/\",\"https:\/\/de.linkedin.com\/company\/tint-gmbh\",\"https:\/\/www.pinterest.de\/tintyoga\/\",\"https:\/\/www.youtube.com\/channel\/UC2HjTe0TL20qSk8e3s1d0DA\",\"https:\/\/www.facebook.com\/tintyoga\/\"]}]}<\/script>\n<!-- \/ Yoast SEO plugin. -->","yoast_head_json":{"title":"TINT Yoga terms, conditions & policies - TINT Yoga","description":"Enjoy online yoga workshops with the world's most popular yoga teachers. Find your mentor and start working out with our online videos.","robots":{"index":"index","follow":"follow","max-snippet":"max-snippet:-1","max-image-preview":"max-image-preview:large","max-video-preview":"max-video-preview:-1"},"canonical":"https:\/\/tintyoga.com\/terms-of-use\/","og_locale":"en_US","og_type":"article","og_title":"TINT Yoga terms, conditions & policies","og_description":"Enjoy online yoga workshops with the world's most popular yoga teachers. Find your mentor and start working out with our online videos.","og_url":"https:\/\/tintyoga.com\/terms-of-use\/","og_site_name":"TINT Yoga","article_publisher":"https:\/\/www.facebook.com\/tintyoga\/","article_modified_time":"2022-09-16T09:45:51+00:00","og_image":[{"width":750,"height":750,"url":"https:\/\/tintyoga.com\/wp-content\/uploads\/2019\/06\/TINT_Goemboec.png","type":"image\/png"}],"twitter_card":"summary_large_image","twitter_misc":{"Est. reading time":"12 minutes"},"schema":{"@context":"https:\/\/schema.org","@graph":[{"@type":"WebPage","@id":"https:\/\/tintyoga.com\/terms-of-use\/","url":"https:\/\/tintyoga.com\/terms-of-use\/","name":"TINT Yoga terms, conditions & policies - TINT Yoga","isPartOf":{"@id":"https:\/\/tintyoga.com\/#website"},"datePublished":"2020-05-25T10:42:23+00:00","dateModified":"2022-09-16T09:45:51+00:00","description":"Enjoy online yoga workshops with the world's most popular yoga teachers. Find your mentor and start working out with our online videos.","breadcrumb":{"@id":"https:\/\/tintyoga.com\/terms-of-use\/#breadcrumb"},"inLanguage":"en-US","potentialAction":[{"@type":"ReadAction","target":["https:\/\/tintyoga.com\/terms-of-use\/"]}]},{"@type":"BreadcrumbList","@id":"https:\/\/tintyoga.com\/terms-of-use\/#breadcrumb","itemListElement":[{"@type":"ListItem","position":1,"name":"Home","item":"https:\/\/tintyoga.com\/"},{"@type":"ListItem","position":2,"name":"Terms of Use"}]},{"@type":"WebSite","@id":"https:\/\/tintyoga.com\/#website","url":"https:\/\/tintyoga.com\/","name":"TINT Yoga","description":"TINT Yoga offers premium online yoga classes with the world&#039;s most popular yoga and movement instructors. Learn and work out with our online yoga videos.","publisher":{"@id":"https:\/\/tintyoga.com\/#organization"},"potentialAction":[{"@type":"SearchAction","target":{"@type":"EntryPoint","urlTemplate":"https:\/\/tintyoga.com\/?s={search_term_string}"},"query-input":"required name=search_term_string"}],"inLanguage":"en-US"},{"@type":"Organization","@id":"https:\/\/tintyoga.com\/#organization","name":"TINT Yoga","url":"https:\/\/tintyoga.com\/","logo":{"@type":"ImageObject","inLanguage":"en-US","@id":"https:\/\/tintyoga.com\/#\/schema\/logo\/image\/","url":"https:\/\/tintyoga.com\/wp-content\/uploads\/2021\/08\/logo_color_black.png","contentUrl":"https:\/\/tintyoga.com\/wp-content\/uploads\/2021\/08\/logo_color_black.png","width":1001,"height":301,"caption":"TINT Yoga"},"image":{"@id":"https:\/\/tintyoga.com\/#\/schema\/logo\/image\/"},"sameAs":["https:\/\/www.instagram.com\/tint_yoga\/","https:\/\/de.linkedin.com\/company\/tint-gmbh","https:\/\/www.pinterest.de\/tintyoga\/","https:\/\/www.youtube.com\/channel\/UC2HjTe0TL20qSk8e3s1d0DA","https:\/\/www.facebook.com\/tintyoga\/"]}]}},"acf":[],"_links":{"self":[{"href":"https:\/\/tintyoga.com\/wp-json\/wp\/v2\/pages\/138725"}],"collection":[{"href":"https:\/\/tintyoga.com\/wp-json\/wp\/v2\/pages"}],"about":[{"href":"https:\/\/tintyoga.com\/wp-json\/wp\/v2\/types\/page"}],"author":[{"embeddable":true,"href":"https:\/\/tintyoga.com\/wp-json\/wp\/v2\/users\/1"}],"replies":[{"embeddable":true,"href":"https:\/\/tintyoga.com\/wp-json\/wp\/v2\/comments?post=138725"}],"version-history":[{"count":13,"href":"https:\/\/tintyoga.com\/wp-json\/wp\/v2\/pages\/138725\/revisions"}],"predecessor-version":[{"id":163184,"href":"https:\/\/tintyoga.com\/wp-json\/wp\/v2\/pages\/138725\/revisions\/163184"}],"wp:attachment":[{"href":"https:\/\/tintyoga.com\/wp-json\/wp\/v2\/media?parent=138725"}],"wp:term":[{"taxonomy":"wf_page_folders","embeddable":true,"href":"https:\/\/tintyoga.com\/wp-json\/wp\/v2\/wf_page_folders?post=138725"}],"curies":[{"name":"wp","href":"https:\/\/api.w.org\/{rel}","templated":true}]}}