{"id":152206,"date":"2021-07-15T13:14:26","date_gmt":"2021-07-15T12:14:26","guid":{"rendered":"https:\/\/tintyoga.com\/?p=152206"},"modified":"2022-09-22T13:31:44","modified_gmt":"2022-09-22T12:31:44","slug":"yoga-inversions","status":"publish","type":"post","link":"https:\/\/tintyoga.com\/magazine\/yoga-inversions\/","title":{"rendered":"Yoga Inversions – Explore the World Upside Down"},"content":{"rendered":"\n<p class=\"intro-text\">As most of us nowadays are spending a big share of our day in the head – busy planning, working, thinking – the practice of yoga offers us an opportunity to cultivate a deeper connection with our body and give the head a break. A specific family of asanas (yoga postures) to refresh the head and the body are <strong>inversion poses<\/strong>.<\/p>\n\n\n\n<div class=\"toc-wrapper\">\n<p>Let&#8217;s have a closer look at yoga inversions:<\/p>\n\n<ul class=\"fa-ul toc-list\">\n  <li>\n  <span class=\"fa-li\"><i class=\"fa fa-long-arrow-right\"><\/i><\/span>\n  <a href=\"#1\">1. What Are Inversions in Yoga?<\/a><\/li>\n  <li>\n  <span class=\"fa-li\"><i class=\"fa fa-long-arrow-right\"><\/i><\/span>\n  <a href=\"#2\">2. How to Overcome the Initial Fear of Being Upside Down?<\/a><\/li>\n  <li>\n  <span class=\"fa-li\"><i class=\"fa fa-long-arrow-right\"><\/i><\/span>\n  <a href=\"#3\">3. Gentle Yoga Inversions for Beginners<\/a><\/li>\n  <li>\n  <span class=\"fa-li\"><i class=\"fa fa-long-arrow-right\"><\/i><\/span>\n  <a href=\"#4\">4. Preparation Poses for Advanced Yoga Inversions<\/a><\/li>\n  <li>\n  <span class=\"fa-li\"><i class=\"fa fa-long-arrow-right\"><\/i><\/span>\n  <a href=\"#5\">5. Level up – Advanced Yoga Inversions<\/a><\/li>\n  <li>\n  <span class=\"fa-li\"><i class=\"fa fa-long-arrow-right\"><\/i><\/span>\n  <a href=\"#6\">6. Do&#8217;s and Don&#8217;ts to Establish a Healthy Yoga Inversions Practice<\/a><\/li>\n  <li>\n  <span class=\"fa-li\"><i class=\"fa fa-long-arrow-right\"><\/i><\/span>\n  <a href=\"#7\">7. Benefits of Yoga Inversions<\/a><\/li>\n<\/ul>\n<\/div>\n\n\n\n<!-- IMAGE 16:9 -->\n<div class=\"image-wrapper\">\n<div class=\"individual\" position=\"bottom\">\n  <div>\n   <img decoding=\"async\" src=\"https:\/\/tintyoga.com\/wp-content\/uploads\/2021\/07\/Mathieu-Maeva_Handstand.jpeg\">\n<\/div>\n<\/div>\n\n<!-- CAPTION -->\n<p class=\"caption\">Let&#8217;s explore yoga inversions in more detail. <i>Photo: TINT Instructor Mathieu Boldron with his sister Maeva.<\/i><\/p>\n\n<\/div>\n\n\n\n<h2 id=\"1\">1. What Are Inversions in Yoga?<\/h2>\n\n\n\n<p>By inverting the body and turning upside down, we can change our perspective of the world – in a quite literal way through the physical perspective and on a deeper level through shifting the mental model we have constructed of the world.<\/p>\n\n\n\n<p>Yoga inversions can serve us to create different qualities and effects on the body. They can be short, dynamic, and thus invigorating, or rather steady and restorative.<\/p>\n\n\n\n<p>In more traditional yoga styles, you will find inversion poses towards the end of the class, closing the sequence and basically adding a finishing touch to the story. However, depending on the intention of the class, they can also form the centerpiece as a more challenging <a href=\"https:\/\/tintyoga.com\/magazine\/yoga-class-sequence-free-sample-sequences\/#42\">peak pose<\/a> to be conquered.<\/p>\n\n\n\n<p>In yoga inversions in general, you can observe that the main base of support is changing from the feet to various parts of the upper body (i.e. hands, fingers, forearms, head or even the chin). Now this is an indicator for arm balances as well. The major distinction between <a href=\"https:\/\/tintyoga.com\/magazine\/yoga-arm-balances-dont-let-them-discourage-you\/\">arm balances<\/a> and inversions is the positioning of the hips and the heart above the head.<\/p>\n\n\n\n<h2 id=\"2\">2. How to Overcome the Initial Fear of Being Upside Down?<\/h2>\n\n\n\n<p>With a steady inversion practice, being upside down can become somewhat addictive. But many new yoga inversions practitioners experience a certain degree of fear or intimidation when being asked to turn upside down. <\/p>\n\n\n\n<p>The key to overcoming this fear is to start small and then gradually build up your confidence and capacity step by step. As <a href=\"https:\/\/en.wikipedia.org\/wiki\/B._K._S._Iyengar\" target=\"_blank\" rel=\"noreferrer noopener\">B.K.S. Iyengar<\/a> said: “Know your capacities and continually improve upon them.”<\/p>\n\n\n\n<p>It is generally recommended to practice yoga inversion poses under the supervision of a teacher. You can even find a safe space to practice with an experienced teacher in an <a href=\"https:\/\/tintyoga.com\/\">online environment<\/a> – this will definitely be helpful to avoid injuries. Yet if you are already practicing yoga, chances are high that you are technically practicing gentle inverted yoga poses already.<\/p>\n\n\n\n<!-- IMAGE 16:9 -->\n<div class=\"image-wrapper\">\n<div class=\"individual\" position=\"bottom\">\n  <div>\n   <a href=\"https:\/\/watch.tintyoga.com\/programs\/happy-to-headstand\" <img=\"\" src=\"https:\/\/tintyoga.com\/wp-content\/uploads\/2021\/07\/Barbra-Noh_Happy-to-Headstand.jpeg\"><\/a>\n  <\/div>\n<\/div>\n\n<!-- CAPTION -->\n<p class=\"caption\">Follow our teacher <a href=\"https:\/\/tintyoga.com\/instructors\/barbra-noh\/\">Barbra Noh<\/a> in <a href=\"https:\/\/watch.tintyoga.com\/programs\/happy-to-headstand\">this video<\/a> to begin practicing Headstand in a way that will keep your neck happy.<\/p>\n\n<\/div>\n\n\n\n<h2 id=\"3\">3. Gentle Yoga Inversions for Beginners<\/h2>\n\n\n\n<p>Yoga inversions are accessible also to beginners and the soothing benefits of inversions can be experienced in easy postures such as deep Standing Forward Folds (<em>Uttanasana<\/em>), <a href=\"https:\/\/tintyoga.com\/magazine\/downward-facing-dog-alignment-are-you-doing-it-wrong\/\">Downward-Facing Dog<\/a> (<em>Adho Mukha Svanasana<\/em>), Legs up the Wall (<em>Viparita Karani<\/em>) or Melting Heart Pose (<em>Anahatasana<\/em>).<\/p>\n\n\n\n<p>In these upside-down yoga poses, the head can release its usual effort of staying upright against the force of gravity and passively lengthen the muscles along the neck, as well as the whole spine, while the heart area can embrace a sense of broadening and softening.<\/p>\n\n\n\n<p>A hint more intensive but still totally doable for beginners are inversion poses like Plow Pose (<em>Halasana<\/em>) or its variation <a href=\"https:\/\/tintyoga.com\/magazine\/how-effective-is-yoga-for-stress-relief\/\">Snail Pose<\/a>. The support of a little height below the feet can give some relief to tight hamstrings.<\/p>\n\n\n\n<p>Supported Shoulderstand (<em>Salamba Sarvangasana<\/em>) with a blanket under the shoulders and the feet pressing into a wall is a good way to become more familiar with the action of the breastbone moving closer to the throat, which is a typical action in most inverted poses in yoga. This can cause a flare of panic in the beginning, but with constant practice, the panic will disappear and make space for a deep release of the throat and the soft palate in the mouth experienced in this yoga inversion.<\/p>\n\n\n\n<p><a href=\"https:\/\/www.richardfreemanyoga.com\/\" target=\"_blank\" rel=\"noreferrer noopener\">Richard Freeman<\/a>, who is one of the most senior Ashtanga teachers in the Western world and focuses on the role of the palate during inversion poses, describes this feeling as “a drop of nectar which is released from the root of the palate”, which brings compassion and kindness into your life.<\/p>\n\n\n<span style=\"--tl-form-height-m:1213.05px;--tl-form-height-t:638.781px;--tl-form-height-d:638.781px;\" class=\"tl-placeholder-f-type-shortcode_158494 tl-preload-form\"><span><\/span><\/span>\n\n\n<h2 id=\"4\">4. Preparation Poses for Advanced Yoga Inversions<\/h2>\n\n\n\n<p>All preparation poses are brilliant to explore your body in a different setting towards gravity, to practice lifting the hips above the shoulders and the head, and to step by step build up towards the full inversion pose.<\/p>\n\n\n\n<p>Be sure to be comfortable, stable, and capable to hold each step in the preparation pose for at least ten breaths before approaching the next step. This will also help you to overcome fear and build confidence.<\/p>\n\n\n\n<p>For instance, you can work on setting your foundation by elevating the shoulders and activating the forearms and elbows in Dolphin Pose and thus prep for inverted yoga poses like Supported Headstand (<em>Sirsansana<\/em>) or Forearm Stand (<em>Pincha Mayurasana<\/em>).<\/p>\n\n\n\n<p>Practicing an <a href=\"https:\/\/watch.tintyoga.com\/programs\/build-towards-handstand\">L-shaped Handstand<\/a> with the feet against the wall will help you get a feeling for the position and tilt of your hips (be sure to avoid falling into a banana back, which is a common beginners mistake in Handstand) and the activation of your hands as solemn support for your bodyweight in upside-down poses. <\/p>\n\n\n\n<p>Stay here or explore lifting one leg of the wall and pointing upwards. As said before, be safe and sound in each step to be confident when taking the next level.<\/p>\n\n\n\n<!-- IMAGE 16:9 -->\n<div class=\"image-wrapper\">\n<div class=\"individual\" position=\"bottom\">\n  <div>\n   <a href=\"https:\/\/watch.tintyoga.com\/programs\/setting-up-your-foundation\" <img=\"\" src=\"https:\/\/tintyoga.com\/wp-content\/uploads\/2022\/01\/Setting-up-your-foundation.jpg\"><\/a>\n  <\/div>\n<\/div>\n\n<!-- CAPTION -->\n<p class=\"caption\">Find the right alignment and a strong foundation for inversion poses by following <a href=\"https:\/\/tintyoga.com\/instructors\/jason-nemer\/\">Jason Nemer<\/a> in <a href=\"https:\/\/watch.tintyoga.com\/programs\/setting-up-your-foundation\">this introductory video<\/a>.<\/p>\n\n<\/div>\n\n\n\n<h2 id=\"5\">5. Level up – Advanced Yoga Inversions<\/h2>\n\n\n\n<p>While Instagram suggests that Handstand is the key inversion pose to be achieved in yoga, ancient yoga scriptures regard Headstand and Shoulderstand as <a href=\"https:\/\/watch.tintyoga.com\/programs\/hummingbirds-and-nectar\">king and queen of asanas<\/a> as they have multiple positive effects on body and mind.<\/p>\n\n\n\n<p>The range of advanced inversion poses ranges from the above mentioned over Forearm Stand, Peacock Pose (<em>Mayurasana<\/em>), Chin Stand (<em>Ganda Bherundasana<\/em>) and of course, Handstand (<em>Adho Mukha Vrksasana<\/em>).<\/p>\n\n\n\n<p>From these essential inverted poses you can go crazy as there are no limits to creativity when combining a variety of different leg shapes, adding in <a href=\"https:\/\/tintyoga.com\/magazine\/how-to-do-backbends-in-yoga-if-youre-not-flexible-yet\/\">backbends<\/a>, switching in beautiful <a href=\"https:\/\/tintyoga.com\/magazine\/one-cue-that-will-make-your-yoga-transitions-easier\/\">transitions<\/a> between yoga inversions and arm balances and testing different <a href=\"https:\/\/watch.tintyoga.com\/programs\/press-handstands\">ways of entering<\/a> and exiting the poses.<\/p>\n\n\n\n<p>A classic Forearm Stand can be transformed into a fancy <a href=\"https:\/\/watch.tintyoga.com\/programs\/master-your-backbends\">Scorpion Pose<\/a> (<em>Vrischikasana<\/em>). You can pretzel yourself into Shoulderstand with the legs in <a href=\"https:\/\/tintyoga.com\/magazine\/lotus-pose-padmasana\/\">Lotus<\/a> (<em>Padmasana<\/em>) or devote your practice to the Monkey-God Hanuman when sporting full-split legs in Handstand.<\/p>\n\n\n\n<p>Another exciting technique to advance your yoga inversions practice is to gradually minimize the base of your support, such as taking one hand away into <a href=\"https:\/\/watch.tintyoga.com\/programs\/one-arm-handstand\">One Arm Handstands<\/a> or coming onto just the index finger in Headstand. You can spot highly skilled practitioners holding a true Headstand with the arms pointing up towards the sky and only balancing on the Crown of the Head.<\/p>\n\n\n\n<div class=\"video-wrapper\">\n<div class=\"video-wrapper-inner\">\n\n<!-- YOUTUBE VIDEO GOES HERE -->\n<iframe width=\"560\" height=\"315\" src=\"https:\/\/www.youtube.com\/embed\/ZdYs1n3mHfE\" frameborder=\"0\" allow=\"accelerometer; autoplay; encrypted-media; gyroscope; picture-in-picture\" allowfullscreen=\"\"><\/iframe>\n\n<!-- CAPTION -->\n<p class=\"caption\">Start your way towards an advanced yoga inversion with <a href=\"https:\/\/tintyoga.com\/instructors\/cameron-shayne\/\">Cameron Shayne<\/a>&#8216;s Handstand class for beginners.<\/p>\n\n<\/div>\n<\/div>\n\n\n\n<h2 id=\"6\">6. Do&#8217;s and Don&#8217;ts to Establish a Healthy Yoga Inversions Practice<\/h2>\n\n\n\n<p>As you may have already guessed, inverted yoga poses are not the plain-vanilla kind of asanas. There are some aspects to pay particular attention to, as well as certain things to avoid. Let&#8217;s look at the dos and don&#8217;ts of yoga inversions.<\/p>\n\n\n\n<h3>Do<\/h3>\n\n\n\n<ul><li>Be sure to give all main parts a good warm-up through strengthening and opening the parts you will use in the inverted pose (i.e. wrists, shoulders, neck, core, hip flexors, hamstrings, etc.).<\/li><li>Always keep your cervical spine and neck muscles safe by lifting your body up and away from floor.<\/li><li>Use props to support you where needed, to help keep the neck safe or to add a more restorative quality to the inverted asana.<\/li><li>Gradually work on increasing the time in which you are capable to hold each inversion posture. Always listen to your body.<\/li><\/ul>\n\n\n\n<h3>Don&#8217;t<\/h3>\n\n\n\n<ul><li>Don´t practice yoga inversion poses if you are not sure what to do. If so, seek guidance from an experienced teacher.<\/li><li>Substitute yoga inversions if you are having problems with high blood pressure, glaucoma or suffer from head or neck injuries. Perhaps switch to a more gentle and restorative variation of the inverted pose.<\/li><li>Be sensible if you are pregnant. Many women also prefer to refrain from upside-down poses during their menstruation as inversions seem to work against the natural direction of your flow. In that case, listen to what your body tells you and how comfortable you are in your practice.<\/li><\/ul>\n\n\n<span style=\"--tl-form-height-m:1213.05px;--tl-form-height-t:638.781px;--tl-form-height-d:638.781px;\" class=\"tl-placeholder-f-type-shortcode_158494 tl-preload-form\"><span><\/span><\/span>\n\n\n<h2 id=\"7\">7. Benefits of Yoga Inversions<\/h2>\n\n\n\n<h3>7.1. Psychological Benefits of Inversions<\/h3>\n\n\n\n<p>When learning inversion poses in yoga, we are practicing trust and patience with the body, as the act of balancing can hold a great amount of challenge. Whilst the eyes are looking down, the muscular system, specifically the inner core, is forced to really activate.<\/p>\n\n\n\n<p>Remember how often you are checking your asana form with your eyes? There is no chance to use this external sense in inverted poses, so you really have to trust your inner senses to find true balance and to inform your body to do the correct movements.<\/p>\n\n\n\n<p>Falling out of inversions teaches us (and our ego) humbleness, getting back up will build up endurance and determination. Working towards balance with the ever-changing conditions of our bodies can help us to let go of the idea of perfection, as every inversion we will ever do will hold its own unique shape.<\/p>\n\n\n\n<div class=\"quote-wrapper\">\n<p class=\"quote\">&#8220;Do not stop trying just because perfection eludes you.&#8221;<\/p>\n<p class=\"quote-author\">– B.K.S. Iyengar.<\/p>\n<\/div>\n\n\n\n<p>Apart from these teachings directed more towards emotional growth, mental benefits of yoga inversions can include a boost in confidence from mastering new challenges or even a good laugh when falling out in an awkward way.<\/p>\n\n\n\n<h3>7.2. Physical Benefits of Inversions<\/h3>\n\n\n\n<p><a href=\"https:\/\/www.healthline.com\/nutrition\/yoga-inversion#benefits\" target=\"_blank\" rel=\"noreferrer noopener\">Several studies<\/a> verify the multitude of physical benefits of inversion postures for all major body systems. Better than coffee, inversions can fix you with an instant shot of concentration and raise your energy level when the dreaded afternoon low kicks in.<\/p>\n\n\n\n<h4>Benefits on the Circulatory Systems<\/h4>\n\n\n\n<p>Inverted poses help to lower blood pressure and make it possible for the heart rate to rest, as gravity supports the transporting of blood and oxygen to the brain. They not only increase circulation in the cardiovascular system, but also in the lymphatic system which is responsible for the removal of toxins from our system.<\/p>\n\n\n\n<h4>Benefits on the Muscular System<\/h4>\n\n\n\n<p>Improved balance, a release of tension while simultaneously creating a full body strengthening of muscles, especially the delicate tonic muscles of the inner core, provide a major benefit for your yoga practice and for the way you align your body towards gravity in everyday life.<\/p>\n\n\n\n<h4>Benefits on the Respiratory and the Nervous System<\/h4>\n\n\n\n<p>In inversions, the diaphragm – which is the main structure coordinating breath – is automatically activated, as it has to work against gravity to make space for air to flow in. This type of breathwork activates the parasympathetic nervous system (also known as rest-and-digest), which then works towards quietening the body and the mind.<\/p>\n\n\n\n<p>In the endocrine system, the pituitary gland is stimulated to promote the release of endorphins – the happy hormones gifting you with an enhanced state of wellbeing.<\/p>\n\n\n\n<p>These are just some of the main benefits yoga inversions have to offer and the list could go on. Yoga texts even go so far as defining inversion poses as the Fountain of Youth causing a rejuvenating effect on the body and even defying time. You are invited to see for yourselves.<\/p>\n\n\n\n<p>After reading this article, perhaps you can see there is nothing to fear but so much to gain from an inversions yoga practice! Be brave and start to explore your body in space upside down.<\/p>\n\n\n\n<p>You could start with <a href=\"https:\/\/tintyoga.com\/instructors\/mathieu-boldron\">Mathieu Boldron<\/a>&#8216;s 8-part workshop <a href=\"https:\/\/watch.tintyoga.com\/programs\/build-towards-handstand\">Build Towards Handstand<\/a> or <a href=\"https:\/\/tintyoga.com\/instructors\/cameron-shayne\">Cameron Shayne<\/a>&#8216;s 13-part workshop <a href=\"https:\/\/watch.tintyoga.com\/programs\/budokon-handstand\">Budokon Handstand for Beginners<\/a>. To explore more yoga inversion poses, check out <a href=\"https:\/\/tintyoga.com\/instructors\/desiree-rumbaugh\/\">Desirée Rumbaugh and Andrew Rivin&#8217;<\/a>s Inversions for Home Practice <a href=\"https:\/\/watch.tintyoga.com\/programs\/inversions-home-practice-1?categoryId=12735\">Part 1<\/a> and <a href=\"https:\/\/watch.tintyoga.com\/programs\/inversions-home-practice-2?categoryId=12735\">Part 2<\/a>. Have fun turning your world upside down!<\/p>\n\n\n\n<!-- GALLERY 2x2 -->\n<div class=\"grid-wrapper\">\n<div class=\"grid-2x2-container\">\n\n<!-- Image 1 -->\n<div class=\"aspectratio\" data-ratio=\"16:9\"><div>\n<a href=\"https:\/\/watch.tintyoga.com\/programs\/build-towards-handstand\"><img decoding=\"async\" position=\"bottom\" src=\"https:\/\/tintyoga.com\/wp-content\/uploads\/2021\/07\/Mathieu-Boldron-Build-Towards-Handstand.jpeg\"><\/a>\n<\/div><\/div>\n\n<!-- Image 2 -->\n<div class=\"aspectratio\" data-ratio=\"16:9\"><div>\n<a href=\"https:\/\/watch.tintyoga.com\/programs\/budokon-handstand\"><img decoding=\"async\" position=\"left\" src=\"https:\/\/tintyoga.com\/wp-content\/uploads\/2021\/07\/Cameron-Shayne-Handstand-for-Beginners.jpeg\"><\/a>\n<\/div><\/div>\n\n<!-- Image 3 -->\n<div class=\"aspectratio\" data-ratio=\"16:9\"><div>\n<a href=\"https:\/\/watch.tintyoga.com\/programs\/inversions-home-practice-1?categoryId=12735\"><img decoding=\"async\" position=\"top\" src=\"https:\/\/tintyoga.com\/wp-content\/uploads\/2021\/07\/Inversions-for-Home-Practice-1.jpg\"><\/a>\n<\/div><\/div>\n\n<!-- Image 4 -->\n<div class=\"aspectratio\" data-ratio=\"16:9\"><div>\n<a href=\"https:\/\/watch.tintyoga.com\/programs\/inversions-home-practice-2?categoryId=12735\"><img decoding=\"async\" position=\"left\" src=\"https:\/\/tintyoga.com\/wp-content\/uploads\/2021\/07\/Inversions-for-Home-Practice-2.jpg\"><\/a>\n<\/div><\/div>\n\n<\/div>\n\n<!-- CAPTION -->\n<p class=\"caption\">Explore yoga inversions in these classes on TINT.<\/p>\n<\/div>\n\n\n<span style=\"--tl-form-height-m:1213.05px;--tl-form-height-t:638.781px;--tl-form-height-d:638.781px;\" class=\"tl-placeholder-f-type-shortcode_158494 tl-preload-form\"><span><\/span><\/span>\n\n\n<hr class=\"wp-block-separator has-text-color has-css-opacity has-background is-style-wide\" style=\"background-color:#d3d3d3;color:#d3d3d3\"\/>\n\n\n\n<p><em>Header picture: TINT Teacher <a href=\"https:\/\/watch.tintyoga.com\/authors\/author-Hy6Ev9n4gI4\">Lulu Soul<\/a><\/em><\/p>\n","protected":false},"excerpt":{"rendered":"<p>Yoga allows us to cultivate a deeper connection with our body and give the head a break. A specific family of asanas are inversion poses. <\/p>\n","protected":false},"author":6,"featured_media":153492,"comment_status":"closed","ping_status":"closed","sticky":false,"template":"","format":"standard","meta":{"_et_pb_use_builder":"","_et_pb_old_content":"","_et_gb_content_width":""},"categories":[133],"tags":[],"yoast_head":"<!-- This site is optimized with the Yoast SEO plugin v19.10 - https:\/\/yoast.com\/wordpress\/plugins\/seo\/ -->\n<title>Yoga Inversions – Explore the World Upside Down - TINT Yoga<\/title>\n<meta name=\"description\" content=\"Yoga allows us to cultivate a deeper connection with our body and give the head a break. A specific family of asanas are inversion poses.\" \/>\n<meta name=\"robots\" content=\"index, follow, max-snippet:-1, max-image-preview:large, max-video-preview:-1\" \/>\n<link rel=\"canonical\" href=\"https:\/\/tintyoga.com\/magazine\/yoga-inversions\/\" \/>\n<meta property=\"og:locale\" content=\"en_US\" \/>\n<meta property=\"og:type\" content=\"article\" \/>\n<meta property=\"og:title\" content=\"Yoga Inversions – Explore the World Upside Down - TINT Yoga\" \/>\n<meta property=\"og:description\" content=\"Yoga allows us to cultivate a deeper connection with our body and give the head a break. A specific family of asanas are inversion poses.\" \/>\n<meta property=\"og:url\" content=\"https:\/\/tintyoga.com\/magazine\/yoga-inversions\/\" \/>\n<meta property=\"og:site_name\" content=\"TINT Yoga\" \/>\n<meta property=\"article:publisher\" content=\"https:\/\/www.facebook.com\/tintyoga\/\" \/>\n<meta property=\"article:published_time\" content=\"2021-07-15T12:14:26+00:00\" \/>\n<meta property=\"article:modified_time\" content=\"2022-09-22T12:31:44+00:00\" \/>\n<meta property=\"og:image\" content=\"https:\/\/tintyoga.com\/wp-content\/uploads\/2021\/07\/Yoga-Inversion_Lulu-Soul-e1626434004537.jpeg\" \/>\n\t<meta property=\"og:image:width\" content=\"1350\" \/>\n\t<meta property=\"og:image:height\" content=\"499\" \/>\n\t<meta property=\"og:image:type\" content=\"image\/jpeg\" \/>\n<meta name=\"author\" content=\"doreen\" \/>\n<meta name=\"twitter:card\" content=\"summary_large_image\" \/>\n<meta name=\"twitter:label1\" content=\"Written by\" \/>\n\t<meta name=\"twitter:data1\" content=\"doreen\" \/>\n\t<meta name=\"twitter:label2\" content=\"Est. reading time\" \/>\n\t<meta name=\"twitter:data2\" content=\"11 minutes\" \/>\n<script type=\"application\/ld+json\" class=\"yoast-schema-graph\">{\"@context\":\"https:\/\/schema.org\",\"@graph\":[{\"@type\":\"Article\",\"@id\":\"https:\/\/tintyoga.com\/magazine\/yoga-inversions\/#article\",\"isPartOf\":{\"@id\":\"https:\/\/tintyoga.com\/magazine\/yoga-inversions\/\"},\"author\":{\"name\":\"doreen\",\"@id\":\"https:\/\/tintyoga.com\/#\/schema\/person\/581877dfb2f1e012aa8f2a2a39a44c3b\"},\"headline\":\"Yoga Inversions – Explore the World Upside Down\",\"datePublished\":\"2021-07-15T12:14:26+00:00\",\"dateModified\":\"2022-09-22T12:31:44+00:00\",\"mainEntityOfPage\":{\"@id\":\"https:\/\/tintyoga.com\/magazine\/yoga-inversions\/\"},\"wordCount\":471,\"publisher\":{\"@id\":\"https:\/\/tintyoga.com\/#organization\"},\"articleSection\":[\"Tutorials\"],\"inLanguage\":\"en-US\"},{\"@type\":\"WebPage\",\"@id\":\"https:\/\/tintyoga.com\/magazine\/yoga-inversions\/\",\"url\":\"https:\/\/tintyoga.com\/magazine\/yoga-inversions\/\",\"name\":\"Yoga Inversions – Explore the World Upside Down - TINT Yoga\",\"isPartOf\":{\"@id\":\"https:\/\/tintyoga.com\/#website\"},\"datePublished\":\"2021-07-15T12:14:26+00:00\",\"dateModified\":\"2022-09-22T12:31:44+00:00\",\"description\":\"Yoga allows us to cultivate a deeper connection with our body and give the head a break. A specific family of asanas are inversion poses.\",\"breadcrumb\":{\"@id\":\"https:\/\/tintyoga.com\/magazine\/yoga-inversions\/#breadcrumb\"},\"inLanguage\":\"en-US\",\"potentialAction\":[{\"@type\":\"ReadAction\",\"target\":[\"https:\/\/tintyoga.com\/magazine\/yoga-inversions\/\"]}]},{\"@type\":\"BreadcrumbList\",\"@id\":\"https:\/\/tintyoga.com\/magazine\/yoga-inversions\/#breadcrumb\",\"itemListElement\":[{\"@type\":\"ListItem\",\"position\":1,\"name\":\"Home\",\"item\":\"https:\/\/tintyoga.com\/\"},{\"@type\":\"ListItem\",\"position\":2,\"name\":\"Yoga Inversions – Explore the World Upside Down\"}]},{\"@type\":\"WebSite\",\"@id\":\"https:\/\/tintyoga.com\/#website\",\"url\":\"https:\/\/tintyoga.com\/\",\"name\":\"TINT Yoga\",\"description\":\"TINT Yoga offers premium online yoga classes with the world&#039;s most popular yoga and movement instructors. Learn and work out with our online yoga videos.\",\"publisher\":{\"@id\":\"https:\/\/tintyoga.com\/#organization\"},\"potentialAction\":[{\"@type\":\"SearchAction\",\"target\":{\"@type\":\"EntryPoint\",\"urlTemplate\":\"https:\/\/tintyoga.com\/?s={search_term_string}\"},\"query-input\":\"required name=search_term_string\"}],\"inLanguage\":\"en-US\"},{\"@type\":\"Organization\",\"@id\":\"https:\/\/tintyoga.com\/#organization\",\"name\":\"TINT Yoga\",\"url\":\"https:\/\/tintyoga.com\/\",\"logo\":{\"@type\":\"ImageObject\",\"inLanguage\":\"en-US\",\"@id\":\"https:\/\/tintyoga.com\/#\/schema\/logo\/image\/\",\"url\":\"https:\/\/tintyoga.com\/wp-content\/uploads\/2021\/08\/logo_color_black.png\",\"contentUrl\":\"https:\/\/tintyoga.com\/wp-content\/uploads\/2021\/08\/logo_color_black.png\",\"width\":1001,\"height\":301,\"caption\":\"TINT Yoga\"},\"image\":{\"@id\":\"https:\/\/tintyoga.com\/#\/schema\/logo\/image\/\"},\"sameAs\":[\"https:\/\/www.instagram.com\/tint_yoga\/\",\"https:\/\/de.linkedin.com\/company\/tint-gmbh\",\"https:\/\/www.pinterest.de\/tintyoga\/\",\"https:\/\/www.youtube.com\/channel\/UC2HjTe0TL20qSk8e3s1d0DA\",\"https:\/\/www.facebook.com\/tintyoga\/\"]},{\"@type\":\"Person\",\"@id\":\"https:\/\/tintyoga.com\/#\/schema\/person\/581877dfb2f1e012aa8f2a2a39a44c3b\",\"name\":\"doreen\",\"image\":{\"@type\":\"ImageObject\",\"inLanguage\":\"en-US\",\"@id\":\"https:\/\/tintyoga.com\/#\/schema\/person\/image\/\",\"url\":\"https:\/\/secure.gravatar.com\/avatar\/5ac132c6e49e85e81542f95a7a9e124e?s=96&d=mm&r=g\",\"contentUrl\":\"https:\/\/secure.gravatar.com\/avatar\/5ac132c6e49e85e81542f95a7a9e124e?s=96&d=mm&r=g\",\"caption\":\"doreen\"},\"url\":\"https:\/\/tintyoga.com\/magazine\/author\/doreen\/\"}]}<\/script>\n<!-- \/ Yoast SEO plugin. -->","yoast_head_json":{"title":"Yoga Inversions – Explore the World Upside Down - TINT Yoga","description":"Yoga allows us to cultivate a deeper connection with our body and give the head a break. A specific family of asanas are inversion poses.","robots":{"index":"index","follow":"follow","max-snippet":"max-snippet:-1","max-image-preview":"max-image-preview:large","max-video-preview":"max-video-preview:-1"},"canonical":"https:\/\/tintyoga.com\/magazine\/yoga-inversions\/","og_locale":"en_US","og_type":"article","og_title":"Yoga Inversions – Explore the World Upside Down - TINT Yoga","og_description":"Yoga allows us to cultivate a deeper connection with our body and give the head a break. A specific family of asanas are inversion poses.","og_url":"https:\/\/tintyoga.com\/magazine\/yoga-inversions\/","og_site_name":"TINT Yoga","article_publisher":"https:\/\/www.facebook.com\/tintyoga\/","article_published_time":"2021-07-15T12:14:26+00:00","article_modified_time":"2022-09-22T12:31:44+00:00","og_image":[{"width":1350,"height":499,"url":"https:\/\/tintyoga.com\/wp-content\/uploads\/2021\/07\/Yoga-Inversion_Lulu-Soul-e1626434004537.jpeg","type":"image\/jpeg"}],"author":"doreen","twitter_card":"summary_large_image","twitter_misc":{"Written by":"doreen","Est. reading time":"11 minutes"},"schema":{"@context":"https:\/\/schema.org","@graph":[{"@type":"Article","@id":"https:\/\/tintyoga.com\/magazine\/yoga-inversions\/#article","isPartOf":{"@id":"https:\/\/tintyoga.com\/magazine\/yoga-inversions\/"},"author":{"name":"doreen","@id":"https:\/\/tintyoga.com\/#\/schema\/person\/581877dfb2f1e012aa8f2a2a39a44c3b"},"headline":"Yoga Inversions – Explore the World Upside Down","datePublished":"2021-07-15T12:14:26+00:00","dateModified":"2022-09-22T12:31:44+00:00","mainEntityOfPage":{"@id":"https:\/\/tintyoga.com\/magazine\/yoga-inversions\/"},"wordCount":471,"publisher":{"@id":"https:\/\/tintyoga.com\/#organization"},"articleSection":["Tutorials"],"inLanguage":"en-US"},{"@type":"WebPage","@id":"https:\/\/tintyoga.com\/magazine\/yoga-inversions\/","url":"https:\/\/tintyoga.com\/magazine\/yoga-inversions\/","name":"Yoga Inversions – Explore the World Upside Down - TINT Yoga","isPartOf":{"@id":"https:\/\/tintyoga.com\/#website"},"datePublished":"2021-07-15T12:14:26+00:00","dateModified":"2022-09-22T12:31:44+00:00","description":"Yoga allows us to cultivate a deeper connection with our body and give the head a break. A specific family of asanas are inversion poses.","breadcrumb":{"@id":"https:\/\/tintyoga.com\/magazine\/yoga-inversions\/#breadcrumb"},"inLanguage":"en-US","potentialAction":[{"@type":"ReadAction","target":["https:\/\/tintyoga.com\/magazine\/yoga-inversions\/"]}]},{"@type":"BreadcrumbList","@id":"https:\/\/tintyoga.com\/magazine\/yoga-inversions\/#breadcrumb","itemListElement":[{"@type":"ListItem","position":1,"name":"Home","item":"https:\/\/tintyoga.com\/"},{"@type":"ListItem","position":2,"name":"Yoga Inversions – Explore the World Upside Down"}]},{"@type":"WebSite","@id":"https:\/\/tintyoga.com\/#website","url":"https:\/\/tintyoga.com\/","name":"TINT Yoga","description":"TINT Yoga offers premium online yoga classes with the world&#039;s most popular yoga and movement instructors. Learn and work out with our online yoga videos.","publisher":{"@id":"https:\/\/tintyoga.com\/#organization"},"potentialAction":[{"@type":"SearchAction","target":{"@type":"EntryPoint","urlTemplate":"https:\/\/tintyoga.com\/?s={search_term_string}"},"query-input":"required name=search_term_string"}],"inLanguage":"en-US"},{"@type":"Organization","@id":"https:\/\/tintyoga.com\/#organization","name":"TINT Yoga","url":"https:\/\/tintyoga.com\/","logo":{"@type":"ImageObject","inLanguage":"en-US","@id":"https:\/\/tintyoga.com\/#\/schema\/logo\/image\/","url":"https:\/\/tintyoga.com\/wp-content\/uploads\/2021\/08\/logo_color_black.png","contentUrl":"https:\/\/tintyoga.com\/wp-content\/uploads\/2021\/08\/logo_color_black.png","width":1001,"height":301,"caption":"TINT Yoga"},"image":{"@id":"https:\/\/tintyoga.com\/#\/schema\/logo\/image\/"},"sameAs":["https:\/\/www.instagram.com\/tint_yoga\/","https:\/\/de.linkedin.com\/company\/tint-gmbh","https:\/\/www.pinterest.de\/tintyoga\/","https:\/\/www.youtube.com\/channel\/UC2HjTe0TL20qSk8e3s1d0DA","https:\/\/www.facebook.com\/tintyoga\/"]},{"@type":"Person","@id":"https:\/\/tintyoga.com\/#\/schema\/person\/581877dfb2f1e012aa8f2a2a39a44c3b","name":"doreen","image":{"@type":"ImageObject","inLanguage":"en-US","@id":"https:\/\/tintyoga.com\/#\/schema\/person\/image\/","url":"https:\/\/secure.gravatar.com\/avatar\/5ac132c6e49e85e81542f95a7a9e124e?s=96&d=mm&r=g","contentUrl":"https:\/\/secure.gravatar.com\/avatar\/5ac132c6e49e85e81542f95a7a9e124e?s=96&d=mm&r=g","caption":"doreen"},"url":"https:\/\/tintyoga.com\/magazine\/author\/doreen\/"}]}},"acf":[],"_links":{"self":[{"href":"https:\/\/tintyoga.com\/wp-json\/wp\/v2\/posts\/152206"}],"collection":[{"href":"https:\/\/tintyoga.com\/wp-json\/wp\/v2\/posts"}],"about":[{"href":"https:\/\/tintyoga.com\/wp-json\/wp\/v2\/types\/post"}],"author":[{"embeddable":true,"href":"https:\/\/tintyoga.com\/wp-json\/wp\/v2\/users\/6"}],"replies":[{"embeddable":true,"href":"https:\/\/tintyoga.com\/wp-json\/wp\/v2\/comments?post=152206"}],"version-history":[{"count":35,"href":"https:\/\/tintyoga.com\/wp-json\/wp\/v2\/posts\/152206\/revisions"}],"predecessor-version":[{"id":163212,"href":"https:\/\/tintyoga.com\/wp-json\/wp\/v2\/posts\/152206\/revisions\/163212"}],"wp:featuredmedia":[{"embeddable":true,"href":"https:\/\/tintyoga.com\/wp-json\/wp\/v2\/media\/153492"}],"wp:attachment":[{"href":"https:\/\/tintyoga.com\/wp-json\/wp\/v2\/media?parent=152206"}],"wp:term":[{"taxonomy":"category","embeddable":true,"href":"https:\/\/tintyoga.com\/wp-json\/wp\/v2\/categories?post=152206"},{"taxonomy":"post_tag","embeddable":true,"href":"https:\/\/tintyoga.com\/wp-json\/wp\/v2\/tags?post=152206"}],"curies":[{"name":"wp","href":"https:\/\/api.w.org\/{rel}","templated":true}]}}