{"id":153455,"date":"2021-07-30T15:35:28","date_gmt":"2021-07-30T14:35:28","guid":{"rendered":"https:\/\/tintyoga.com\/?p=153455"},"modified":"2021-12-08T18:12:44","modified_gmt":"2021-12-08T17:12:44","slug":"yoga-and-traditional-chinese-medicine","status":"publish","type":"post","link":"https:\/\/tintyoga.com\/magazine\/yoga-and-traditional-chinese-medicine\/","title":{"rendered":"Traditional Chinese Medicine: A Holistic Practice that Yoga Can Complement"},"content":{"rendered":"\n<p class=\"intro-text\">For most serious practitioners, yoga is a lifestyle choice that goes far beyond daily yoga practice. It forges such a strong connection between the body, mind, and spirit that often transfers into all other aspects of daily life. In fact, yoga originated with the primary intent of connecting physical health with mental balance and emotional tranquility.<\/p>\n\n\n\n<p>Yoga seeks to encourage a lifestyle where harmony, gratitude, calmness, and positive thinking receive just as much focus as physical health. This set of priorities makes <strong>yoga an incredibly powerful form of holistic therapy<\/strong> all of its own.<\/p>\n\n\n\n<p>You might even say that <strong>yoga is its own complete integrative health care system<\/strong> because it encourages the mind and body to work together for overall wellness. Breathwork, meditation, and physical poses are all combined with the entire being in mind.<\/p>\n\n\n\n<p>The poses promote a <strong>deeper sense of connectedness<\/strong> and physical and mental alignment. The mindful stretching, calmness, and discipline enhance overall wellbeing while supporting a <a href=\"https:\/\/www.yogajournal.com\/lifestyle\/health\/womens-health\/count-yoga-38-ways-yoga-keeps-fit\/\" target=\"_blank\" rel=\"noreferrer noopener\">variety of physical processes within the body<\/a>, including adrenal activity and hormonal balance.<\/p>\n\n\n\n<p>With that in mind, it only makes sense that yoga can be an excellent complementary therapy to <strong>Traditional Chinese Medicine<\/strong> <strong>(TCM)<\/strong>. Let’s take a look at how these two holistic approaches can be integrated for even greater benefit.<\/p>\n\n\n\n<div class=\"toc-wrapper\">\n<p>Table of Contents<\/p>\n\n<ul class=\"fa-ul toc-list\">\n  <li>\n  <span class=\"fa-li\"><i class=\"fa fa-long-arrow-right\"><\/i><\/span>\n  <a href=\"#1\">1. Traditional Chinese Medicine and Yoga Go Hand in Hand<\/a><\/li>\n  <li>\n  <span class=\"fa-li\"><i class=\"fa fa-long-arrow-right\"><\/i><\/span>\n  <a href=\"#2\">2. The Fundamentals of Traditional Chinese Medicine<\/a><\/li>\n  <li>\n  <span class=\"fa-li\"><i class=\"fa fa-long-arrow-right\"><\/i><\/span>\n  <a href=\"#3\">3. How Yoga and Chinese Medicine Are Similar<\/a><\/li>\n  <li>\n  <span class=\"fa-li\"><i class=\"fa fa-long-arrow-right\"><\/i><\/span>\n  <a href=\"#4\">4. Ways to Integrate Yoga and Chinese Medicine<\/a><\/li>\n  <li>\n  <span class=\"fa-li\"><i class=\"fa fa-long-arrow-right\"><\/i><\/span>\n  <a href=\"#5\">5. Wrapping Things Up<\/a><\/li>\n<\/ul>\n<\/div>\n\n\n\n<h2 id=\"1\">1. Traditional Chinese Medicine and Yoga Go Hand in Hand<\/h2>\n\n\n\n<p>When you look at the origins of <strong>Traditional Chinese Medicine and yoga<\/strong>, they appear to be two entirely different holistic therapies. After all, yoga originated in India around 3000 BC, while TCM has been practiced for more than 3,500 years in China.<\/p>\n\n\n\n<p>However, it’s very likely that <strong>these two practices were influenced by one another<\/strong>. While each one originated in its own culture, they both follow the same basic principle that balance in the mind and body are at the core of optimal health and wellbeing.&nbsp;<\/p>\n\n\n\n<p>Practitioners are finding that integrating these two ancient traditions can bring even more effective results for their patients. <strong>Adding TCM into a regular yoga practice<\/strong> can help you become more aware of your body on a deeper level. This deeper connection between the mind and body can help you achieve balance and support both your mental and physical health.<\/p>\n\n\n<span style=\"--tl-form-height-m:1213.05px;--tl-form-height-t:638.781px;--tl-form-height-d:638.781px;\" class=\"tl-placeholder-f-type-shortcode_158494 tl-preload-form\"><span><\/span><\/span>\n\n\n<h2 id=\"2\">2. The Fundamentals of Traditional Chinese Medicine<\/h2>\n\n\n\n<p>To understand how <strong>Traditional Chinese Medicine can amplify your yoga practice<\/strong>, it might be helpful to understand some of the fundamentals of TCM. In Traditional Chinese Medicine, energy known as Qi moves through twelve meridians, with each meridian representing a specific organ. These meridians also connect the internal organs to the skin.<\/p>\n\n\n\n<p>When Qi flows through these meridians freely, it promotes balance and supports healthy organ and body function. On the other hand, when the Qi becomes stagnant, it results in illness and pain in the organ and areas associated with that specific meridian.&nbsp;<\/p>\n\n\n\n<p>Traditional Chinese Medicine <strong>uses a variety of practices<\/strong> like acupuncture, acupressure, cupping, massage, and herbal medicine to promote energy flow, balance, and optimal health. Traditional Chinese Medicine practitioners also recommend a practice called Qigong to promote good Qi flow and optimal health and balance in the mind and body.<\/p>\n\n\n\n<h2 id=\"3\">3. How Yoga and Chinese Medicine Are Similar<\/h2>\n\n\n\n<p>If you have been practicing yoga for a while, you’re probably already beginning to see the connection here. One of the key principles of yoga is promoting mental and physical health through <strong>the proper flow of energy in the body<\/strong>. Yoga utilizes restful postures that are held for several minutes, and they are often focused on body meridians, too.&nbsp;<\/p>\n\n\n\n<p>Through these poses, <strong>yoga stimulates the energy pathways<\/strong> associated with each meridian. Holding the poses for an extended time places focus on the connective tissues that hold the cells of the body in place.&nbsp;<\/p>\n\n\n\n<p>When you are healthy, these connective tissues are strong and flexible, but when you’re ill, they’re rigid and tight. By performing and holding the poses, we can dissipate stagnant energy in these connective tissues, which <strong>benefits overall health<\/strong>.<\/p>\n\n\n\n<p>In TCM, <strong>the meridians are also associated with specific emotions<\/strong>, such as fear, anger, and excitement. Excessive emotions are thought to disturb the body’s balance. Chinese Medicine practitioners treat the organ and the emotions associated with the organ to balance the autonomic nervous system and promote energy flow.<\/p>\n\n\n\n<p>In yoga, we still use our body and mind to <strong>promote balance and harmony<\/strong>. Breathing techniques are used to promote oxygen flow, blood flow, and to calm the body, mind, and emotions.&nbsp;<\/p>\n\n\n\n<p>At the end of the day, both practices emphasize <strong>energy flow and a mind-body balance<\/strong> to promote overall mental and physical health – they simply use different methods to get there.&nbsp;<\/p>\n\n\n<span style=\"--tl-form-height-m:1213.05px;--tl-form-height-t:638.781px;--tl-form-height-d:638.781px;\" class=\"tl-placeholder-f-type-shortcode_158494 tl-preload-form\"><span><\/span><\/span>\n\n\n<h2 id=\"4\">4. Ways to Integrate Yoga and Chinese Medicine<\/h2>\n\n\n\n<p>Here’s how you can <strong>integrate Traditional Chinese Medicine into your yoga practice<\/strong> for even better results.<\/p>\n\n\n\n<h3>4.1. Meditation<\/h3>\n\n\n\n<p>Yoga and Traditional Chinese Medicine both utilize <strong>meditation as a key approach<\/strong> for balancing emotions and calming the mind. If you find meditation difficult, yoga postures can help you relax while promoting energy flow in the spine and balance in the mind, which are key concepts in TCM.<\/p>\n\n\n\n<p>Both practices are all about connecting the mind and body, and meditation is a great way to promote awareness. It also reduces stress to amplify the benefits of both traditions.<\/p>\n\n\n\n<div class=\"video-wrapper\">\n<div class=\"video-wrapper-inner\">\n\n<!-- YOUTUBE VIDEO GOES HERE -->\n<iframe width=\"560\" height=\"315\" src=\"https:\/\/www.youtube.com\/embed\/Zpkp-QKi6sY\" frameborder=\"0\" allow=\"accelerometer; autoplay; encrypted-media; gyroscope; picture-in-picture\" allowfullscreen=\"\"><\/iframe>\n\n<p class=\"caption\">Start your meditation journey with <a href=\"https:\/\/tintyoga.com\/instructors\/matt-giordano\/\">Matt Giordano<\/a> and the <a href=\"https:\/\/watch.tintyoga.com\/programs\/strong-calm\">30-Day Yoga &amp; Meditation Challenge<\/a> on TINT.<\/p>\n\n<\/div>\n<\/div>\n\n\n\n<h3>4.2. Chinese Herbal Medicine<\/h3>\n\n\n\n<p>Chinese Herbal Medicine is an excellent addition to any yoga practitioner’s wellness routine. The beauty of Chinese herbs is that they can <strong>easily be combined with other holistic approaches<\/strong> for enhanced results. They provide a safer, more natural way to treat a variety of ailments without pharmaceuticals.<\/p>\n\n\n\n<p>In Traditional Chinese Medicine, herbs are often incorporated into a holistic treatment plan to help<strong> bring the body back into balance<\/strong> and nourish the organs for improved overall health.&nbsp;<\/p>\n\n\n\n<p>Practitioners at the <a href=\"https:\/\/www.yinovacenter.com\/\" target=\"_blank\" rel=\"noreferrer noopener\">Yinova Center in NYC<\/a> explained how Chinese fertility herbs are used to “bring the hormones back into balance and support the reproductive system.” <strong>Adaptogenic herbs <\/strong>are also recommended for those suffering from chronic stress.<\/p>\n\n\n\n<p><strong>Acupuncturists<\/strong> often incorporate herbs into their treatment regimens for pain relief and reducing inflammation due to illness and injury. It’s easy to see how <strong>yoga and Chinese Herbal Medicine<\/strong> can complement and enhance each other for a variety of conditions, as well as general health and wellness.<\/p>\n\n\n\n<h3>4.3. Prenatal Massage<\/h3>\n\n\n\n<p>For moms-to-be, <strong>prenatal massage and yoga <\/strong>can work together to address common pregnancy complaints and reduce aches and pains. A woman’s body goes through dramatic hormonal and physical changes as her pregnancy progresses, and these two therapies are fantastic for reducing discomfort while nurturing the body through every stage of pregnancy.&nbsp;<\/p>\n\n\n\n<p>Yoga and prenatal massage <a href=\"https:\/\/yogadigest.com\/why-yoga-and-prenatal-massage-should-go-hand-in-hand-during-pregnancy\/\" target=\"_blank\" rel=\"noreferrer noopener\">can work together<\/a> to keep the uterus and ligaments toned and healthy. This is crucial for preventing issues like preterm labor, incontinence, and uterine prolapse. These two therapies can be beneficial for sore muscles and joints, too.&nbsp;<\/p>\n\n\n\n<p>Other common pregnancy discomforts that respond well to prenatal massage and yoga are lower back pain, sciatica, headaches, and leg cramps. In fact, edema, nasal congestion, and even heartburn can show drastic improvement when these strategies are combined.&nbsp;<\/p>\n\n\n\n<p>Women who practice yoga and receive regular prenatal massage throughout their pregnancies have fewer issues with insomnia because they are calmer and less stressed. And both techniques can be <strong>adapted to each stage of pregnancy<\/strong>, working together for maximum benefit from conception through labor, delivery, and recovery.<\/p>\n\n\n\n<!-- IMAGE 16:9 -->\n<div class=\"image-wrapper\">\n<div class=\"individual\" position=\"bottom\">\n  <div>\n   <img decoding=\"async\" src=\"https:\/\/tintyoga.com\/wp-content\/uploads\/2021\/07\/Nicole-Bongartz_Prenatal-Yoga_Thumbnails.jpeg\">\n  <\/div>\n<\/div>\n\n<!-- CAPTION -->\n<p class=\"caption\">See how <a href=\"https:\/\/watch.tintyoga.com\/programs\/prenatal-yoga-full-body-preparation\">Prenatal Yoga<\/a> can be a relief during pregnancy with <a href=\"https:\/\/tintyoga.com\/instructors\/nicole-bongartz\/\">Nicole Bongartz<\/a> on TINT.<\/p>\n<\/div>\n\n\n\n<h3>4.4. Acupuncture<\/h3>\n\n\n\n<p>Acupuncture is an ancient practice that offers a safe and effective way to <strong>address chronic pain <\/strong>and a host of other health issues. It can also reduce inflammation and increase flexibility, as well as <a href=\"https:\/\/www.pacificcollege.edu\/news\/blog\/2015\/04\/17\/how-does-acupuncture-fertility-work-increase-chance-conception-without-side-effects\" target=\"_blank\" rel=\"noreferrer noopener\">correct hormonal imbalances and fertility issues<\/a>.<\/p>\n\n\n\n<p>Acupuncture is based on the theory that energy, called Qi, runs throughout the body in various pathways that connect one organ system to another. These pathways can become blocked due to chronic stress, illness, or injury. This blocked energy is the cause of pain and illness. <strong>Acupuncture unblocks Qi<\/strong>, allowing it to move freely once again.<\/p>\n\n\n\n<p>The process of inserting acupuncture needles into the body at various acupuncture points also encourages the <strong>release of endorphins<\/strong>. Endorphins are known as the body’s natural pain killers. They are said to be as much as 10,000 times more effective for relieving pain than morphine.<\/p>\n\n\n\n<p>Acupuncture is also said to <strong>reduce inflammation in muscles and joint<\/strong>s, increase blood flow, and boost the immune system. It can relax tight muscles and improve range of motion while reducing strain and weariness in the muscles. It’s a great way to complement the positive effects you are seeing in your yoga practice.<\/p>\n\n\n\n<div class=\"video-wrapper\">\n<div class=\"video-wrapper-inner\">\n\n<!-- YOUTUBE VIDEO GOES HERE -->\n<iframe width=\"560\" height=\"315\" src=\"https:\/\/www.youtube.com\/embed\/KqI1T_IVzt8\" frameborder=\"0\" allow=\"accelerometer; autoplay; encrypted-media; gyroscope; picture-in-picture\" allowfullscreen=\"\"><\/iframe>\n\n<!-- CAPTION -->\n<p class=\"caption\">Find relief through yoga in <a href=\"https:\/\/tintyoga.com\/instructors\/chris-su\/\">Chris Su&#8217;s<\/a> Yin yoga series <a href=\"https:\/\/watch.tintyoga.com\/programs\/the-power-of-deep-and-mindful-relaxation\">The Power of Deep and Mindful Relaxation<\/a> on TINT.<\/p>\n\n<\/div>\n<\/div>\n\n\n\n<h3>4.5. Incorporating the Elements and Seasons of TCM into Your Yoga Practice<\/h3>\n\n\n\n<p>Traditional Chinese Medicine places a strong emphasis on the <a href=\"https:\/\/tintyoga.com\/magazine\/5-elements-of-nature\/\">five elements<\/a>. They are used to describe patterns and cycles in relation to the seasons. The water element is associated with winter, wood with spring, earth with late summer, fire with summer, and metal with fall.<\/p>\n\n\n\n<p>One way to <strong>integrate the five elements of TCM into your yoga practice <\/strong>is to utilize a sequence of poses that targets the current season. For example, TCM medicine associates spring with the wood element, as well as renewal and growth and the liver and gallbladder.<\/p>\n\n\n\n<p>The liver and gallbladder are essential for emotional and physical detoxification. When the <strong>energy is out of balance<\/strong> in these areas, we tend to feel stressed, irritable, and restless. We might experience headaches, mood fluctuations, and digestive upset.&nbsp;<\/p>\n\n\n\n<p>Although imbalances in the wood element can happen at any time, they tend to be more prominent in the spring due to the long stagnation of winter. Yoga is a wonderful way to overcome this stagnation and stimulate the liver and gallbladder. Twists, bends, and inversions are especially useful for this.<\/p>\n\n\n\n<p>Here’s another example: In the summer, you tend to be hot, so you would want to do practices that are cooling. That means performing the poses more slowly and deliberately, utilizing standing poses for stability, and incorporating meditation to nourish and cool the mind.&nbsp;<\/p>\n\n\n\n<p>Another idea is to use postures that focus on the fire element when you’re feeling sluggish. You might want to do sun salutations to perk up the fire in your body and energize the mind.<\/p>\n\n\n\n<div class=\"video-wrapper\">\n<div class=\"video-wrapper-inner\">\n\n<!-- YOUTUBE VIDEO GOES HERE -->\n<iframe width=\"560\" height=\"315\" src=\"https:\/\/www.youtube.com\/embed\/_JfYLfBy0J0\" frameborder=\"0\" allow=\"accelerometer; autoplay; encrypted-media; gyroscope; picture-in-picture\" allowfullscreen=\"\"><\/iframe>\n\n<!-- CAPTION -->\n<p class=\"caption\">Experience the connection between yoga and the five elements with <a href=\"https:\/\/tintyoga.com\/instructors\/cristi-christensen\/\">Cristi Christensen<\/a> and her <a href=\"https:\/\/watch.tintyoga.com\/programs\/soul-fire-elemental-activation\">Soul Fire Elemental Activation<\/a> on TINT.<\/p>\n\n<\/div>\n<\/div>\n\n\n\n<h3>4.6. Cupping Therapy<\/h3>\n\n\n\n<p>Cupping is a TCM therapy that utilizes <strong>glass cups to create suction <\/strong>and stimulate specific acupuncture points. It is useful for stimulating energy flow, improving circulation, relieving muscle tension, and releasing toxins. It is an ancient technique for promoting healing and recovery.<\/p>\n\n\n\n<p>Cupping is especially useful for <strong>relieving back and neck pain<\/strong>. It is often used in conjunction with acupuncture, massage, and yoga to speed recovery from cold and flu, support digestion, ease allergy symptoms, improve skin health, and promote stress relief.<\/p>\n\n\n\n<p><strong>Combining cupping with yoga<\/strong> can maximize your performance and results. For example, cupping pulls toxins to the surface and yoga promotes better blood flow so the lymph system can flush those toxins out. Both practices promote blood flow which brings healing nutrients to the area.<\/p>\n\n\n\n<h2 id=\"5\">5. Wrapping Things Up<\/h2>\n\n\n\n<p>Modern society often assumes that modern medicine is better than <strong>holistic practices like Traditional Chinese Medicine and yoga<\/strong>. But the truth is, these holistic and integrative approaches can provide longer-lasting and further-reaching benefits in many cases.<\/p>\n\n\n\n<p>This is especially true for <strong>people with chronic health conditions <\/strong>where behavior and lifestyle modifications can dramatically improve their quality of life. Chronic stress, insomnia, poor diet, and fitness are also key contributors to many chronic issues, from diabetes to arthritis.<\/p>\n\n\n\n<p>It’s also important to note that <strong>lifestyle modifications<\/strong>, such as yoga and TCM, can slow or potentially reverse the symptoms of many chronic illnesses, such as cancer, heart disease, and even migraines.<\/p>\n\n\n\n<p>But even more than that, in cases <strong>where conventional medicine can’t diagnose a problem<\/strong>, holistic therapies can be especially beneficial. That’s because these therapies seek to correct systemic imbalances, both mentally and physically. The result is improved overall health that goes far beyond the issues the individual was seeking treatment for to begin with.<\/p>\n\n\n\n<p>In our society, popping a pill for every ailment or pain is common practice, but that often provides only temporary relief. <strong>Combining these holistic approaches<\/strong> offers a better solution for lasting change and improved mental and physical wellbeing.<\/p>\n\n\n<span style=\"--tl-form-height-m:1213.05px;--tl-form-height-t:638.781px;--tl-form-height-d:638.781px;\" class=\"tl-placeholder-f-type-shortcode_158494 tl-preload-form\"><span><\/span><\/span>\n\n\n<p><\/p>\n\n\n\n<hr class=\"wp-block-separator has-text-color has-background is-style-wide\" style=\"background-color:#c4c4c4;color:#c4c4c4\"\/>\n\n\n\n<p><\/p>\n\n\n\n<p><em>This article was provided by&nbsp;<a href=\"https:\/\/www.nicolemccray.com\/\" target=\"_blank\" rel=\"noreferrer noopener\">Nicole McCray<\/a>, an experienced content writer with a passion for all aspects of wellness. She worked a side gig at a yoga studio for years before becoming a mom, and absolutely fell in love with holistic and alternative therapies during her first pregnancy. She’s been proclaimed the “health nut” amongst family and friends, and when she’s not writing,&nbsp;Nicole&nbsp;can&nbsp;be found&nbsp;studying to become a health&nbsp;coach and reading up on all aspects of healthy living<\/em>.<\/p>\n\n\n\n<p><em>Header picture by <a href=\"https:\/\/unsplash.com\/@momentance?utm_source=unsplash&amp;utm_medium=referral&amp;utm_content=creditCopyText\">SwapnIl Dwivedi<\/a> on <a href=\"https:\/\/unsplash.com\/s\/photos\/traditional-chinese-medicine?utm_source=unsplash&amp;utm_medium=referral&amp;utm_content=creditCopyText\">Unsplash<\/a><\/em><\/p>\n","protected":false},"excerpt":{"rendered":"<p>Yoga can be a great complementary therapy to Traditional Chinese Medicine. Let’s look how these two holistic approaches can work together.<\/p>\n","protected":false},"author":6,"featured_media":153731,"comment_status":"closed","ping_status":"closed","sticky":false,"template":"","format":"standard","meta":{"_et_pb_use_builder":"","_et_pb_old_content":"","_et_gb_content_width":""},"categories":[139],"tags":[],"yoast_head":"<!-- This site is optimized with the Yoast SEO plugin v19.10 - https:\/\/yoast.com\/wordpress\/plugins\/seo\/ -->\n<title>Traditional Chinese Medicine: How Yoga Can Complement It - TINT Yoga<\/title>\n<meta name=\"description\" content=\"Yoga can be a great complementary therapy to Traditional Chinese Medicine. Let’s look how these two holistic approaches can work together.\" \/>\n<meta name=\"robots\" content=\"index, follow, max-snippet:-1, max-image-preview:large, max-video-preview:-1\" \/>\n<link rel=\"canonical\" href=\"https:\/\/tintyoga.com\/magazine\/yoga-and-traditional-chinese-medicine\/\" \/>\n<meta property=\"og:locale\" content=\"en_US\" \/>\n<meta property=\"og:type\" content=\"article\" \/>\n<meta property=\"og:title\" content=\"Traditional Chinese Medicine: A Holistic Practice that Yoga Can Complement - TINT Yoga\" \/>\n<meta property=\"og:description\" content=\"Yoga can be a great complementary therapy to Traditional Chinese Medicine. Let’s look how these two holistic approaches can work together.\" \/>\n<meta property=\"og:url\" content=\"https:\/\/tintyoga.com\/magazine\/yoga-and-traditional-chinese-medicine\/\" \/>\n<meta property=\"og:site_name\" content=\"TINT Yoga\" \/>\n<meta property=\"article:publisher\" content=\"https:\/\/www.facebook.com\/tintyoga\/\" \/>\n<meta property=\"article:published_time\" content=\"2021-07-30T14:35:28+00:00\" \/>\n<meta property=\"article:modified_time\" content=\"2021-12-08T17:12:44+00:00\" \/>\n<meta property=\"og:image\" content=\"https:\/\/tintyoga.com\/wp-content\/uploads\/2021\/07\/TCM_Herbs_unsplash.jpeg\" \/>\n\t<meta property=\"og:image:width\" content=\"1350\" \/>\n\t<meta property=\"og:image:height\" content=\"500\" \/>\n\t<meta property=\"og:image:type\" content=\"image\/jpeg\" \/>\n<meta name=\"author\" content=\"doreen\" \/>\n<meta name=\"twitter:card\" content=\"summary_large_image\" \/>\n<meta name=\"twitter:label1\" content=\"Written by\" \/>\n\t<meta name=\"twitter:data1\" content=\"doreen\" \/>\n\t<meta name=\"twitter:label2\" content=\"Est. reading time\" \/>\n\t<meta name=\"twitter:data2\" content=\"10 minutes\" \/>\n<script type=\"application\/ld+json\" class=\"yoast-schema-graph\">{\"@context\":\"https:\/\/schema.org\",\"@graph\":[{\"@type\":\"Article\",\"@id\":\"https:\/\/tintyoga.com\/magazine\/yoga-and-traditional-chinese-medicine\/#article\",\"isPartOf\":{\"@id\":\"https:\/\/tintyoga.com\/magazine\/yoga-and-traditional-chinese-medicine\/\"},\"author\":{\"name\":\"doreen\",\"@id\":\"https:\/\/tintyoga.com\/#\/schema\/person\/581877dfb2f1e012aa8f2a2a39a44c3b\"},\"headline\":\"Traditional Chinese Medicine: A Holistic Practice that Yoga Can Complement\",\"datePublished\":\"2021-07-30T14:35:28+00:00\",\"dateModified\":\"2021-12-08T17:12:44+00:00\",\"mainEntityOfPage\":{\"@id\":\"https:\/\/tintyoga.com\/magazine\/yoga-and-traditional-chinese-medicine\/\"},\"wordCount\":2247,\"publisher\":{\"@id\":\"https:\/\/tintyoga.com\/#organization\"},\"articleSection\":[\"Yoga &amp; Health\"],\"inLanguage\":\"en-US\"},{\"@type\":\"WebPage\",\"@id\":\"https:\/\/tintyoga.com\/magazine\/yoga-and-traditional-chinese-medicine\/\",\"url\":\"https:\/\/tintyoga.com\/magazine\/yoga-and-traditional-chinese-medicine\/\",\"name\":\"Traditional Chinese Medicine: How Yoga Can Complement It - TINT Yoga\",\"isPartOf\":{\"@id\":\"https:\/\/tintyoga.com\/#website\"},\"datePublished\":\"2021-07-30T14:35:28+00:00\",\"dateModified\":\"2021-12-08T17:12:44+00:00\",\"description\":\"Yoga can be a great complementary therapy to Traditional Chinese Medicine. Let’s look how these two holistic approaches can work together.\",\"breadcrumb\":{\"@id\":\"https:\/\/tintyoga.com\/magazine\/yoga-and-traditional-chinese-medicine\/#breadcrumb\"},\"inLanguage\":\"en-US\",\"potentialAction\":[{\"@type\":\"ReadAction\",\"target\":[\"https:\/\/tintyoga.com\/magazine\/yoga-and-traditional-chinese-medicine\/\"]}]},{\"@type\":\"BreadcrumbList\",\"@id\":\"https:\/\/tintyoga.com\/magazine\/yoga-and-traditional-chinese-medicine\/#breadcrumb\",\"itemListElement\":[{\"@type\":\"ListItem\",\"position\":1,\"name\":\"Home\",\"item\":\"https:\/\/tintyoga.com\/\"},{\"@type\":\"ListItem\",\"position\":2,\"name\":\"Traditional Chinese Medicine: A Holistic Practice that Yoga Can Complement\"}]},{\"@type\":\"WebSite\",\"@id\":\"https:\/\/tintyoga.com\/#website\",\"url\":\"https:\/\/tintyoga.com\/\",\"name\":\"TINT Yoga\",\"description\":\"TINT Yoga offers premium online yoga classes with the world&#039;s most popular yoga and movement instructors. Learn and work out with our online yoga videos.\",\"publisher\":{\"@id\":\"https:\/\/tintyoga.com\/#organization\"},\"potentialAction\":[{\"@type\":\"SearchAction\",\"target\":{\"@type\":\"EntryPoint\",\"urlTemplate\":\"https:\/\/tintyoga.com\/?s={search_term_string}\"},\"query-input\":\"required name=search_term_string\"}],\"inLanguage\":\"en-US\"},{\"@type\":\"Organization\",\"@id\":\"https:\/\/tintyoga.com\/#organization\",\"name\":\"TINT Yoga\",\"url\":\"https:\/\/tintyoga.com\/\",\"logo\":{\"@type\":\"ImageObject\",\"inLanguage\":\"en-US\",\"@id\":\"https:\/\/tintyoga.com\/#\/schema\/logo\/image\/\",\"url\":\"https:\/\/tintyoga.com\/wp-content\/uploads\/2021\/08\/logo_color_black.png\",\"contentUrl\":\"https:\/\/tintyoga.com\/wp-content\/uploads\/2021\/08\/logo_color_black.png\",\"width\":1001,\"height\":301,\"caption\":\"TINT Yoga\"},\"image\":{\"@id\":\"https:\/\/tintyoga.com\/#\/schema\/logo\/image\/\"},\"sameAs\":[\"https:\/\/www.instagram.com\/tint_yoga\/\",\"https:\/\/de.linkedin.com\/company\/tint-gmbh\",\"https:\/\/www.pinterest.de\/tintyoga\/\",\"https:\/\/www.youtube.com\/channel\/UC2HjTe0TL20qSk8e3s1d0DA\",\"https:\/\/www.facebook.com\/tintyoga\/\"]},{\"@type\":\"Person\",\"@id\":\"https:\/\/tintyoga.com\/#\/schema\/person\/581877dfb2f1e012aa8f2a2a39a44c3b\",\"name\":\"doreen\",\"image\":{\"@type\":\"ImageObject\",\"inLanguage\":\"en-US\",\"@id\":\"https:\/\/tintyoga.com\/#\/schema\/person\/image\/\",\"url\":\"https:\/\/secure.gravatar.com\/avatar\/5ac132c6e49e85e81542f95a7a9e124e?s=96&d=mm&r=g\",\"contentUrl\":\"https:\/\/secure.gravatar.com\/avatar\/5ac132c6e49e85e81542f95a7a9e124e?s=96&d=mm&r=g\",\"caption\":\"doreen\"},\"url\":\"https:\/\/tintyoga.com\/magazine\/author\/doreen\/\"}]}<\/script>\n<!-- \/ Yoast SEO plugin. -->","yoast_head_json":{"title":"Traditional Chinese Medicine: How Yoga Can Complement It - TINT Yoga","description":"Yoga can be a great complementary therapy to Traditional Chinese Medicine. Let’s look how these two holistic approaches can work together.","robots":{"index":"index","follow":"follow","max-snippet":"max-snippet:-1","max-image-preview":"max-image-preview:large","max-video-preview":"max-video-preview:-1"},"canonical":"https:\/\/tintyoga.com\/magazine\/yoga-and-traditional-chinese-medicine\/","og_locale":"en_US","og_type":"article","og_title":"Traditional Chinese Medicine: A Holistic Practice that Yoga Can Complement - TINT Yoga","og_description":"Yoga can be a great complementary therapy to Traditional Chinese Medicine. Let’s look how these two holistic approaches can work together.","og_url":"https:\/\/tintyoga.com\/magazine\/yoga-and-traditional-chinese-medicine\/","og_site_name":"TINT Yoga","article_publisher":"https:\/\/www.facebook.com\/tintyoga\/","article_published_time":"2021-07-30T14:35:28+00:00","article_modified_time":"2021-12-08T17:12:44+00:00","og_image":[{"width":1350,"height":500,"url":"https:\/\/tintyoga.com\/wp-content\/uploads\/2021\/07\/TCM_Herbs_unsplash.jpeg","type":"image\/jpeg"}],"author":"doreen","twitter_card":"summary_large_image","twitter_misc":{"Written by":"doreen","Est. reading time":"10 minutes"},"schema":{"@context":"https:\/\/schema.org","@graph":[{"@type":"Article","@id":"https:\/\/tintyoga.com\/magazine\/yoga-and-traditional-chinese-medicine\/#article","isPartOf":{"@id":"https:\/\/tintyoga.com\/magazine\/yoga-and-traditional-chinese-medicine\/"},"author":{"name":"doreen","@id":"https:\/\/tintyoga.com\/#\/schema\/person\/581877dfb2f1e012aa8f2a2a39a44c3b"},"headline":"Traditional Chinese Medicine: A Holistic Practice that Yoga Can Complement","datePublished":"2021-07-30T14:35:28+00:00","dateModified":"2021-12-08T17:12:44+00:00","mainEntityOfPage":{"@id":"https:\/\/tintyoga.com\/magazine\/yoga-and-traditional-chinese-medicine\/"},"wordCount":2247,"publisher":{"@id":"https:\/\/tintyoga.com\/#organization"},"articleSection":["Yoga &amp; Health"],"inLanguage":"en-US"},{"@type":"WebPage","@id":"https:\/\/tintyoga.com\/magazine\/yoga-and-traditional-chinese-medicine\/","url":"https:\/\/tintyoga.com\/magazine\/yoga-and-traditional-chinese-medicine\/","name":"Traditional Chinese Medicine: How Yoga Can Complement It - TINT Yoga","isPartOf":{"@id":"https:\/\/tintyoga.com\/#website"},"datePublished":"2021-07-30T14:35:28+00:00","dateModified":"2021-12-08T17:12:44+00:00","description":"Yoga can be a great complementary therapy to Traditional Chinese Medicine. Let’s look how these two holistic approaches can work together.","breadcrumb":{"@id":"https:\/\/tintyoga.com\/magazine\/yoga-and-traditional-chinese-medicine\/#breadcrumb"},"inLanguage":"en-US","potentialAction":[{"@type":"ReadAction","target":["https:\/\/tintyoga.com\/magazine\/yoga-and-traditional-chinese-medicine\/"]}]},{"@type":"BreadcrumbList","@id":"https:\/\/tintyoga.com\/magazine\/yoga-and-traditional-chinese-medicine\/#breadcrumb","itemListElement":[{"@type":"ListItem","position":1,"name":"Home","item":"https:\/\/tintyoga.com\/"},{"@type":"ListItem","position":2,"name":"Traditional Chinese Medicine: A Holistic Practice that Yoga Can Complement"}]},{"@type":"WebSite","@id":"https:\/\/tintyoga.com\/#website","url":"https:\/\/tintyoga.com\/","name":"TINT Yoga","description":"TINT Yoga offers premium online yoga classes with the world&#039;s most popular yoga and movement instructors. Learn and work out with our online yoga videos.","publisher":{"@id":"https:\/\/tintyoga.com\/#organization"},"potentialAction":[{"@type":"SearchAction","target":{"@type":"EntryPoint","urlTemplate":"https:\/\/tintyoga.com\/?s={search_term_string}"},"query-input":"required name=search_term_string"}],"inLanguage":"en-US"},{"@type":"Organization","@id":"https:\/\/tintyoga.com\/#organization","name":"TINT Yoga","url":"https:\/\/tintyoga.com\/","logo":{"@type":"ImageObject","inLanguage":"en-US","@id":"https:\/\/tintyoga.com\/#\/schema\/logo\/image\/","url":"https:\/\/tintyoga.com\/wp-content\/uploads\/2021\/08\/logo_color_black.png","contentUrl":"https:\/\/tintyoga.com\/wp-content\/uploads\/2021\/08\/logo_color_black.png","width":1001,"height":301,"caption":"TINT Yoga"},"image":{"@id":"https:\/\/tintyoga.com\/#\/schema\/logo\/image\/"},"sameAs":["https:\/\/www.instagram.com\/tint_yoga\/","https:\/\/de.linkedin.com\/company\/tint-gmbh","https:\/\/www.pinterest.de\/tintyoga\/","https:\/\/www.youtube.com\/channel\/UC2HjTe0TL20qSk8e3s1d0DA","https:\/\/www.facebook.com\/tintyoga\/"]},{"@type":"Person","@id":"https:\/\/tintyoga.com\/#\/schema\/person\/581877dfb2f1e012aa8f2a2a39a44c3b","name":"doreen","image":{"@type":"ImageObject","inLanguage":"en-US","@id":"https:\/\/tintyoga.com\/#\/schema\/person\/image\/","url":"https:\/\/secure.gravatar.com\/avatar\/5ac132c6e49e85e81542f95a7a9e124e?s=96&d=mm&r=g","contentUrl":"https:\/\/secure.gravatar.com\/avatar\/5ac132c6e49e85e81542f95a7a9e124e?s=96&d=mm&r=g","caption":"doreen"},"url":"https:\/\/tintyoga.com\/magazine\/author\/doreen\/"}]}},"acf":[],"_links":{"self":[{"href":"https:\/\/tintyoga.com\/wp-json\/wp\/v2\/posts\/153455"}],"collection":[{"href":"https:\/\/tintyoga.com\/wp-json\/wp\/v2\/posts"}],"about":[{"href":"https:\/\/tintyoga.com\/wp-json\/wp\/v2\/types\/post"}],"author":[{"embeddable":true,"href":"https:\/\/tintyoga.com\/wp-json\/wp\/v2\/users\/6"}],"replies":[{"embeddable":true,"href":"https:\/\/tintyoga.com\/wp-json\/wp\/v2\/comments?post=153455"}],"version-history":[{"count":11,"href":"https:\/\/tintyoga.com\/wp-json\/wp\/v2\/posts\/153455\/revisions"}],"predecessor-version":[{"id":158664,"href":"https:\/\/tintyoga.com\/wp-json\/wp\/v2\/posts\/153455\/revisions\/158664"}],"wp:featuredmedia":[{"embeddable":true,"href":"https:\/\/tintyoga.com\/wp-json\/wp\/v2\/media\/153731"}],"wp:attachment":[{"href":"https:\/\/tintyoga.com\/wp-json\/wp\/v2\/media?parent=153455"}],"wp:term":[{"taxonomy":"category","embeddable":true,"href":"https:\/\/tintyoga.com\/wp-json\/wp\/v2\/categories?post=153455"},{"taxonomy":"post_tag","embeddable":true,"href":"https:\/\/tintyoga.com\/wp-json\/wp\/v2\/tags?post=153455"}],"curies":[{"name":"wp","href":"https:\/\/api.w.org\/{rel}","templated":true}]}}