{"id":153720,"date":"2021-10-13T15:13:25","date_gmt":"2021-10-13T14:13:25","guid":{"rendered":"https:\/\/tintyoga.com\/?p=153720"},"modified":"2022-08-16T16:50:37","modified_gmt":"2022-08-16T15:50:37","slug":"tint-vision","status":"publish","type":"post","link":"https:\/\/tintyoga.com\/magazine\/tint-vision\/","title":{"rendered":"Behind the Scenes of TINT – Revolutionizing Online Yoga"},"content":{"rendered":"\n<p class=\"intro-text\">Have you ever wondered what lies beneath your favorite online yoga platform (😉)? So, let us tell the story behind TINT – who we are and what we stand for.<\/p>\n\n\n\n<div class=\"toc-wrapper\">\n<p>Table of Contents<\/p>\n\n<ul class=\"fa-ul toc-list\">\n  <li>\n  <span class=\"fa-li\"><i class=\"fa fa-long-arrow-right\"><\/i><\/span>\n  <a href=\"#1\">1. Introduction – What is TINT<\/a><\/li>\n  <li>\n  <span class=\"fa-li\"><i class=\"fa fa-long-arrow-right\"><\/i><\/span>\n  <a href=\"#2\">2. Our Vision – Why We Founded TINT<\/a><\/li>\n  <li>\n  <span class=\"fa-li\"><i class=\"fa fa-long-arrow-right\"><\/i><\/span>\n  <a href=\"#3\">3. Our Mission – How We Want to Support You<\/a><\/li>\n  <li>\n  <span class=\"fa-li\"><i class=\"fa fa-long-arrow-right\"><\/i><\/span>\n  <a href=\"#4\">4. Our Offer – What We Do For You<\/a><\/li>\n \n<\/ul>\n<\/div>\n\n\n\n<div class=\"video-wrapper\">\n<div class=\"video-wrapper-inner\">\n\n<!-- YOUTUBE VIDEO GOES HERE -->\n<iframe width=\"560\" height=\"315\" src=\"https:\/\/www.youtube.com\/embed\/Ahhb8QK9CCc\" frameborder=\"0\" allow=\"accelerometer; autoplay; encrypted-media; gyroscope; picture-in-picture\" allowfullscreen=\"\"><\/iframe>\n\n<!-- CAPTION -->\n<p class=\"caption\">This is TINT – Learn from the best.<\/p>\n\n<\/div>\n<\/div>\n\n\n\n<h1 id=\"1\">1. Introduction – What Is TINT?<\/h1>\n\n\n\n<p>TINT Yoga is an online education and coaching platform for ambitious yogis, yoga lovers, and yoga teachers. However, we are not a usual yoga platform. We question traditional yoga. We embrace evolution and have the courage to be different. We want to lead by positive example and encourage you to do the same.<\/p>\n\n\n\n<p>Read on to find out more about our vision, mission and offers. But let’s start with some basic facts about TINT.<\/p>\n\n\n\n<h2>1.1. Bringing Meaning Into Our Logo&nbsp;<\/h2>\n\n\n\n<h3>The Acronym TINT<\/h3>\n\n\n\n<p>Our logo is composed of two elements: first TINT, the name of the company. This acronym stands for “There is no try”. This is an attitude related to doing things with passion, awareness and without excuse or exception. Don’t just <em>try<\/em>. <em>Do<\/em>.&nbsp;<\/p>\n\n\n\n<p>It’s not a secret that we only live once. But have you ever really thought about what this means? Everything you do has an impact. And every second of your life, you have the opportunity to have an impact. Do or do not. There is no in between. Always do what’s in your power and put all your heart into it. Don’t let limits hold you back. Don’t overthink, take action instead. Don’t let the world hold you back. Trust in yourself and do. That’s the reason why we don’t offer a free trial. We encourage you to go all in and commit wholeheartedly to your personal growth.<\/p>\n\n\n\n<h3>The Gömböc<\/h3>\n\n\n\n<p>The second element is the so-called <a href=\"https:\/\/en.wikipedia.org\/wiki\/G%C3%B6mb%C3%B6c\" target=\"_blank\" rel=\"noreferrer noopener\">Gömböc<\/a>. This is a convex three-dimensional homogeneous body that, when resting on a flat surface, has just one stable and one unstable point of equilibrium. As such, it is a symbol for stability and balance. It is an object that can return to an equilibrium point regardless of the position in which it is placed.&nbsp;<\/p>\n\n\n\n<p>Consider this a metaphor for your own behavior: Don’t let the circumstances around you throw you out of balance. When you know your purpose, your values, and your goals, you will always find your true north and stay on the straight and narrow.&nbsp;<\/p>\n\n\n\n<!-- IMAGE 16:9 -->\n<div class=\"image-wrapper\">\n<div class=\"individual\">\n  <div>\n   <img decoding=\"async\" src=\"https:\/\/tintyoga.com\/wp-content\/uploads\/2021\/10\/logo_color_black.png\" width=\"500\">\n  <\/div>\n<\/div>\n\n<!-- CAPTION -->\n<p class=\"caption\">Our logo: TINT and the Gömböc.<\/p>\n<\/div>\n\n\n\n<h2>1.2. Our 4 Pillars: Knowledge, Personality, Inspiration, Success<\/h2>\n\n\n\n<p>We want to be more than just an online yoga provider for you. We give you the tools you need to find happiness and fulfillment. We base our offerings on these 4 pillars:&nbsp;<\/p>\n\n\n\n<h3>Knowledge&nbsp;<\/h3>\n\n\n\n<p>All our contents are based on the most recent findings in anatomy and physiology and are presented by highly skilled instructors with many years of experience. Most of them are pioneers in their special field and have already inspired thousands of students and aspiring yoga teachers.&nbsp;<\/p>\n\n\n\n<h3>Personality&nbsp;<\/h3>\n\n\n\n<p>We provide you with all the tools and knowledge you need to grow not only your physical strength but also to work on your mental strengths to become the person you want to be.&nbsp;<\/p>\n\n\n\n<h3>Inspiration&nbsp;<\/h3>\n\n\n\n<p>Get inspired by valuable input from our instructors, who can draw upon their many years of experience as teachers of teachers.<\/p>\n\n\n\n<h3>Success<\/h3>\n\n\n\n<p>We help you find and execute the right strategy to live the life you’ve always dreamed of. Maybe you want to bring more awareness into your life or take your yoga practice to the next level. Maybe you want to work on your mental strength. Or you even aspire to become a yoga teacher yourself. No matter what it is, we want to give you the tools you need to fulfill your dreams.&nbsp;<\/p>\n\n\n\n<!-- IMAGE 16:9 -->\n<div class=\"image-wrapper\">\n<div class=\"individual\">\n  <div>\n   <img decoding=\"async\" src=\"https:\/\/tintyoga.com\/wp-content\/uploads\/2021\/10\/TINT-Topic-Circle-Reduced.webp\">\n  <\/div>\n<\/div>\n\n<!-- CAPTION -->\n<p class=\"caption\">Our 4 pillars: knowledge, personality, inspiration, success.<\/i><\/p>\n<\/div>\n\n\n\n<h2 id=\"2\">2. Our Vision – Why We Founded TINT<\/h2>\n\n\n\n<p>We are passionate about helping people to achieve personal fulfillment to find happiness. We truly believe that we are responsible for our happiness and can take action to induce change. Yoga is a great tool to achieve fulfillment as it deeply connects body and mind in a way no other movement form does.<\/p>\n\n\n\n<p>More than 200 million people practice yoga worldwide – and due to recent global developments, online yoga has gained increasing public awareness and is practiced more and more frequently.<\/p>\n\n\n\n<p>This is predominantly a good thing as it makes yoga accessible to people who do not have an (affordable) yoga studio close to them or cannot find their favorite style of yoga or yoga teacher nearby.&nbsp;<\/p>\n\n\n\n<p>However, yoga is more than just a trend and a good stretch. When practiced correctly, it is a great tool to work on your mobility, flexibility, and stability. It also helps you to improve your body awareness and body intelligence.&nbsp;<\/p>\n\n\n\n<p>Furthermore, yoga is also a mental practice, helping you to develop a healthier mindset, train your resilience, and practice mindfulness, which will organically translate into your life off the mat.&nbsp;<\/p>\n\n\n\n<p>Like no other movement form, yoga is a holistic body-and-mind practice that has many benefits for your physical and mental health.&nbsp;<\/p>\n\n\n\n<p>However, if practiced incorrectly – maybe due to an insufficiently trained teacher – you can also harm your body. Especially inexperienced yoga practitioners tend to overestimate the limits of their bodies (or haven’t detected them yet!) and push themselves harder into poses than would do them good. And all that because they received inadequate guidance from an (online) yoga teacher or because they tried to equal the oh so gorgeous yoga teachers on Social Media.&nbsp;<\/p>\n\n\n\n<p>With the vast offer of online yoga classes, it’s difficult to separate the wheat from the chaff, i.e. to find high-quality content that is healthy, safe, and efficient.&nbsp;<\/p>\n\n\n\n<p>This is where TINT comes into play: It is our passion to support people to find personal fulfillment and success. This is only possible with a strong commitment. And that’s what our brand name stands for: TINT – there is no try.<\/p>\n\n\n\n<p>Furthermore, we partner with highly skilled professionals with years of experience as yoga teachers and teachers of teachers in order to ensure a safe and efficient online yoga practice.&nbsp;<\/p>\n\n\n\n<p>We want to support you on your journey to personal fulfillment and success. We see ourselves as a true partner and coach. We are more than just an online yoga platform with on-demand yoga video content. We want you to grow, develop, and achieve your goals. Our offers are aimed at ambitious yoga lovers and yoga teachers, who are willing to face change and growth.&nbsp;<\/p>\n\n\n\n<p>Yes, we are not for beginners. We are for ambitious yoga lovers and yoga teachers who live these values to the fullest.<\/p>\n\n\n\n<p><\/p>\n\n\n\n<h1 id=\"3\">3. Our Mission – How We Want to Support You<\/h1>\n\n\n\n<div class=\"quote-wrapper\">\n<p class=\"quote\">&#8220;We enable ambitious yoga lovers to achieve personal fulfillment and success no matter where you are. We act as a true partner and coach on your journey to sustainable growth while creating lasting memories along your way. We don’t try. We stand out. We do. There is no try.&#8221;<\/p>\n<p class=\"quote-author\">– TINT.<\/p>\n<\/div>\n\n\n\n<p>We are more than just a content provider. We help and support you by giving you the tools you need. We deliver knowledge, inspiration, and feedback. We make things possible.<\/p>\n\n\n\n<h2>3.1. For Ambitious Yoga Lovers<\/h2>\n\n\n\n<p>In contrast to other online yoga providers, we focus on committed yoga practitioners who want to evolve and thrive and are constantly seeking to improve their knowledge and skills. If you want to live your passion for yoga and are convinced that yoga is a powerful tool to better understand the body and mind, you’ve come to the right place.&nbsp;<\/p>\n\n\n\n<p>Yes, this means that we are not for beginners. On the one hand, because beginners are in the safest possible hands in an in-person class with an experienced yoga teacher who can actually touch and adjust them adequately.<\/p>\n\n\n\n<p>On the other hand, we believe that at least some basic knowledge and experience is required in order to move further. You need a solid foundation to build your dream house. The same goes for yoga (or any other practice).<\/p>\n\n\n\n<h2>3.2. Achieve Personal Fulfillment and Success<\/h2>\n\n\n\n<p>TINT is the place to live your passion: If your purpose of life is to bring joy and happiness to others, then yoga is a great vehicle to achieve this. Like no other movement practice, yoga combines physical and mental practices, making it a holistic approach to a healthier body and mind.<\/p>\n\n\n\n<p>Apart from that, if you are or want to become a yoga teacher, this practice is a great way to have an impact on other people’s lives and receive recognition by supporting others to thrive. You will feel valued, receive appreciation and appreciate yourself on a deeper level. Yoga can help you become the person you want to be and we want to support you with this as best as we can.&nbsp;<\/p>\n\n\n\n<p>And if you’ve always dreamed of earning a living with yoga, we help you find and execute the right strategy to achieve exactly this. We provide you the tools and knowledge, and boost your self-esteem and courage so that you can stand out and live to your full potential.<\/p>\n\n\n\n<h2>3.3. Your True Partner and Coach – Wherever You Are<\/h2>\n\n\n\n<p>We want to be more for you than just an online yoga platform. We believe in mutual long-term commitment that is based on a relationship of trust. Our commitment towards you: We are there for you. We listen to your needs, fears, and doubts. We motivate and inspire you.&nbsp;<\/p>\n\n\n\n<p>Your commitment towards us: Your whole heart, passion, and sincerity. That’s the reason why we don’t offer a free trial period (remember: There is no try.). We don’t want to entice you with seductive promotion offers or huge no-brainer discounts. We want you to make a conscious decision to invest energy, time and – yes – also money in yourself.&nbsp;<\/p>\n\n\n\n<p>But don’t worry: Should you find out that TINT really isn’t for you (what we don’t hope but – hey – you can’t be everybody’s darling), we offer a 30-day money-back guarantee. You can simply send a message to our <a href=\"https:\/\/tintyoga.com\/help\">Support Team<\/a> (who, by the way, is always willing to help you with any other issues as well!) and we will refund the money. No questions asked. Promised. Just make sure it’s within the 30 days from your subscription date.&nbsp;<\/p>\n\n\n\n<p>We also believe in growth through honest and constructive feedback – on both sides. That’s why we have implemented a <a href=\"https:\/\/feedback.tintyoga.com\/\">Feedback Portal<\/a> where you can tell us what you need, what you don’t like, and what your pain points are.&nbsp;<\/p>\n\n\n\n<p>We also want to make high-quality yoga content and education accessible to everybody and every body. We want to offer you an easily accessible and flexible learning and training experience where place and time no longer are a restriction.&nbsp;<\/p>\n\n\n\n<p>With TINT, you can enjoy exclusive yoga and inspirational content and connect with like-minded people – irrespective of your current personal living conditions. That makes online yoga such a powerful tool nowadays. And with our smartphone and smartTV apps, you can even access TINT on the go and download your favorite contents to use in times where you don’t have an internet connection.<\/p>\n\n\n\n<h2>3.4. Your Journey to Sustainable Growth<\/h2>\n\n\n\n<p>TINT is the place for people who are ready to face the challenges of a real journey towards success and fulfillment. Single events won’t make a change. The road to happiness is not straight. It’s a roller-coaster. We are at your side through all the ups and downs.<\/p>\n\n\n\n<p>Sustainable growth means repeatable and healthy development that is responsible to, and for, current and future communities. It’s the key to long-term success, happiness and fulfilment.<\/p>\n\n\n\n<p>We believe in healthy and lasting improvements and want to help you produce long-term effects. This is why our minimum membership is 3 months. It took, for example, 29 years until <a href=\"https:\/\/en.wikipedia.org\/wiki\/Alexander_Graham_Bell\">Alexander Graham Bell<\/a> invented the telephone and he filed more than <a href=\"https:\/\/www.history.com\/news\/10-things-you-may-not-know-about-alexander-graham-bell\">600 lawsuits<\/a> over his telephone patent. Growth won’t happen overnight. With this minimum commitment, you lay the foundation for your long-term growth and development.&nbsp;<\/p>\n\n\n\n<p><\/p>\n\n\n\n<h1 id=\"4\">4. Our Offer – What We Do for You<\/h1>\n\n\n\n<p>Our offer comprises two main products: our TINT Membership with new content every day, including single classes to practice, series to learn and increase your knowledge, and inspirational videos.&nbsp;<\/p>\n\n\n\n<p>The second part is our TINT Academy with certified yoga teacher trainings, varying from full 200-hour yoga teacher trainings to Inside Flow teacher trainings and more.<\/p>\n\n\n\n<p>Plus, our contents are easily accessible since you can watch them online via your browser, or use our smartphone and smartTV apps where you can even download your favorite content pieces and watch them without an Internet connection.&nbsp;<\/p>\n\n\n\n<p>The global yoga market is huge but we are committed to a clear vision and direction and, thus, found our niche. We are ready to revolutionize yoga training and education with a modern approach and a holistic content strategy.&nbsp;<\/p>\n\n\n\n<h2>4.1. TINT Academy – Learn From the Best<\/h2>\n\n\n\n<p>With <a href=\"https:\/\/tintyoga.com\/academy\/\">TINT Academy<\/a>, you can learn from the most successful and knowledgeable yoga teachers in the world. We want to make their know-how available to you – no matter where you are. What better way is there to learn from them than doing a teacher training?<\/p>\n\n\n\n<p>On TINT, you can, for example, become a certified yoga teacher by joining our comprehensive <a href=\"https:\/\/tintyoga.com\/200-hour-online-teacher-training\/\">200-Hour Online Yoga Teacher Training<\/a>. Or you can become an <a href=\"https:\/\/tintyoga.com\/inside-flow-academy\/\">Inside Flow Teacher<\/a> or even an <a href=\"https:\/\/tintyoga.com\/inside-flow-junior\/\">Inside Flow Junior Teacher<\/a>.<\/p>\n\n\n\n<p>Attending a teacher training online saves you a lot of travel time and expenses. Plus, you can join teachers that would otherwise simply not be available to you, such as <a href=\"https:\/\/tintyoga.com\/instructors\/young-ho-kim\/\">Young Ho Kim<\/a>, <a href=\"https:\/\/tintyoga.com\/instructors\/barbra-noh\/\">Barbra Noh<\/a>, or <a href=\"https:\/\/tintyoga.com\/instructors\/desi-springer-john-friend\/\">John Friend and Desi Springer<\/a>.&nbsp;<\/p>\n\n\n\n<p>Upon successful completion of any training, your efforts will be rewarded. All passed online exams are accompanied by a personalized certificate just for you. This way, you can show yourself and others what you achieved, increase your credibility, and open new business opportunities.&nbsp;<\/p>\n\n\n\n<p>And one thing is for sure: The exam isn’t easy. Your certificate stands for itself.<\/p>\n\n\n\n<!-- IMAGE 16:9 -->\n<div class=\"image-wrapper\">\n<div class=\"aspectratio\" data-ratio=\"16:9\" position=\"bottom\">\n  <div>\n   <a href=\"https:\/\/tintyoga.com\/200-hour-online-teacher-training\/\"><img decoding=\"async\" src=\"https:\/\/tintyoga.com\/wp-content\/uploads\/2021\/04\/Thumbnails-Academy-Young-Ho-Kim-1-1.jpg\"><\/a>\n  <\/div>\n<\/div>\n\n<!-- CAPTION -->\n<p class=\"caption\">With TINT Academy, you can become a certified yoga teacher – online.<\/p>\n<\/div>\n\n\n\n<h2>4.2. Yoga Series – Deepen Your Yoga Practice<\/h2>\n\n\n\n<p>Our online yoga series are a set of pre-recorded on-demand videos that each focus on a specific topic, yoga style, or goal. They are like a workshop or training plan that you can attend from your home and according to your own timing and schedule.&nbsp;<\/p>\n\n\n\n<p>This gives you the opportunity to dive deeper into specific topics, expand your knowledge and experience, or build a regular practice routine.<\/p>\n\n\n\n<p>All our TINT Instructors have built their skills on years of experience as yoga teachers and teachers of teachers. They are pioneers in their fields and share the same values as&nbsp; our founder <a href=\"https:\/\/tintyoga.com\/instructors\/young-ho-kim\/\">Young Ho Kim<\/a>.<\/p>\n\n\n\n<p>We are the only online platform, for example, that offers various <a href=\"https:\/\/watch.tintyoga.com\/categories\/inside-flow\">Inside Flow<\/a> series like <a href=\"https:\/\/watch.tintyoga.com\/programs\/power-of-inside-flow?categoryId=11239\">The Power of Inside Flow<\/a> or the <a href=\"https:\/\/watch.tintyoga.com\/programs\/inside-flow-summer-challenge?categoryId=11239\">Inside Flow Summer Challenge 2021<\/a>.<\/p>\n\n\n\n<p>You can also try out other unique yoga styles such as<a href=\"https:\/\/watch.tintyoga.com\/categories\/bowspring\"> Bowspring Yoga<\/a> presented by the founders <a href=\"https:\/\/tintyoga.com\/instructors\/desi-springer-john-friend\/\">Desi Springer and John Friend<\/a>, or try the brand-new style <a href=\"https:\/\/watch.tintyoga.com\/programs\/mymoves-360?categoryId=75445\">MYMOVES<\/a> with the founder <a href=\"https:\/\/tintyoga.com\/instructors\/alexey-gaevskij\/\">Alexey Gaevskij<\/a>. <\/p>\n\n\n\n<p>Other series, like the <a href=\"https:\/\/watch.tintyoga.com\/programs\/7-day-vinyasa-challenge?categoryId=75445\">7-Day Vinyasa Challenge<\/a> by <a href=\"https:\/\/tintyoga.com\/instructors\/hie-kim\/\">Hie Kim<\/a> or <a href=\"https:\/\/watch.tintyoga.com\/programs\/find-your-flow?categoryId=75446\">Find Your Flow<\/a> by <a href=\"https:\/\/tintyoga.com\/instructors\/ami-norton\/\">Ami Norton<\/a>, help you build your own regular yoga routine.&nbsp;<\/p>\n\n\n\n<p>TINT even helps you to deepen your understanding of yoga alignment and anatomy in series like <a href=\"https:\/\/tintyoga.com\/instructors\/barbra-noh\/\">Barbra Noh<\/a>’s <a href=\"https:\/\/watch.tintyoga.com\/programs\/therapeutic-alignment-immersion\">Therapeutic Alignment Immersion<\/a> or Young Ho Kim’s <a href=\"https:\/\/watch.tintyoga.com\/programs\/inside-yoga-alignment?categoryId=75446\">Inside Yoga Alignment<\/a>.&nbsp;<\/p>\n\n\n\n<p>So, no matter what you’re longing for or what you’re interested in, chances are high that you find something that suits you on TINT. If not, reach out to our <a href=\"https:\/\/tintyoga.com\/help\">Support Team<\/a>, who is happy to help you.&nbsp;&nbsp;<\/p>\n\n\n\n<!-- GALLERY 2x2 -->\n<div class=\"grid-wrapper\">\n<div class=\"grid-2x2-container\">\n\n<!-- Image 1 -->\n<div class=\"aspectratio\" data-ratio=\"16:9\"><div>\n<a href=\"https:\/\/watch.tintyoga.com\/programs\/find-your-flow?categoryId=75446\"><img decoding=\"async\" position=\"bottom\" src=\"https:\/\/tintyoga.com\/wp-content\/uploads\/2021\/07\/Thumbnails-Ami-Norton.jpg\"><\/a>\n<\/div><\/div>\n\n<!-- Image 2 -->\n<div class=\"aspectratio\" data-ratio=\"16:9\"><div>\n<a href=\"https:\/\/watch.tintyoga.com\/programs\/7-day-vinyasa-challenge?categoryId=75445\"><img decoding=\"async\" position=\"left\" src=\"https:\/\/tintyoga.com\/wp-content\/uploads\/2021\/06\/Thumbnails-Hie-Kim.jpg\"><\/a>\n<\/div><\/div>\n\n<!-- Image 3 -->\n<div class=\"aspectratio\" data-ratio=\"16:9\"><div>\n<a href=\"https:\/\/watch.tintyoga.com\/programs\/mymoves-360?categoryId=75445\"><img decoding=\"async\" position=\"top\" src=\"https:\/\/tintyoga.com\/wp-content\/uploads\/2021\/05\/Thumbnails-Alexey-Gaevskij.jpg\"><\/a>\n<\/div><\/div>\n\n<!-- Image 4 -->\n<div class=\"aspectratio\" data-ratio=\"16:9\"><div>\n<a href=\"https:\/\/watch.tintyoga.com\/programs\/power-of-inside-flow?categoryId=75445\"><img decoding=\"async\" position=\"left\" src=\"https:\/\/tintyoga.com\/wp-content\/uploads\/2021\/01\/Thumbnails-Young-Ho-Kim.jpg\"><\/a>\n<\/div><\/div>\n\n<\/div>\n\n<!-- CAPTION -->\n<p class=\"caption\">On TINT, you&#8217;ll definitely find something you like.<\/p>\n<\/div>\n\n\n\n<h2>4.3. Regular Livestreams – a New Focus Every Month<\/h2>\n\n\n\n<p>Our regular weekly <a href=\"https:\/\/watch.tintyoga.com\/pages\/live\">livestreams<\/a> are another important milestone on your way to sustainable growth and to achieve new goals. However, our livestreams are not just random online yoga practices. All our live classes have a specific focus that changes every month. This means, for an entire month, we will work on a particular topic together for an entire month to achieve one dedicated goal. This can be, for example, a teaching-related topic such as sequencing, or a more practice-oriented theme like our <a href=\"https:\/\/watch.tintyoga.com\/programs\/inside-flow-summer-challenge\">Inside Flow Summer Challenge 2021<\/a>.&nbsp;<\/p>\n\n\n\n<!-- IMAGE 16:9 -->\n<div class=\"image-wrapper\">\n<div class=\"aspectratio\" data-ratio=\"16:9\" position=\"bottom\">\n  <div>\n  <a href=\"https:\/\/watch.tintyoga.com\/pages\/live\"><img decoding=\"async\" src=\"https:\/\/tintyoga.com\/wp-content\/uploads\/2021\/10\/tint_magazine_Focus-Topic.jpeg\"><\/a>\n  <\/div>\n<\/div>\n\n<!-- CAPTION -->\n<p class=\"caption\">In our weekly livestreams, we focus on one specific topic for one month.<\/p>\n<\/div>\n\n\n\n<h2>4.4. Special Events – Creating Lasting Memories<\/h2>\n\n\n\n<p>We organize a special online event to interact with our community, connect people and celebrate their achievements. These events are one valuable piece in the puzzle of success and growth – emotions guaranteed! <\/p>\n\n\n\n<p>Our Special Events can be a themed mini-retreat, a dedicated workshop, or even an online yoga festival, which will be live and online. It will also be more interactive than our regular livestreams to better connect with you and create lasting memories.<\/p>\n\n\n\n<p>This is our way to interact with our community, connect people and celebrate their achievements. On TINT, you are not just one among many. We make your milestones count. Our community events create emotions and lasting memories.<\/p>\n\n\n\n<p>We hope you got a better understanding of who we are, what our vision and mission is, and what we stand for. Maybe that even inspired you to define your own vision or draw a clearer picture of who you want to be. If so, well… we already achieved one part of our mission.<\/p>\n","protected":false},"excerpt":{"rendered":"<p>Have you ever wondered what lies beneath your favorite online yoga platform (😉)? So, let us tell the story behind TINT – who we are and what we stand for.<\/p>\n","protected":false},"author":6,"featured_media":156491,"comment_status":"closed","ping_status":"closed","sticky":false,"template":"","format":"standard","meta":{"_et_pb_use_builder":"off","_et_pb_old_content":"<!-- wp:paragraph {\"className\":\"intro-text\"} -->\n<p class=\"intro-text\">Have you ever wondered what lies beneath your favorite online yoga platform (😉)? So, let us tell the story behind TINT – who we are and what we stand for.<\/p>\n<!-- \/wp:paragraph -->\n\n<!-- wp:html -->\n<div class=\"toc-wrapper\">\n<p>Table of Contents<\/p>\n\n<ul class=\"fa-ul toc-list\">\n  <li>[toc-icon]<a href=\"#1\">1. Introduction – What is TINT<\/a><\/li>\n  <li>[toc-icon]<a href=\"#2\">2. Our Vision – Why We Founded TINT<\/a><\/li>\n  <li>[toc-icon]<a href=\"#3\">3. Our Mission – How We Want to Support You<\/a><\/li>\n  <li>[toc-icon]<a href=\"#4\">4. Our Offer – What We Do For You<\/a><\/li>\n \n<\/ul>\n<\/div>\n<!-- \/wp:html -->\n\n<!-- wp:html -->\n<div class=\"video-wrapper\">\n<div class=\"video-wrapper-inner\">\n\n<!-- YOUTUBE VIDEO GOES HERE -->\n<iframe width=\"560\" height=\"315\" src=\"https:\/\/www.youtube.com\/embed\/Ahhb8QK9CCc\" frameborder=\"0\" allow=\"accelerometer; autoplay; encrypted-media; gyroscope; picture-in-picture\" allowfullscreen=\"\"><\/iframe>\n\n<!-- CAPTION -->\n<p class=\"caption\">This is TINT – Learn from the best.<\/p>\n\n<\/div>\n<\/div>\n<!-- \/wp:html -->\n\n<!-- wp:heading {\"level\":1} -->\n<h1 id=\"1\">1. Introduction – What Is TINT?<\/h1>\n<!-- \/wp:heading -->\n\n<!-- wp:paragraph -->\n<p>TINT Yoga is an online education and coaching platform for ambitious yogis, yoga lovers, and yoga teachers. However, we are not a usual yoga platform. We question traditional yoga. We embrace evolution and have the courage to be different. We want to lead by positive example and encourage you to do the same.<\/p>\n<!-- \/wp:paragraph -->\n\n<!-- wp:paragraph -->\n<p>Read on to find out more about our vision, mission and offers. But let’s start with some basic facts about TINT.<\/p>\n<!-- \/wp:paragraph -->\n\n<!-- wp:heading -->\n<h2>1.1. Bringing Meaning Into Our Logo&nbsp;<\/h2>\n<!-- \/wp:heading -->\n\n<!-- wp:heading {\"level\":3} -->\n<h3>The Acronym TINT<\/h3>\n<!-- \/wp:heading -->\n\n<!-- wp:paragraph -->\n<p>Our logo is composed of two elements: first TINT, the name of the company. This acronym stands for “There is no try”. This is an attitude related to doing things with passion, awareness and without excuse or exception. Don’t just <em>try<\/em>. <em>Do<\/em>.&nbsp;<\/p>\n<!-- \/wp:paragraph -->\n\n<!-- wp:paragraph -->\n<p>It’s not a secret that we only live once. But have you ever really thought about what this means? Everything you do has an impact. And every second of your life, you have the opportunity to have an impact. Do or do not. There is no in between. Always do what’s in your power and put all your heart into it. Don’t let limits hold you back. Don’t overthink, take action instead. Don’t let the world hold you back. Trust in yourself and do. That’s the reason why we don’t offer a free trial. We encourage you to go all in and commit wholeheartedly to your personal growth.<\/p>\n<!-- \/wp:paragraph -->\n\n<!-- wp:heading {\"level\":3} -->\n<h3>The Gömböc<\/h3>\n<!-- \/wp:heading -->\n\n<!-- wp:paragraph -->\n<p>The second element is the so-called <a href=\"https:\/\/en.wikipedia.org\/wiki\/G%C3%B6mb%C3%B6c\" target=\"_blank\" rel=\"noreferrer noopener\">Gömböc<\/a>. This is a convex three-dimensional homogeneous body that, when resting on a flat surface, has just one stable and one unstable point of equilibrium. As such, it is a symbol for stability and balance. It is an object that can return to an equilibrium point regardless of the position in which it is placed.&nbsp;<\/p>\n<!-- \/wp:paragraph -->\n\n<!-- wp:paragraph -->\n<p>Consider this a metaphor for your own behavior: Don’t let the circumstances around you throw you out of balance. When you know your purpose, your values, and your goals, you will always find your true north and stay on the straight and narrow.&nbsp;<\/p>\n<!-- \/wp:paragraph -->\n\n<!-- wp:html -->\n<!-- IMAGE 16:9 -->\n<div class=\"image-wrapper\">\n<div class=\"individual\">\n  <div>\n   <img src=\"https:\/\/tintyoga.com\/wp-content\/uploads\/2021\/10\/logo_color_black.png\" width=\"500\">\n  <\/div>\n<\/div>\n\n<!-- CAPTION -->\n<p class=\"caption\">Our logo: TINT and the Gömböc.<\/p>\n<\/div>\n<!-- \/wp:html -->\n\n<!-- wp:heading -->\n<h2>1.2. Our 4 Pillars: Knowledge, Personality, Inspiration, Success<\/h2>\n<!-- \/wp:heading -->\n\n<!-- wp:paragraph -->\n<p>We want to be more than just an online yoga provider for you. We give you the tools you need to find happiness and fulfillment. We base our offerings on these 4 pillars:&nbsp;<\/p>\n<!-- \/wp:paragraph -->\n\n<!-- wp:heading {\"level\":3} -->\n<h3>Knowledge&nbsp;<\/h3>\n<!-- \/wp:heading -->\n\n<!-- wp:paragraph -->\n<p>All our contents are based on the most recent findings in anatomy and physiology and are presented by highly skilled instructors with many years of experience. Most of them are pioneers in their special field and have already inspired thousands of students and aspiring yoga teachers.&nbsp;<\/p>\n<!-- \/wp:paragraph -->\n\n<!-- wp:heading {\"level\":3} -->\n<h3>Personality&nbsp;<\/h3>\n<!-- \/wp:heading -->\n\n<!-- wp:paragraph -->\n<p>We provide you with all the tools and knowledge you need to grow not only your physical strength but also to work on your mental strengths to become the person you want to be.&nbsp;<\/p>\n<!-- \/wp:paragraph -->\n\n<!-- wp:heading {\"level\":3} -->\n<h3>Inspiration&nbsp;<\/h3>\n<!-- \/wp:heading -->\n\n<!-- wp:paragraph -->\n<p>Get inspired by valuable input from our instructors, who can draw upon their many years of experience as teachers of teachers.<\/p>\n<!-- \/wp:paragraph -->\n\n<!-- wp:heading {\"level\":3} -->\n<h3>Success<\/h3>\n<!-- \/wp:heading -->\n\n<!-- wp:paragraph -->\n<p>We help you find and execute the right strategy to live the life you’ve always dreamed of. Maybe you want to bring more awareness into your life or take your yoga practice to the next level. Maybe you want to work on your mental strength. Or you even aspire to become a yoga teacher yourself. No matter what it is, we want to give you the tools you need to fulfill your dreams.&nbsp;<\/p>\n<!-- \/wp:paragraph -->\n\n<!-- wp:html -->\n<!-- IMAGE 16:9 -->\n<div class=\"image-wrapper\">\n<div class=\"individual\">\n  <div>\n   <img src=\"https:\/\/tintyoga.com\/wp-content\/uploads\/2021\/10\/TINT-Topic-Circle-Reduced.webp\">\n  <\/div>\n<\/div>\n\n<!-- CAPTION -->\n<p class=\"caption\">Our 4 pillars: knowledge, personality, inspiration, success.<\/i><\/p>\n<\/div>\n<!-- \/wp:html -->\n\n<!-- wp:heading -->\n<h2 id=\"2\">2. Our Vision – Why We Founded TINT<\/h2>\n<!-- \/wp:heading -->\n\n<!-- wp:paragraph -->\n<p>We are passionate about helping people to achieve personal fulfillment to find happiness. We truly believe that we are responsible for our happiness and can take action to induce change. Yoga is a great tool to achieve fulfillment as it deeply connects body and mind in a way no other movement form does.<\/p>\n<!-- \/wp:paragraph -->\n\n<!-- wp:paragraph -->\n<p>More than 200 million people practice yoga worldwide – and due to recent global developments, online yoga has gained increasing public awareness and is practiced more and more frequently.<\/p>\n<!-- \/wp:paragraph -->\n\n<!-- wp:paragraph -->\n<p>This is predominantly a good thing as it makes yoga accessible to people who do not have an (affordable) yoga studio close to them or cannot find their favorite style of yoga or yoga teacher nearby.&nbsp;<\/p>\n<!-- \/wp:paragraph -->\n\n<!-- wp:paragraph -->\n<p>However, yoga is more than just a trend and a good stretch. When practiced correctly, it is a great tool to work on your mobility, flexibility, and stability. It also helps you to improve your body awareness and body intelligence.&nbsp;<\/p>\n<!-- \/wp:paragraph -->\n\n<!-- wp:paragraph -->\n<p>Furthermore, yoga is also a mental practice, helping you to develop a healthier mindset, train your resilience, and practice mindfulness, which will organically translate into your life off the mat.&nbsp;<\/p>\n<!-- \/wp:paragraph -->\n\n<!-- wp:paragraph -->\n<p>Like no other movement form, yoga is a holistic body-and-mind practice that has many benefits for your physical and mental health.&nbsp;<\/p>\n<!-- \/wp:paragraph -->\n\n<!-- wp:paragraph -->\n<p>However, if practiced incorrectly – maybe due to an insufficiently trained teacher – you can also harm your body. Especially inexperienced yoga practitioners tend to overestimate the limits of their bodies (or haven’t detected them yet!) and push themselves harder into poses than would do them good. And all that because they received inadequate guidance from an (online) yoga teacher or because they tried to equal the oh so gorgeous yoga teachers on Social Media.&nbsp;<\/p>\n<!-- \/wp:paragraph -->\n\n<!-- wp:paragraph -->\n<p>With the vast offer of online yoga classes, it’s difficult to separate the wheat from the chaff, i.e. to find high-quality content that is healthy, safe, and efficient.&nbsp;<\/p>\n<!-- \/wp:paragraph -->\n\n<!-- wp:paragraph -->\n<p>This is where TINT comes into play: It is our passion to support people to find personal fulfillment and success. This is only possible with a strong commitment. And that’s what our brand name stands for: TINT – there is no try.<\/p>\n<!-- \/wp:paragraph -->\n\n<!-- wp:paragraph -->\n<p>Furthermore, we partner with highly skilled professionals with years of experience as yoga teachers and teachers of teachers in order to ensure a safe and efficient online yoga practice.&nbsp;<\/p>\n<!-- \/wp:paragraph -->\n\n<!-- wp:paragraph -->\n<p>We want to support you on your journey to personal fulfillment and success. We see ourselves as a true partner and coach. We are more than just an online yoga platform with on-demand yoga video content. We want you to grow, develop, and achieve your goals. Our offers are aimed at ambitious yoga lovers and yoga teachers, who are willing to face change and growth.&nbsp;<\/p>\n<!-- \/wp:paragraph -->\n\n<!-- wp:paragraph -->\n<p>Yes, we are not for beginners. We are for ambitious yoga lovers and yoga teachers who live these values to the fullest.<\/p>\n<!-- \/wp:paragraph -->\n\n<!-- wp:html -->\n<p><\/p>\n<!-- \/wp:html -->\n\n<!-- wp:heading {\"level\":1} -->\n<h1 id=\"3\">3. Our Mission – How We Want to Support You<\/h1>\n<!-- \/wp:heading -->\n\n<!-- wp:html -->\n<div class=\"quote-wrapper\">\n<p class=\"quote\">\"We enable ambitious yoga lovers to achieve personal fulfillment and success no matter where you are. We act as a true partner and coach on your journey to sustainable growth while creating lasting memories along your way. We don’t try. We stand out. We do. There is no try.\"<\/p>\n<p class=\"quote-author\">– TINT.<\/p>\n<\/div>\n<!-- \/wp:html -->\n\n<!-- wp:paragraph -->\n<p>We are more than just a content provider. We help and support you by giving you the tools you need. We deliver knowledge, inspiration, and feedback. We make things possible.<\/p>\n<!-- \/wp:paragraph -->\n\n<!-- wp:heading -->\n<h2>3.1. For Ambitious Yoga Lovers<\/h2>\n<!-- \/wp:heading -->\n\n<!-- wp:paragraph -->\n<p>In contrast to other online yoga providers, we focus on committed yoga practitioners who want to evolve and thrive and are constantly seeking to improve their knowledge and skills. If you want to live your passion for yoga and are convinced that yoga is a powerful tool to better understand the body and mind, you’ve come to the right place.&nbsp;<\/p>\n<!-- \/wp:paragraph -->\n\n<!-- wp:paragraph -->\n<p>Yes, this means that we are not for beginners. On the one hand, because beginners are in the safest possible hands in an in-person class with an experienced yoga teacher who can actually touch and adjust them adequately.<\/p>\n<!-- \/wp:paragraph -->\n\n<!-- wp:paragraph -->\n<p>On the other hand, we believe that at least some basic knowledge and experience is required in order to move further. You need a solid foundation to build your dream house. The same goes for yoga (or any other practice).<\/p>\n<!-- \/wp:paragraph -->\n\n<!-- wp:heading -->\n<h2>3.2. Achieve Personal Fulfillment and Success<\/h2>\n<!-- \/wp:heading -->\n\n<!-- wp:paragraph -->\n<p>TINT is the place to live your passion: If your purpose of life is to bring joy and happiness to others, then yoga is a great vehicle to achieve this. Like no other movement practice, yoga combines physical and mental practices, making it a holistic approach to a healthier body and mind.<\/p>\n<!-- \/wp:paragraph -->\n\n<!-- wp:paragraph -->\n<p>Apart from that, if you are or want to become a yoga teacher, this practice is a great way to have an impact on other people’s lives and receive recognition by supporting others to thrive. You will feel valued, receive appreciation and appreciate yourself on a deeper level. Yoga can help you become the person you want to be and we want to support you with this as best as we can.&nbsp;<\/p>\n<!-- \/wp:paragraph -->\n\n<!-- wp:paragraph -->\n<p>And if you’ve always dreamed of earning a living with yoga, we help you find and execute the right strategy to achieve exactly this. We provide you the tools and knowledge, and boost your self-esteem and courage so that you can stand out and live to your full potential.<\/p>\n<!-- \/wp:paragraph -->\n\n<!-- wp:heading -->\n<h2>3.3. Your True Partner and Coach – Wherever You Are<\/h2>\n<!-- \/wp:heading -->\n\n<!-- wp:paragraph -->\n<p>We want to be more for you than just an online yoga platform. We believe in mutual long-term commitment that is based on a relationship of trust. Our commitment towards you: We are there for you. We listen to your needs, fears, and doubts. We motivate and inspire you.&nbsp;<\/p>\n<!-- \/wp:paragraph -->\n\n<!-- wp:paragraph -->\n<p>Your commitment towards us: Your whole heart, passion, and sincerity. That’s the reason why we don’t offer a free trial period (remember: There is no try.). We don’t want to entice you with seductive promotion offers or huge no-brainer discounts. We want you to make a conscious decision to invest energy, time and – yes – also money in yourself.&nbsp;<\/p>\n<!-- \/wp:paragraph -->\n\n<!-- wp:paragraph -->\n<p>But don’t worry: Should you find out that TINT really isn’t for you (what we don’t hope but – hey – you can’t be everybody’s darling), we offer a 30-day money-back guarantee. You can simply send a message to our <a href=\"https:\/\/tintyoga.com\/help\">Support Team<\/a> (who, by the way, is always willing to help you with any other issues as well!) and we will refund the money. No questions asked. Promised. Just make sure it’s within the 30 days from your subscription date.&nbsp;<\/p>\n<!-- \/wp:paragraph -->\n\n<!-- wp:paragraph -->\n<p>We also believe in growth through honest and constructive feedback – on both sides. That’s why we have implemented a <a href=\"https:\/\/feedback.tintyoga.com\/\">Feedback Portal<\/a> where you can tell us what you need, what you don’t like, and what your pain points are.&nbsp;<\/p>\n<!-- \/wp:paragraph -->\n\n<!-- wp:paragraph -->\n<p>We also want to make high-quality yoga content and education accessible to everybody and every body. We want to offer you an easily accessible and flexible learning and training experience where place and time no longer are a restriction.&nbsp;<\/p>\n<!-- \/wp:paragraph -->\n\n<!-- wp:paragraph -->\n<p>With TINT, you can enjoy exclusive yoga and inspirational content and connect with like-minded people – irrespective of your current personal living conditions. That makes online yoga such a powerful tool nowadays. And with our smartphone and smartTV apps, you can even access TINT on the go and download your favorite contents to use in times where you don’t have an internet connection.<\/p>\n<!-- \/wp:paragraph -->\n\n<!-- wp:heading -->\n<h2>3.4. Your Journey to Sustainable Growth<\/h2>\n<!-- \/wp:heading -->\n\n<!-- wp:paragraph -->\n<p>TINT is the place for people who are ready to face the challenges of a real journey towards success and fulfillment. Single events won’t make a change. The road to happiness is not straight. It’s a roller-coaster. We are at your side through all the ups and downs.<\/p>\n<!-- \/wp:paragraph -->\n\n<!-- wp:paragraph -->\n<p>Sustainable growth means repeatable and healthy development that is responsible to, and for, current and future communities. It’s the key to long-term success, happiness and fulfilment.<\/p>\n<!-- \/wp:paragraph -->\n\n<!-- wp:paragraph -->\n<p>We believe in healthy and lasting improvements and want to help you produce long-term effects. This is why our minimum membership is 3 months. It took, for example, 29 years until <a href=\"https:\/\/en.wikipedia.org\/wiki\/Alexander_Graham_Bell\">Alexander Graham Bell<\/a> invented the telephone and he filed more than <a href=\"https:\/\/www.history.com\/news\/10-things-you-may-not-know-about-alexander-graham-bell\">600 lawsuits<\/a> over his telephone patent. Growth won’t happen overnight. With this minimum commitment, you lay the foundation for your long-term growth and development.&nbsp;<\/p>\n<!-- \/wp:paragraph -->\n\n<!-- wp:html -->\n<p><\/p>\n<!-- \/wp:html -->\n\n<!-- wp:heading {\"level\":1} -->\n<h1 id=\"4\">4. Our Offer – What We Do for You<\/h1>\n<!-- \/wp:heading -->\n\n<!-- wp:paragraph -->\n<p>Our offer comprises two main products: our TINT Membership with new content every day, including single classes to practice, series to learn and increase your knowledge, and inspirational videos.&nbsp;<\/p>\n<!-- \/wp:paragraph -->\n\n<!-- wp:paragraph -->\n<p>The second part is our TINT Academy with certified yoga teacher trainings, varying from full 200-hour yoga teacher trainings to Inside Flow teacher trainings and more.<\/p>\n<!-- \/wp:paragraph -->\n\n<!-- wp:paragraph -->\n<p>Plus, our contents are easily accessible since you can watch them online via your browser, or use our smartphone and smartTV apps where you can even download your favorite content pieces and watch them without an Internet connection.&nbsp;<\/p>\n<!-- \/wp:paragraph -->\n\n<!-- wp:paragraph -->\n<p>The global yoga market is huge but we are committed to a clear vision and direction and, thus, found our niche. We are ready to revolutionize yoga training and education with a modern approach and a holistic content strategy.&nbsp;<\/p>\n<!-- \/wp:paragraph -->\n\n<!-- wp:heading -->\n<h2>4.1. TINT Academy – Learn From the Best<\/h2>\n<!-- \/wp:heading -->\n\n<!-- wp:paragraph -->\n<p>With <a href=\"https:\/\/tintyoga.com\/academy\/\">TINT Academy<\/a>, you can learn from the most successful and knowledgeable yoga teachers in the world. We want to make their know-how available to you – no matter where you are. What better way is there to learn from them than doing a teacher training?<\/p>\n<!-- \/wp:paragraph -->\n\n<!-- wp:paragraph -->\n<p>On TINT, you can, for example, become a certified yoga teacher by joining our comprehensive <a href=\"https:\/\/tintyoga.com\/200-hour-online-teacher-training\/\">200-Hour Online Yoga Teacher Training<\/a>. Or you can become an <a href=\"https:\/\/tintyoga.com\/inside-flow-academy\/\">Inside Flow Teacher<\/a> or even an <a href=\"https:\/\/tintyoga.com\/inside-flow-junior\/\">Inside Flow Junior Teacher<\/a>.<\/p>\n<!-- \/wp:paragraph -->\n\n<!-- wp:paragraph -->\n<p>Attending a teacher training online saves you a lot of travel time and expenses. Plus, you can join teachers that would otherwise simply not be available to you, such as <a href=\"https:\/\/tintyoga.com\/instructors\/young-ho-kim\/\">Young Ho Kim<\/a>, <a href=\"https:\/\/tintyoga.com\/instructors\/barbra-noh\/\">Barbra Noh<\/a>, or <a href=\"https:\/\/tintyoga.com\/instructors\/desi-springer-john-friend\/\">John Friend and Desi Springer<\/a>.&nbsp;<\/p>\n<!-- \/wp:paragraph -->\n\n<!-- wp:paragraph -->\n<p>Upon successful completion of any training, your efforts will be rewarded. All passed online exams are accompanied by a personalized certificate just for you. This way, you can show yourself and others what you achieved, increase your credibility, and open new business opportunities.&nbsp;<\/p>\n<!-- \/wp:paragraph -->\n\n<!-- wp:paragraph -->\n<p>And one thing is for sure: The exam isn’t easy. Your certificate stands for itself.<\/p>\n<!-- \/wp:paragraph -->\n\n<!-- wp:html -->\n<!-- IMAGE 16:9 -->\n<div class=\"image-wrapper\">\n<div class=\"aspectratio\" data-ratio=\"16:9\" position=\"bottom\">\n  <div>\n   <a href=\"https:\/\/tintyoga.com\/200-hour-online-teacher-training\/\"><img src=\"https:\/\/tintyoga.com\/wp-content\/uploads\/2021\/04\/Thumbnails-Academy-Young-Ho-Kim-1-1.jpg\"><\/a>\n  <\/div>\n<\/div>\n\n<!-- CAPTION -->\n<p class=\"caption\">With TINT Academy, you can become a certified yoga teacher – online.<\/p>\n<\/div>\n<!-- \/wp:html -->\n\n<!-- wp:heading -->\n<h2>4.2. Yoga Series – Deepen Your Yoga Practice<\/h2>\n<!-- \/wp:heading -->\n\n<!-- wp:paragraph -->\n<p>Our online yoga series are a set of pre-recorded on-demand videos that each focus on a specific topic, yoga style, or goal. They are like a workshop or training plan that you can attend from your home and according to your own timing and schedule.&nbsp;<\/p>\n<!-- \/wp:paragraph -->\n\n<!-- wp:paragraph -->\n<p>This gives you the opportunity to dive deeper into specific topics, expand your knowledge and experience, or build a regular practice routine.<\/p>\n<!-- \/wp:paragraph -->\n\n<!-- wp:paragraph -->\n<p>All our TINT Instructors have built their skills on years of experience as yoga teachers and teachers of teachers. They are pioneers in their fields and share the same values as&nbsp; our founder <a href=\"https:\/\/tintyoga.com\/instructors\/young-ho-kim\/\">Young Ho Kim<\/a>.<\/p>\n<!-- \/wp:paragraph -->\n\n<!-- wp:paragraph -->\n<p>We are the only online platform, for example, that offers various <a href=\"https:\/\/watch.tintyoga.com\/categories\/inside-flow\">Inside Flow<\/a> series like <a href=\"https:\/\/watch.tintyoga.com\/programs\/power-of-inside-flow?categoryId=11239\">The Power of Inside Flow<\/a> or the <a href=\"https:\/\/watch.tintyoga.com\/programs\/inside-flow-summer-challenge?categoryId=11239\">Inside Flow Summer Challenge 2021<\/a>.<\/p>\n<!-- \/wp:paragraph -->\n\n<!-- wp:paragraph -->\n<p>You can also try out other unique yoga styles such as<a href=\"https:\/\/watch.tintyoga.com\/categories\/bowspring\"> Bowspring Yoga<\/a> presented by the founders <a href=\"https:\/\/tintyoga.com\/instructors\/desi-springer-john-friend\/\">Desi Springer and John Friend<\/a>, or try the brand-new style <a href=\"https:\/\/watch.tintyoga.com\/programs\/mymoves-360?categoryId=75445\">MYMOVES<\/a> with the founder <a href=\"https:\/\/tintyoga.com\/instructors\/alexey-gaevskij\/\">Alexey Gaevskij<\/a>. We are also proud to be one of the few online presences where you can practice <a href=\"https:\/\/watch.tintyoga.com\/categories\/budokon\">Budokon<\/a> with its founder <a href=\"https:\/\/tintyoga.com\/instructors\/cameron-shayne\/\">Cameron Shayne<\/a>.<\/p>\n<!-- \/wp:paragraph -->\n\n<!-- wp:paragraph -->\n<p>Other series, like the <a href=\"https:\/\/watch.tintyoga.com\/programs\/7-day-vinyasa-challenge?categoryId=75445\">7-Day Vinyasa Challenge<\/a> by <a href=\"https:\/\/tintyoga.com\/instructors\/hie-kim\/\">Hie Kim<\/a> or <a href=\"https:\/\/watch.tintyoga.com\/programs\/find-your-flow?categoryId=75446\">Find Your Flow<\/a> by <a href=\"https:\/\/tintyoga.com\/instructors\/ami-norton\/\">Ami Norton<\/a>, help you build your own regular yoga routine.&nbsp;<\/p>\n<!-- \/wp:paragraph -->\n\n<!-- wp:paragraph -->\n<p>TINT even helps you to deepen your understanding of yoga alignment and anatomy in series like <a href=\"https:\/\/tintyoga.com\/instructors\/barbra-noh\/\">Barbra Noh<\/a>’s <a href=\"https:\/\/watch.tintyoga.com\/programs\/therapeutic-alignment-immersion\">Therapeutic Alignment Immersion<\/a> or Young Ho Kim’s <a href=\"https:\/\/watch.tintyoga.com\/programs\/inside-yoga-alignment?categoryId=75446\">Inside Yoga Alignment<\/a>.&nbsp;<\/p>\n<!-- \/wp:paragraph -->\n\n<!-- wp:paragraph -->\n<p>So, no matter what you’re longing for or what you’re interested in, chances are high that you find something that suits you on TINT. If not, reach out to our <a href=\"https:\/\/tintyoga.com\/help\">Support Team<\/a>, who is happy to help you.&nbsp;&nbsp;<\/p>\n<!-- \/wp:paragraph -->\n\n<!-- wp:html -->\n<!-- GALLERY 2x2 -->\n<div class=\"grid-wrapper\">\n<div class=\"grid-2x2-container\">\n\n<!-- Image 1 -->\n<div class=\"aspectratio\" data-ratio=\"16:9\"><div>\n<a href=\"https:\/\/watch.tintyoga.com\/programs\/find-your-flow?categoryId=75446\"><img position=\"bottom\" src=\"https:\/\/tintyoga.com\/wp-content\/uploads\/2021\/07\/Thumbnails-Ami-Norton.jpg\"><\/a>\n<\/div><\/div>\n\n<!-- Image 2 -->\n<div class=\"aspectratio\" data-ratio=\"16:9\"><div>\n<a href=\"https:\/\/watch.tintyoga.com\/programs\/7-day-vinyasa-challenge?categoryId=75445\"><img position=\"left\" src=\"https:\/\/tintyoga.com\/wp-content\/uploads\/2021\/06\/Thumbnails-Hie-Kim.jpg\"><\/a>\n<\/div><\/div>\n\n<!-- Image 3 -->\n<div class=\"aspectratio\" data-ratio=\"16:9\"><div>\n<a href=\"https:\/\/watch.tintyoga.com\/programs\/mymoves-360?categoryId=75445\"><img position=\"top\" src=\"https:\/\/tintyoga.com\/wp-content\/uploads\/2021\/05\/Thumbnails-Alexey-Gaevskij.jpg\"><\/a>\n<\/div><\/div>\n\n<!-- Image 4 -->\n<div class=\"aspectratio\" data-ratio=\"16:9\"><div>\n<a href=\"https:\/\/watch.tintyoga.com\/programs\/power-of-inside-flow?categoryId=75445\"><img position=\"left\" src=\"https:\/\/tintyoga.com\/wp-content\/uploads\/2021\/01\/Thumbnails-Young-Ho-Kim.jpg\"><\/a>\n<\/div><\/div>\n\n<\/div>\n\n<!-- CAPTION -->\n<p class=\"caption\">On TINT, you'll definitely find something you like.<\/p>\n<\/div>\n<!-- \/wp:html -->\n\n<!-- wp:heading -->\n<h2>4.3. TINT of the Day – Your Daily Inspiration<\/h2>\n<!-- \/wp:heading -->\n\n<!-- wp:paragraph -->\n<p>We don’t TRY to inspire you, we DO. For this purpose, we provide you with a short inspirational practice every day to boost your development and growth. This can be anything from a yoga or meditation practice, a quote, or a tip from one of our instructors.<\/p>\n<!-- \/wp:paragraph -->\n\n<!-- wp:html -->\n<!-- IMAGE 16:9 -->\n<div class=\"image-wrapper\">\n<div class=\"aspectratio\" data-ratio=\"16:9\" position=\"bottom\">\n  <div>\n   <img src=\"https:\/\/tintyoga.com\/wp-content\/uploads\/2021\/10\/tint_magazine_TINT-of-the-day.jpg\">\n  <\/div>\n<\/div>\n\n<!-- CAPTION -->\n<p class=\"caption\">Our <a href=\"https:\/\/watch.tintyoga.com\/categories\/tint-of-the-day\">TINT OF THE DAY<\/a> offers you inspiration every day.<\/p>\n<\/div>\n<!-- \/wp:html -->\n\n<!-- wp:heading -->\n<h2>4.4. Regular Livestreams – a New Focus Every Month<\/h2>\n<!-- \/wp:heading -->\n\n<!-- wp:paragraph -->\n<p>Our regular weekly <a href=\"https:\/\/watch.tintyoga.com\/pages\/live\">livestreams<\/a> are another important milestone on your way to sustainable growth and to achieve new goals. However, our livestreams are not just random online yoga practices. All our live classes have a specific focus that changes every month. This means, for an entire month, we will work on a particular topic together for an entire month to achieve one dedicated goal. This can be, for example, a teaching-related topic such as sequencing, or a more practice-oriented theme like our <a href=\"https:\/\/watch.tintyoga.com\/programs\/inside-flow-summer-challenge\">Inside Flow Summer Challenge 2021<\/a>.&nbsp;<\/p>\n<!-- \/wp:paragraph -->\n\n<!-- wp:html -->\n<!-- IMAGE 16:9 -->\n<div class=\"image-wrapper\">\n<div class=\"aspectratio\" data-ratio=\"16:9\" position=\"bottom\">\n  <div>\n  <a href=\"https:\/\/watch.tintyoga.com\/pages\/live\"><img src=\"https:\/\/tintyoga.com\/wp-content\/uploads\/2021\/10\/tint_magazine_Focus-Topic.jpeg\"><\/a>\n  <\/div>\n<\/div>\n\n<!-- CAPTION -->\n<p class=\"caption\">In our weekly livestreams, we focus on one specific topic for one month.<\/p>\n<\/div>\n<!-- \/wp:html -->\n\n<!-- wp:heading -->\n<h2>4.5. Quarterly Event – Creating Lasting Memories<\/h2>\n<!-- \/wp:heading -->\n\n<!-- wp:paragraph -->\n<p>Every three months, we organize a special online event to interact with our community, connect people and celebrate their achievements. These events are one valuable piece in the puzzle of success and growth – emotions guaranteed!&nbsp;<\/p>\n<!-- \/wp:paragraph -->\n\n<!-- wp:paragraph -->\n<p>Our <a href=\"https:\/\/watch.tintyoga.com\/pages\/quarterly-event\">Quarterly Event<\/a> can be a themed mini-retreat, a dedicated workshop, or even an online yoga festival, which will be live and online. It will also be more interactive than our regular livestreams to better connect with you and create lasting memories.<\/p>\n<!-- \/wp:paragraph -->\n\n<!-- wp:html -->\n<!-- IMAGE 16:9 -->\n<div class=\"image-wrapper\">\n<div class=\"aspectratio\" data-ratio=\"16:9\" position=\"bottom\">\n  <div>\n   <img src=\"https:\/\/tintyoga.com\/wp-content\/uploads\/2021\/10\/tint_magazine_Quartely-Event.jpg\">\n  <\/div>\n<\/div>\n\n<!-- CAPTION -->\n<p class=\"caption\">Our Quarterly Events create lasting memories and connect our community.<\/p>\n<\/div>\n<!-- \/wp:html -->\n\n<!-- wp:paragraph -->\n<p>This is our way to interact with our community, connect people and celebrate their achievements. On TINT, you are not just one among many. We make your milestones count. Our community events create emotions and lasting memories.<\/p>\n<!-- \/wp:paragraph -->\n\n<!-- wp:paragraph -->\n<p>We hope you got a better understanding of who we are, what our vision and mission is, and what we stand for. Maybe that even inspired you to define your own vision or draw a clearer picture of who you want to be. If so, well… we already achieved one part of our mission.<\/p>\n<!-- \/wp:paragraph -->","_et_gb_content_width":""},"categories":[173],"tags":[],"yoast_head":"<!-- This site is optimized with the Yoast SEO plugin v19.10 - https:\/\/yoast.com\/wordpress\/plugins\/seo\/ -->\n<title>Behind the Scenes of TINT – Revolutionizing Online Yoga - TINT Yoga<\/title>\n<meta name=\"description\" content=\"Have you ever wondered what lies beneath TINT? Let&#039;s look at the story behind TINT – who we are and what we stand for.\" \/>\n<meta name=\"robots\" content=\"index, follow, max-snippet:-1, max-image-preview:large, max-video-preview:-1\" \/>\n<link rel=\"canonical\" href=\"https:\/\/tintyoga.com\/magazine\/tint-vision\/\" \/>\n<meta property=\"og:locale\" content=\"en_US\" \/>\n<meta property=\"og:type\" content=\"article\" \/>\n<meta property=\"og:title\" content=\"Behind the Scenes of TINT – Revolutionizing Online Yoga - TINT Yoga\" \/>\n<meta property=\"og:description\" content=\"Have you ever wondered what lies beneath TINT? Let&#039;s look at the story behind TINT – who we are and what we stand for.\" \/>\n<meta property=\"og:url\" content=\"https:\/\/tintyoga.com\/magazine\/tint-vision\/\" \/>\n<meta property=\"og:site_name\" content=\"TINT Yoga\" \/>\n<meta property=\"article:publisher\" content=\"https:\/\/www.facebook.com\/tintyoga\/\" \/>\n<meta property=\"article:published_time\" content=\"2021-10-13T14:13:25+00:00\" \/>\n<meta property=\"article:modified_time\" content=\"2022-08-16T15:50:37+00:00\" \/>\n<meta property=\"og:image\" content=\"https:\/\/tintyoga.com\/wp-content\/uploads\/2021\/10\/tint_magazine_header.jpeg\" \/>\n\t<meta property=\"og:image:width\" content=\"1350\" \/>\n\t<meta property=\"og:image:height\" content=\"636\" \/>\n\t<meta property=\"og:image:type\" content=\"image\/jpeg\" \/>\n<meta name=\"author\" content=\"doreen\" \/>\n<meta name=\"twitter:card\" content=\"summary_large_image\" \/>\n<meta name=\"twitter:label1\" content=\"Written by\" \/>\n\t<meta name=\"twitter:data1\" content=\"doreen\" \/>\n\t<meta name=\"twitter:label2\" content=\"Est. reading time\" \/>\n\t<meta name=\"twitter:data2\" content=\"15 minutes\" \/>\n<script type=\"application\/ld+json\" class=\"yoast-schema-graph\">{\"@context\":\"https:\/\/schema.org\",\"@graph\":[{\"@type\":\"Article\",\"@id\":\"https:\/\/tintyoga.com\/magazine\/tint-vision\/#article\",\"isPartOf\":{\"@id\":\"https:\/\/tintyoga.com\/magazine\/tint-vision\/\"},\"author\":{\"name\":\"doreen\",\"@id\":\"https:\/\/tintyoga.com\/#\/schema\/person\/581877dfb2f1e012aa8f2a2a39a44c3b\"},\"headline\":\"Behind the Scenes of TINT – Revolutionizing Online Yoga\",\"datePublished\":\"2021-10-13T14:13:25+00:00\",\"dateModified\":\"2022-08-16T15:50:37+00:00\",\"mainEntityOfPage\":{\"@id\":\"https:\/\/tintyoga.com\/magazine\/tint-vision\/\"},\"wordCount\":2961,\"publisher\":{\"@id\":\"https:\/\/tintyoga.com\/#organization\"},\"articleSection\":[\"Lifestyle\"],\"inLanguage\":\"en-US\"},{\"@type\":\"WebPage\",\"@id\":\"https:\/\/tintyoga.com\/magazine\/tint-vision\/\",\"url\":\"https:\/\/tintyoga.com\/magazine\/tint-vision\/\",\"name\":\"Behind the Scenes of TINT – Revolutionizing Online Yoga - TINT Yoga\",\"isPartOf\":{\"@id\":\"https:\/\/tintyoga.com\/#website\"},\"datePublished\":\"2021-10-13T14:13:25+00:00\",\"dateModified\":\"2022-08-16T15:50:37+00:00\",\"description\":\"Have you ever wondered what lies beneath TINT? Let's look at the story behind TINT – who we are and what we stand for.\",\"breadcrumb\":{\"@id\":\"https:\/\/tintyoga.com\/magazine\/tint-vision\/#breadcrumb\"},\"inLanguage\":\"en-US\",\"potentialAction\":[{\"@type\":\"ReadAction\",\"target\":[\"https:\/\/tintyoga.com\/magazine\/tint-vision\/\"]}]},{\"@type\":\"BreadcrumbList\",\"@id\":\"https:\/\/tintyoga.com\/magazine\/tint-vision\/#breadcrumb\",\"itemListElement\":[{\"@type\":\"ListItem\",\"position\":1,\"name\":\"Home\",\"item\":\"https:\/\/tintyoga.com\/\"},{\"@type\":\"ListItem\",\"position\":2,\"name\":\"Behind the Scenes of TINT – Revolutionizing Online Yoga\"}]},{\"@type\":\"WebSite\",\"@id\":\"https:\/\/tintyoga.com\/#website\",\"url\":\"https:\/\/tintyoga.com\/\",\"name\":\"TINT Yoga\",\"description\":\"TINT Yoga offers premium online yoga classes with the world&#039;s most popular yoga and movement instructors. Learn and work out with our online yoga videos.\",\"publisher\":{\"@id\":\"https:\/\/tintyoga.com\/#organization\"},\"potentialAction\":[{\"@type\":\"SearchAction\",\"target\":{\"@type\":\"EntryPoint\",\"urlTemplate\":\"https:\/\/tintyoga.com\/?s={search_term_string}\"},\"query-input\":\"required name=search_term_string\"}],\"inLanguage\":\"en-US\"},{\"@type\":\"Organization\",\"@id\":\"https:\/\/tintyoga.com\/#organization\",\"name\":\"TINT Yoga\",\"url\":\"https:\/\/tintyoga.com\/\",\"logo\":{\"@type\":\"ImageObject\",\"inLanguage\":\"en-US\",\"@id\":\"https:\/\/tintyoga.com\/#\/schema\/logo\/image\/\",\"url\":\"https:\/\/tintyoga.com\/wp-content\/uploads\/2021\/08\/logo_color_black.png\",\"contentUrl\":\"https:\/\/tintyoga.com\/wp-content\/uploads\/2021\/08\/logo_color_black.png\",\"width\":1001,\"height\":301,\"caption\":\"TINT Yoga\"},\"image\":{\"@id\":\"https:\/\/tintyoga.com\/#\/schema\/logo\/image\/\"},\"sameAs\":[\"https:\/\/www.instagram.com\/tint_yoga\/\",\"https:\/\/de.linkedin.com\/company\/tint-gmbh\",\"https:\/\/www.pinterest.de\/tintyoga\/\",\"https:\/\/www.youtube.com\/channel\/UC2HjTe0TL20qSk8e3s1d0DA\",\"https:\/\/www.facebook.com\/tintyoga\/\"]},{\"@type\":\"Person\",\"@id\":\"https:\/\/tintyoga.com\/#\/schema\/person\/581877dfb2f1e012aa8f2a2a39a44c3b\",\"name\":\"doreen\",\"image\":{\"@type\":\"ImageObject\",\"inLanguage\":\"en-US\",\"@id\":\"https:\/\/tintyoga.com\/#\/schema\/person\/image\/\",\"url\":\"https:\/\/secure.gravatar.com\/avatar\/5ac132c6e49e85e81542f95a7a9e124e?s=96&d=mm&r=g\",\"contentUrl\":\"https:\/\/secure.gravatar.com\/avatar\/5ac132c6e49e85e81542f95a7a9e124e?s=96&d=mm&r=g\",\"caption\":\"doreen\"},\"url\":\"https:\/\/tintyoga.com\/magazine\/author\/doreen\/\"}]}<\/script>\n<!-- \/ Yoast SEO plugin. -->","yoast_head_json":{"title":"Behind the Scenes of TINT – Revolutionizing Online Yoga - TINT Yoga","description":"Have you ever wondered what lies beneath TINT? Let's look at the story behind TINT – who we are and what we stand for.","robots":{"index":"index","follow":"follow","max-snippet":"max-snippet:-1","max-image-preview":"max-image-preview:large","max-video-preview":"max-video-preview:-1"},"canonical":"https:\/\/tintyoga.com\/magazine\/tint-vision\/","og_locale":"en_US","og_type":"article","og_title":"Behind the Scenes of TINT – Revolutionizing Online Yoga - TINT Yoga","og_description":"Have you ever wondered what lies beneath TINT? Let's look at the story behind TINT – who we are and what we stand for.","og_url":"https:\/\/tintyoga.com\/magazine\/tint-vision\/","og_site_name":"TINT Yoga","article_publisher":"https:\/\/www.facebook.com\/tintyoga\/","article_published_time":"2021-10-13T14:13:25+00:00","article_modified_time":"2022-08-16T15:50:37+00:00","og_image":[{"width":1350,"height":636,"url":"https:\/\/tintyoga.com\/wp-content\/uploads\/2021\/10\/tint_magazine_header.jpeg","type":"image\/jpeg"}],"author":"doreen","twitter_card":"summary_large_image","twitter_misc":{"Written by":"doreen","Est. reading time":"15 minutes"},"schema":{"@context":"https:\/\/schema.org","@graph":[{"@type":"Article","@id":"https:\/\/tintyoga.com\/magazine\/tint-vision\/#article","isPartOf":{"@id":"https:\/\/tintyoga.com\/magazine\/tint-vision\/"},"author":{"name":"doreen","@id":"https:\/\/tintyoga.com\/#\/schema\/person\/581877dfb2f1e012aa8f2a2a39a44c3b"},"headline":"Behind the Scenes of TINT – Revolutionizing Online Yoga","datePublished":"2021-10-13T14:13:25+00:00","dateModified":"2022-08-16T15:50:37+00:00","mainEntityOfPage":{"@id":"https:\/\/tintyoga.com\/magazine\/tint-vision\/"},"wordCount":2961,"publisher":{"@id":"https:\/\/tintyoga.com\/#organization"},"articleSection":["Lifestyle"],"inLanguage":"en-US"},{"@type":"WebPage","@id":"https:\/\/tintyoga.com\/magazine\/tint-vision\/","url":"https:\/\/tintyoga.com\/magazine\/tint-vision\/","name":"Behind the Scenes of TINT – Revolutionizing Online Yoga - TINT Yoga","isPartOf":{"@id":"https:\/\/tintyoga.com\/#website"},"datePublished":"2021-10-13T14:13:25+00:00","dateModified":"2022-08-16T15:50:37+00:00","description":"Have you ever wondered what lies beneath TINT? Let's look at the story behind TINT – who we are and what we stand for.","breadcrumb":{"@id":"https:\/\/tintyoga.com\/magazine\/tint-vision\/#breadcrumb"},"inLanguage":"en-US","potentialAction":[{"@type":"ReadAction","target":["https:\/\/tintyoga.com\/magazine\/tint-vision\/"]}]},{"@type":"BreadcrumbList","@id":"https:\/\/tintyoga.com\/magazine\/tint-vision\/#breadcrumb","itemListElement":[{"@type":"ListItem","position":1,"name":"Home","item":"https:\/\/tintyoga.com\/"},{"@type":"ListItem","position":2,"name":"Behind the Scenes of TINT – Revolutionizing Online Yoga"}]},{"@type":"WebSite","@id":"https:\/\/tintyoga.com\/#website","url":"https:\/\/tintyoga.com\/","name":"TINT Yoga","description":"TINT Yoga offers premium online yoga classes with the world&#039;s most popular yoga and movement instructors. Learn and work out with our online yoga videos.","publisher":{"@id":"https:\/\/tintyoga.com\/#organization"},"potentialAction":[{"@type":"SearchAction","target":{"@type":"EntryPoint","urlTemplate":"https:\/\/tintyoga.com\/?s={search_term_string}"},"query-input":"required name=search_term_string"}],"inLanguage":"en-US"},{"@type":"Organization","@id":"https:\/\/tintyoga.com\/#organization","name":"TINT Yoga","url":"https:\/\/tintyoga.com\/","logo":{"@type":"ImageObject","inLanguage":"en-US","@id":"https:\/\/tintyoga.com\/#\/schema\/logo\/image\/","url":"https:\/\/tintyoga.com\/wp-content\/uploads\/2021\/08\/logo_color_black.png","contentUrl":"https:\/\/tintyoga.com\/wp-content\/uploads\/2021\/08\/logo_color_black.png","width":1001,"height":301,"caption":"TINT Yoga"},"image":{"@id":"https:\/\/tintyoga.com\/#\/schema\/logo\/image\/"},"sameAs":["https:\/\/www.instagram.com\/tint_yoga\/","https:\/\/de.linkedin.com\/company\/tint-gmbh","https:\/\/www.pinterest.de\/tintyoga\/","https:\/\/www.youtube.com\/channel\/UC2HjTe0TL20qSk8e3s1d0DA","https:\/\/www.facebook.com\/tintyoga\/"]},{"@type":"Person","@id":"https:\/\/tintyoga.com\/#\/schema\/person\/581877dfb2f1e012aa8f2a2a39a44c3b","name":"doreen","image":{"@type":"ImageObject","inLanguage":"en-US","@id":"https:\/\/tintyoga.com\/#\/schema\/person\/image\/","url":"https:\/\/secure.gravatar.com\/avatar\/5ac132c6e49e85e81542f95a7a9e124e?s=96&d=mm&r=g","contentUrl":"https:\/\/secure.gravatar.com\/avatar\/5ac132c6e49e85e81542f95a7a9e124e?s=96&d=mm&r=g","caption":"doreen"},"url":"https:\/\/tintyoga.com\/magazine\/author\/doreen\/"}]}},"acf":[],"_links":{"self":[{"href":"https:\/\/tintyoga.com\/wp-json\/wp\/v2\/posts\/153720"}],"collection":[{"href":"https:\/\/tintyoga.com\/wp-json\/wp\/v2\/posts"}],"about":[{"href":"https:\/\/tintyoga.com\/wp-json\/wp\/v2\/types\/post"}],"author":[{"embeddable":true,"href":"https:\/\/tintyoga.com\/wp-json\/wp\/v2\/users\/6"}],"replies":[{"embeddable":true,"href":"https:\/\/tintyoga.com\/wp-json\/wp\/v2\/comments?post=153720"}],"version-history":[{"count":26,"href":"https:\/\/tintyoga.com\/wp-json\/wp\/v2\/posts\/153720\/revisions"}],"predecessor-version":[{"id":162980,"href":"https:\/\/tintyoga.com\/wp-json\/wp\/v2\/posts\/153720\/revisions\/162980"}],"wp:featuredmedia":[{"embeddable":true,"href":"https:\/\/tintyoga.com\/wp-json\/wp\/v2\/media\/156491"}],"wp:attachment":[{"href":"https:\/\/tintyoga.com\/wp-json\/wp\/v2\/media?parent=153720"}],"wp:term":[{"taxonomy":"category","embeddable":true,"href":"https:\/\/tintyoga.com\/wp-json\/wp\/v2\/categories?post=153720"},{"taxonomy":"post_tag","embeddable":true,"href":"https:\/\/tintyoga.com\/wp-json\/wp\/v2\/tags?post=153720"}],"curies":[{"name":"wp","href":"https:\/\/api.w.org\/{rel}","templated":true}]}}