{"id":157298,"date":"2021-11-23T12:05:37","date_gmt":"2021-11-23T11:05:37","guid":{"rendered":"https:\/\/tintyoga.com\/?p=157298"},"modified":"2021-12-08T18:15:29","modified_gmt":"2021-12-08T17:15:29","slug":"yin-yoga-poses","status":"publish","type":"post","link":"https:\/\/tintyoga.com\/magazine\/yin-yoga-poses\/","title":{"rendered":"Yin Yoga Poses to Release Emotional and Physical Blockages"},"content":{"rendered":"\n<p class=\"intro-text\">While some yogis and yoginis might describe Yin Yoga as too easy, boring, or passive, others appreciate the emotional and muscular releases that the <strong>long duration of Yin Yoga poses<\/strong> entails.<\/p>\n\n\n\n<p>Yin Yoga, as it suggests, is the opposite and also complement of dynamic and muscular challenging (Yang) <a href=\"https:\/\/tintyoga.com\/magazine\/categories\/yoga-styles\/\">yoga styles<\/a> like Vinyasa Flow or <a href=\"https:\/\/tintyoga.com\/magazine\/budokon-a-combined-practice-of-yoga-martial-arts-and-calisthenics\/\">Budokon<\/a>. Therefore, flowing through Yin Yoga poses is very slow and calm. It can <strong>deepen the awareness of the body<\/strong> and its limits through a meditative stillness in a pose. Yin Yoga can be seen as a balance to any dynamic yoga style, they benefit from each other. It does not require any specific yoga level but is suitable for every yoga student.<\/p>\n\n\n\n<div class=\"toc-wrapper\">\n<p>What you will learn in this article:<\/p>\n\n<ul class=\"fa-ul toc-list\">\n  <li>\n  <span class=\"fa-li\"><i class=\"fa fa-long-arrow-right\"><\/i><\/span>\n  <a href=\"#1\">1. What is Yin Yoga?<\/a><\/li>\n  <li>\n  <span class=\"fa-li\"><i class=\"fa fa-long-arrow-right\"><\/i><\/span>\n  <a href=\"#2\">2. Why can Yin Yoga poses be emotionally intense?<\/a><\/li>\n  <li>\n  <span class=\"fa-li\"><i class=\"fa fa-long-arrow-right\"><\/i><\/span>\n  <a href=\"#3\">3. What benefits does Yin Yoga hold for your physical body?<\/a><\/li>\n  <li>\n  <span class=\"fa-li\"><i class=\"fa fa-long-arrow-right\"><\/i><\/span>\n  <a href=\"#4\">4. Which poses can be included into your Yin Yoga sequence?<\/a><\/li>\n \n<\/ul>\n<\/div>\n\n\n\n<h2 id=\"1\">1. What is Yin Yoga?<\/h2>\n\n\n\n<p>Yin Yoga describes a calm, meditative and reflective yoga practice. It is a practice of stillness and deep work, and the asanas are based upon <strong>sitting and recumbent positions<\/strong>. Because Yin Yoga is all about the long and <strong>deep stretch<\/strong>, standing asanas are mostly disregarded as they involve the muscles to engage. Practitioners hold Yin Yoga poses for at least <a href=\"https:\/\/yinyoga.com\/yinsights\/what-is-yin-yoga\/\" target=\"_blank\" rel=\"noreferrer noopener\">one but up to twenty minutes<\/a>. Sounds exhausting? Well, let’s say you will not be out of breath, but on a physical and mental level Yin Yoga poses can indeed push you to your limits.&nbsp;<\/p>\n\n\n\n<h3>1.1 Relax With Yin Yoga Poses to Release Tension in the Deep Tissues<\/h3>\n\n\n\n<p>Let’s look at the main characteristics of Yin Yoga. The term “Yin” in this context refers especially to the passiveness of the practice as well as the tissues it targets. The opposite “Yang” describes the active asanas that involve strength and engaged muscles. Instead of flowing through a challenging sequence of postures like in Vinyasa Yoga, in Yin Yoga you move into a pose – and then, you stay there. There is no need to move, instead you wait for your body to relax into its deeper layers of tissue. You <strong>should not wiggle yourself deeper<\/strong>, fidget, or otherwise move, because that would activate the muscles which would hinder you from stretching and releasing. <\/p>\n\n\n\n<p>In Yin Yoga, you relax the muscles (and the mind) to <strong>work the deep connective tissues<\/strong> which are mainly fascia but also bones, joints, and ligaments. Conscious breathwork helps further to set the intention on <strong>release and opening<\/strong>, e.g. of hips or hamstrings. You commit and remain still, accepting and letting go of any urge to move that might come up. Think: “Release.”<\/p>\n\n\n\n<!-- IMAGE 16:9 -->\n<div class=\"image-wrapper\">\n<div class=\"aspectratio\" data-ratio=\"16:9\" position=\"center\">\n  <div>\n   <a href=\"https:\/\/watch.tintyoga.com\/programs\/the-power-of-deep-and-mindful-relaxation?cid=248004&amp;permalink=p052_chris-su_session-01_1080p\"><img decoding=\"async\" src=\"https:\/\/tintyoga.com\/wp-content\/uploads\/2021\/12\/tint_magazine_Yin-Yoga_02_Chris-Su_Yin-to-release-tension.jpg\"><\/a>\n  <\/div>\n<\/div>\n\n<!-- CAPTION -->\n<p class=\"caption\">Release tension with the Yin mindfulness Yoga trainer <a href=\"https:\/\/tintyoga.com\/instructors\/chris-su\/\">Chris Su<\/a>.<\/p>\n<\/div>\n\n\n\n<p>Especially during rough and stressful times, Yin Yoga helps yogis and yoginis to <strong>slow down and find inner peace<\/strong>. In his <a href=\"https:\/\/watch.tintyoga.com\/programs\/the-power-of-deep-and-mindful-relaxation\">7-session series “The Power of Deep and Mindful Relaxation”<\/a>, the Yin Yoga Trainer Chris Su will support you on your way to deep relaxation, regeneration, and relieving stress to feel more energy on your journey to personal fulfillment and success. The sessions vary in focus – from Yin for the digestive system to Yin for grounding. Physically, the sessions benefit your <a href=\"https:\/\/tintyoga.com\/magazine\/can-yoga-really-increase-mobility-and-flexibility\/\">physical flexibility and mobility<\/a>. Mentally, you will <strong>cultivate strength and resilience<\/strong> and create deeper levels of concentration and calmness.&nbsp;<\/p>\n\n\n\n<h3>1.2 Breathing Through Intense Stretching Sensation&nbsp;&nbsp;<\/h3>\n\n\n\n<p>Yin Yoga is often considered as painful. Therefore, always keep in mind: In every asana, only go as far as you feel a significant resistance. There is a difference between the desired sore feeling of tissue stretching through long-held asanas and the pain that can damage your body – or between <strong>“good” and “bad” pain<\/strong>. <\/p>\n\n\n\n<p>The very common and good <a href=\"https:\/\/yinyoga.com\/good-pain-bad-pain-some-pain-no-pain\/\" target=\"_blank\" rel=\"noreferrer noopener\">resistance sensation<\/a> can feel mild, stretchy, tugging, and deep. However, holding a Yin Yoga pose can also feel like a sharp, burning, or pinching pain. In that case, move out of the pose or change it until you do not feel the pain anymore. To help you estimate if this is good or bad pain, ask yourself the question:&nbsp;<\/p>\n\n\n\n<p class=\"has-text-align-center\">“What keeps me from stretching deeper?”&nbsp;<\/p>\n\n\n\n<p>If the answer is “Dramatic pain”, then stop immediately and consult a Yin Yoga teacher about the issue. Remember to <strong>always listen to your body<\/strong> and <a href=\"https:\/\/tintyoga.com\/magazine\/positivity\/\">be kind to yourself<\/a>. If the answer, on the other hand, is “Because I just can’t” or “I don’t want to”, then this is your ego that tries to keep you in your comfort zone, in your territory of well-known experience and habits. <\/p>\n\n\n\n<p>In the case of the latter, it will help to <strong>endure the discomfort<\/strong> and even enjoy the sensation if you <a href=\"https:\/\/tintyoga.com\/magazine\/pranayama-an-intro-to-the-power-of-yogic-breathing\/\">reconnect to your breath<\/a>. Regulate it to relax yourself and to loosen tightness in your body. Breathe calmly and deepen the awareness of your body. Learn how to breathe mindfully with Chris Su to be able to apply what you learnt during a Yin yoga sequence.&nbsp;<\/p>\n\n\n\n<!-- IMAGE 16:9 -->\n<div class=\"image-wrapper\">\n<div class=\"aspectratio\" data-ratio=\"16:9\" position=\"center\">\n  <div>\n   <a href=\"https:\/\/watch.tintyoga.com\/programs\/the-power-of-deep-and-mindful-relaxation?cid=248002&amp;permalink=p052_chris-su_session-03_1080p\"><img decoding=\"async\" src=\"https:\/\/tintyoga.com\/wp-content\/uploads\/2021\/12\/tint_magazine_Yin-Yoga_03_Chris-Su_Mindfulness-breathing.jpg\"><\/a>\n  <\/div>\n<\/div>\n\n<!-- CAPTION -->\n<p class=\"caption\">Practice breathing mindfully to be able to breathe through possibly painful sensations during your Yin Yoga practice. <i>Photo: TINT Instructor <a href=\"https:\/\/tintyoga.com\/instructors\/chris-su\/\">Chris Su<\/a><\/i><\/p>\n<\/div>\n\n\n\n<p>The ego might also motivate you to go deeper into the stretch than is actually good for you. Be aware of thoughts like “I can go deeper – look, other people are doing it, too” or “I need to go deeper than the last time”. Silence them and <strong>accept your limit<\/strong>. It is a fine line – find your own unique way into the Yin Yoga pose.<\/p>\n\n\n\n<p>Special attention is required when coming-out of a Yin Yoga pose. Be careful and gentle because once you have sunk into a pose, it can be difficult to move out of it again. Most likely you will <strong>feel relief but also fragility<\/strong>. For one, five or even twenty minutes you have been pulling your body apart – and holding it apart. So be gentle and let your body slowly adjust back into its natural state of being.&nbsp;<\/p>\n\n\n<span style=\"--tl-form-height-m:1213.05px;--tl-form-height-t:638.781px;--tl-form-height-d:638.781px;\" class=\"tl-placeholder-f-type-shortcode_158494 tl-preload-form\"><span><\/span><\/span>\n\n\n<h2 id=\"2\">2. Why can Yin Yoga poses be emotionally intense?<\/h2>\n\n\n\n<p>Generally, yoga practices can be very emotional. It is common that when <a href=\"https:\/\/tintyoga.com\/magazine\/why-music-is-important\/\">flowing to a certain type of music or song<\/a>, yoginis and yogis shed a few tears. Often, the melody of the music or the message of the song lets them connect to a memory or an emotion in their heart that has not been felt to heal yet. However, yoga is still a physical and energetic work of the body. Yin Yoga poses may <strong>stimulate certain meridians of the body<\/strong> and <a href=\"https:\/\/yinyoga.com\/issues-in-our-tissues\/\" target=\"_blank\" rel=\"noreferrer noopener\">cause an emotional reaction<\/a>. <\/p>\n\n\n\n<p>Have you heard of the saying “<strong>issues in our tissues<\/strong>” before?&nbsp;<\/p>\n\n\n\n<p>When emotions are repressed, our body may store them in our deep connective tissues. Imagine, for example, that you are scared, where can you feel it in your body? Your breathing becomes very flat or short (you might even hold it), your chest becomes tight, your heart beats faster, the tension in your body increases – because technically your body prepares to fight, flight, or freeze. If the energy cannot be released after the event, the bodily sensations and emotions can then be repressed and may be stored in your body&#8217;s tissue. <\/p>\n\n\n\n<!-- IMAGE 16:9 -->\n<div class=\"image-wrapper\">\n<div class=\"aspectratio\" data-ratio=\"16:9\" position=\"center\">\n  <div>\n   <a href=\"https:\/\/watch.tintyoga.com\/programs\/letting-go\"><img decoding=\"async\" src=\"https:\/\/tintyoga.com\/wp-content\/uploads\/2021\/12\/tint_magazine_Yin-Yoga_04_Mirjam-Wagner.jpg\"><\/a>\n  <\/div>\n<\/div>\n\n<!-- CAPTION -->\n<p class=\"caption\">Learn letting go of emotions in <a href=\"https:\/\/tintyoga.com\/instructors\/david-lurey-mirjam-wagner\/\">David Lurey and Mirjam Wagner&#8217;s<\/a> Series <a href=\"https:\/\/watch.tintyoga.com\/programs\/yin-yang-for-hips-lower-spine\">Yin and Yang for Hips and Lower Spine<\/a>.<\/p>\n<\/div>\n\n\n\n<p>The inner thighs could become tense resulting from the missed opportunity to rather run, the tissue of the lungs can become stiffer because they did not have the opportunity to breathe fast and loud. Yin Yoga poses can help to gently <strong>dissolve those body traumas <\/strong>and in the process heavy emotions can arise. You can try this by letting Mirjam Wagner guide you through the process of <a href=\"https:\/\/watch.tintyoga.com\/programs\/letting-go\">letting go<\/a> emotions through Yin Yoga poses for the hips and lower spine.<\/p>\n\n\n\n<p>So when feelings arise or memories come up in certain Yin yoga poses, observe them, accept them, do not try to change or escape them. Pay attention to <strong>what you are feeling<\/strong>, which area of the body is sore, and how your breath behaves. Sometimes it can be helpful to also note <a href=\"https:\/\/tintyoga.com\/de\/magazine\/chakra-yoga\/\">which chakra lies in the area of the body<\/a> and, hence, which topic can be associated with the sensation. <\/p>\n\n\n\n<p>If the pain is too much to bear, whether physical or emotional, then accept that as well. You might not be ready yet, so gently just return to it some other time. If you <strong>experience blockages<\/strong> in certain areas of your body, you can try Chakra yoga with Faith Hunter in addition to Yin Yoga to remove blockages from your energy flow.<\/p>\n\n\n\n<!-- IMAGE 16:9 -->\n<div class=\"image-wrapper\">\n<div class=\"aspectratio\" data-ratio=\"16:9\" position=\"center\">\n  <div>\n   <a href=\"https:\/\/watch.tintyoga.com\/programs\/chakra-awakening-body-soul\"><img decoding=\"async\" src=\"https:\/\/tintyoga.com\/wp-content\/uploads\/2021\/12\/tint_magazine_Yin-Yoga_05_Faith-Hunter.jpg\"><\/a>\n  <\/div>\n<\/div>\n\n<!-- CAPTION -->\n<p class=\"caption\">Faith Hunter´s <a href=\"https:\/\/watch.tintyoga.com\/programs\/chakra-awakening-body-soul\">Chakra yoga classes<\/a> work on unblocking the body&#8217;s energy centers. <i>Photo: TINT Instructor <a href=\"https:\/\/tintyoga.com\/instructors\/faith-hunter\/\">Faith Hunter<\/a><\/i>.<\/p>\n<\/div>\n\n\n\n<h2 id=\"3\">3. What benefits does Yin Yoga hold for your physical body?<\/h2>\n\n\n\n<p>Yin Yoga has several health benefits, both physically and mentally. In Yin Yoga especially, you might notice more than during the practice of other yoga styles how much your physical body and your emotional and energetic body are connected.&nbsp;<\/p>\n\n\n\n<h3><strong>3.1 More Flexibility, Less Stiffness&nbsp;<\/strong><\/h3>\n\n\n\n<p>Physically Yin Yoga is about releasing tension of the body. You benefit from gaining more flexibility as your deep connective tissue like fascia becomes smoother. Any pain in neck, shoulders, hips, or back may be dissolved by holding a neck releasing asana for a few minutes and breathing through the stretching discomfort.&nbsp;<\/p>\n\n\n\n<h3><strong>3.2 Improved Digestive System Functions<\/strong><\/h3>\n\n\n\n<p>You might not believe it, but some asanas are particularly helpful for your digestive system. If you feel queasy, bloated, or clogged, then Chris Su offers <a href=\"https:\/\/watch.tintyoga.com\/programs\/the-power-of-deep-and-mindful-relaxation?cid=248003&amp;permalink=p052_chris-su_session-02_1080p\">Yin Yoga poses<\/a> that foster the <strong>regulation of your stomach<\/strong> and intestines. As the practice is very calming, accumulated stress that you might feel in your gut through your adrenaline glands can decrease and further improve indigestion.&nbsp;<\/p>\n\n\n<span style=\"--tl-form-height-m:1213.05px;--tl-form-height-t:638.781px;--tl-form-height-d:638.781px;\" class=\"tl-placeholder-f-type-shortcode_158494 tl-preload-form\"><span><\/span><\/span>\n\n\n<h3><strong>3.3 Inner Balance and Resilience&nbsp;<\/strong><\/h3>\n\n\n\n<p>Another benefit of Yin Yoga is that it improves body awareness. Taking time to listen and feel the body and its sensations can help to discover blind spots within the body that you had been unaware of before. Holding a Yin Yoga pose for longer is a great opportunity to <strong>observe the mind<\/strong> and sharpen the self-perception. <\/p>\n\n\n\n<p>As some deep connective tissues may store emotions like anger, fear, and sadness, Yin Yoga can work to dissolve them and help to build up resilience for a stronger foundation by facing intense emotions. Thereby, the practice can help to re-establish inner peace and balance. <\/p>\n\n\n\n<p>If inner peace and balance prevail, it will be easier to face and handle challenging situations in the future. The regular practice will help <strong>recognize signals of stress<\/strong> from the body earlier as well as help to regenerate from negative emotions that reign the mind and therefore also the body. If you are curious to find out what Yin Yoga can do to you, sink onto your mat and flow through a Yin yoga sequence to relax and regenerate with Chris Su.&nbsp;<\/p>\n\n\n\n<!-- IMAGE 16:9 -->\n<div class=\"image-wrapper\">\n<div class=\"aspectratio\" data-ratio=\"16:9\" position=\"center\">\n  <div>\n   <a href=\"https:\/\/watch.tintyoga.com\/programs\/the-power-of-deep-and-mindful-relaxation?cid=247999&amp;permalink=p052_chris-su_session-06_1080p\"><img decoding=\"async\" src=\"https:\/\/tintyoga.com\/wp-content\/uploads\/2021\/12\/tint_magazine_Yin-Yoga_06_Chris-Su_Yin-for-regeneration.jpg\"><\/a>\n  <\/div>\n<\/div>\n\n<!-- CAPTION -->\n<p class=\"caption\">In stressful times, the mind and body need <a href=\"https:\/\/watch.tintyoga.com\/programs\/the-power-of-deep-and-mindful-relaxation?cid=247999&amp;permalink=p052_chris-su_session-06_1080p\">regeneration<\/a> to regain energy for our individual journeys to personal fulfillment and success. <i>Photo: TINT Instructor <a href=\"https:\/\/tintyoga.com\/instructors\/chris-su\/\">Chris Su<\/a><\/i>.<\/p>\n<\/div>\n\n\n\n<h2 id=\"4\">4. Which poses can be included into your Yin Yoga sequence?<\/h2>\n\n\n\n<p>Many Yin Yoga poses revolve around opening the hips, the thighs, and lengthening the spine. Nonetheless, some asanas also help to release tension in the feet, the chest, or the shoulders. In most Yin Yoga sequences, props are a prerequisite. <strong>Blankets, yoga blocks, pillows, bolsters<\/strong>, and other cushions help students to relax into an asana. In Reclining Hero Pose (Supta Virasana), for example, sitting on a higher pillow can decrease the stress on the knees. If bending down on the ground is too difficult, you could use cushions to lie back on, and rest your head even higher on another pillow. As an example, see below how in Cow Face pose (Gomukhasana) the head can be rested on a yoga block to easier relax into the pose.&nbsp;&nbsp;<\/p>\n\n\n\n<!-- IMAGE 16:9 -->\n<div class=\"image-wrapper\">\n<div class=\"aspectratio\" data-ratio=\"16:9\" position=\"center\">\n  <div>\n   <img decoding=\"async\" src=\"https:\/\/tintyoga.com\/wp-content\/uploads\/2021\/11\/tint_magazine_Yin_Yoga_08_props-1.jpg\">\n  <\/div>\n<\/div>\n\n<!-- CAPTION -->\n<p class=\"caption\">Very accepted: using as props like blocks and cushions for a comfortable feeling in a challenging asana.<i> Photo: TINT Instructor <a href=\"https:\/\/tintyoga.com\/instructors\/kat-fowler\/\">Kat Fowler<\/a><\/i>.<\/p>\n<\/div>\n\n\n\n<h3><strong>4.1 13 Asanas to Sequence a Yin Yoga Class<\/strong><\/h3>\n\n\n\n<p>To give you a head start and some ideas for your Yin Yoga sequence, we put together a list of thirteen common asanas. Always be aware of each of your students and their level of deep work. Be on your toes to <strong>assist them<\/strong> if they need more props in a position. Some students also appreciate your <a href=\"https:\/\/tintyoga.com\/magazine\/hands-on-yoga-adjustments\/\">gentle adjustment <\/a>and touch in certain positions to feel safer. It might be easier for them to let go of the tension that keeps them from lowering into a Yin Yoga pose if you gently stretch their shoulders, for example.&nbsp;<\/p>\n\n\n\n<ul><li>Toe squat (Vajrasana variation on toes)&nbsp;<\/li><li>Lizard pose (Utthan Pristhasana)<\/li><li>One-Legged King Pigeon pose (Eka Pada Rajakapotasana)<\/li><li>Cow Face pose (Gomukhasana)<\/li><li>Butterfly pose (Baddha Konasana)<\/li><li>Squat pose (Malasana)&nbsp;<\/li><li>Frog pose (Mandukasana)<\/li><li>Sphinx pose (Salamba Bhujangasana)&nbsp;<\/li><li>Melting Heart \/ Puppy Dog pose (Anahatasana)<\/li><li>Cat Tail pose<\/li><li>Child’s pose (Balasana)<\/li><li>Thread the needle pose (Parsva Balasana)<\/li><li>Supine Pigeon Pose (Supta Kapotasana)<\/li><\/ul>\n\n\n\n<!-- IMAGE 16:9 -->\n<div class=\"image-wrapper\">\n<div class=\"aspectratio\" data-ratio=\"16:9\" position=\"center\">\n  <div>\n   <img decoding=\"async\" src=\"https:\/\/tintyoga.com\/wp-content\/uploads\/2021\/11\/tint_magazine_Yin_Yoga_009_Ami-Norton-1.jpg\">\n  <\/div>\n<\/div>\n\n<!-- CAPTION -->\n<p class=\"caption\"><a href=\"https:\/\/tintyoga.com\/instructors\/ami-norton\/\">Ami Norton<\/a> exemplifies the deep stretch in One-Legged King Pigeon Pose.<\/p>\n<\/div>\n\n\n\n<h3><strong>4.2 Tips to Design Your Yin Yoga Sequence<\/strong><\/h3>\n\n\n\n<p><a href=\"https:\/\/yinyoga.com\/yinsights\/asanas\/\" target=\"_blank\" rel=\"noreferrer noopener\">Paul Grilley<\/a>, one of the yogis considered as the founders of Yin Yoga, once said: <\/p>\n\n\n\n<div class=\"quote-wrapper\">\n<p class=\"quote\">&#8220;The more yin your practice, the less variety is needed and the emphasis is placed on a few basic postures.&#8221;<\/p>\n<p class=\"quote-author\">– Paul Grilley.<\/p>\n<\/div>\n\n\n\n<p>Keep this in mind when you design your class. Below, you can find two possible examples how you might build your Yin Yoga sequence:<\/p>\n\n\n\n<ul><li>If you design a 60-minute Yin Yoga class, you may guide your students to <strong>hold an asana for 3 minutes<\/strong>. After a 5-minute introduction and centering, you pick max. 12 asanas to set up the class. In the end, ease them into a 5-minute Shavasana.&nbsp;&nbsp;<\/li><li>If you design a 90-minute Yin Yoga class, you may choose to <strong>hold a pose for 7 minutes<\/strong>. Take 5 minutes to center your students in the beginning. Then pick max. 10 asanas for the class. Give them 10 minutes in Shavasana to release any tension that might still be left.&nbsp;<\/li><\/ul>\n\n\n<span style=\"--tl-form-height-m:1213.05px;--tl-form-height-t:638.781px;--tl-form-height-d:638.781px;\" class=\"tl-placeholder-f-type-shortcode_158494 tl-preload-form\"><span><\/span><\/span>\n\n\n<p>You may also <strong>vary the length<\/strong> of holding certain positions. Some asanas like Child&#8217;s pose are most likely less exhausting than Dragon pose. Therefore, you might have your students stay in Child’s pose for 5 minutes, while you help them out of Dragon pose after 3 minutes. Remember these three aspects for your Yin Yoga sequence:<\/p>\n\n\n\n<ul><li>When you decide to guide your students into Pigeon pose, do not forget to do both sides. This will account for two asanas when you put together your Yin Yoga sequence.&nbsp;<\/li><li>Your students may need time to release a pose before they move into the next asana. Rather than stressing from one Yin Yoga pose to the next, keep it calm and do not do all the asanas you prepared. <\/li><li>Of course, you do not have to stick to the minutes as you planned. Read your students. If you see them struggling too much or if they often come out of a pose earlier, then talk to them, receive feedback, and adjust your teaching accordingly. <\/li><\/ul>\n\n\n\n<h3><strong>4.3 Yinvasana to End the Yoga Class<\/strong><\/h3>\n\n\n\n<p>Another great opportunity is to incorporate Yin Yoga poses into your Shavasana. This is also called Yinvasana. Instead of lying flat on your back, you move your body into an asana like Janu Sirsasana (Head to knee pose) and remain there while letting your body relax into the pose after your yoga practice like Hie Kim demonstrates in the <a href=\"https:\/\/watch.tintyoga.com\/programs\/calm-down-with-shavasana?categoryId=45413\">Shavasana Series<\/a>. Another great way to lead the students’ into a deeper relaxation during Shavasana or Yinvasana is by <strong>gently guiding their thoughts<\/strong>. Reciting or <a href=\"https:\/\/watch.tintyoga.com\/programs\/calm-down-with-shavasana?cid=2504615&amp;permalink=p267_09_connection-poem_calm-down-with-shavasana-e2a833\">reading poetry<\/a> like Hie Kim can inspire them to feel lyrical joy.&nbsp;<\/p>\n\n\n\n<!-- IMAGE 16:9 -->\n<div class=\"image-wrapper\">\n<div class=\"aspectratio\" data-ratio=\"16:9\" position=\"center\">\n  <div>\n   <a href=\"https:\/\/watch.tintyoga.com\/programs\/calm-down-with-shavasana?cid=2504626&amp;permalink=p267_14_leg-stretch-yinvasana_calm-down-with-shavasana-c4cd06\"><img decoding=\"async\" src=\"https:\/\/tintyoga.com\/wp-content\/uploads\/2021\/12\/tint_magazine_Yin-Yoga_12_Hie-Kim_Leg-Stretch.jpg\"><\/a>\n  <\/div>\n<\/div>\n\n<!-- CAPTION -->\n<p class=\"caption\"> <a href=\"https:\/\/tintyoga.com\/instructors\/hie-kim\/\">Hie Kim<\/a> closes his eyes to consciously feel the <a href=\"https:\/\/watch.tintyoga.com\/programs\/calm-down-with-shavasana?cid=2504626&amp;permalink=p267_14_leg-stretch-yinvasana_calm-down-with-shavasana-c4cd06\">Leg Stretch Yinvasana<\/a>.<\/p>\n<\/div>\n\n\n\n<p>As part of the series, Hie Kim offers four versions of how yoga students can approach and enjoy the release of Yinvasana. His calm voice soothes practitioners into either a <a href=\"https:\/\/watch.tintyoga.com\/programs\/calm-down-with-shavasana?cid=2504624&amp;permalink=p267_12_lying-twist-yinvasana_calm-down-with-shavasana-aaf4c2\">Lying Twist<\/a>, an Open Hips, a Leg Stretch, or a Neck Release Yinvasana. Join him to get your Yin Yoga experience and to <strong>calm down<\/strong>!&nbsp;<\/p>\n\n\n\n<!-- IMAGE 16:9 -->\n<div class=\"image-wrapper\">\n<div class=\"aspectratio\" data-ratio=\"16:9\" position=\"center\">\n  <div>\n   <a href=\"https:\/\/watch.tintyoga.com\/programs\/calm-down-with-shavasana?cid=2504624&amp;permalink=p267_12_lying-twist-yinvasana_calm-down-with-shavasana-aaf4c2\"><img decoding=\"async\" src=\"https:\/\/tintyoga.com\/wp-content\/uploads\/2021\/12\/tint_magazine_Yin-Yoga_11_Hie-Kim_Twist.jpg\"><\/a>\n  <\/div>\n<\/div>\n\n<!-- CAPTION -->\n<p class=\"caption\">Possibly one of the most relieving and calming asanas: Lying Twist. <i>Photo: TINT Instructor <a href=\"https:\/\/tintyoga.com\/instructors\/hie-kim\/\">Hie Kim<\/a><\/i>.<\/p>\n<\/div>\n\n\n\n<p><\/p>\n\n\n<span style=\"--tl-form-height-m:1213.05px;--tl-form-height-t:638.781px;--tl-form-height-d:638.781px;\" class=\"tl-placeholder-f-type-shortcode_158494 tl-preload-form\"><span><\/span><\/span>","protected":false},"excerpt":{"rendered":"<p>Yin Yoga poses is about releasing tension in the body – both physically and emotionally. The deep stretch helps to let go of blockages.<\/p>\n","protected":false},"author":16,"featured_media":158206,"comment_status":"closed","ping_status":"closed","sticky":false,"template":"","format":"standard","meta":{"_et_pb_use_builder":"","_et_pb_old_content":"","_et_gb_content_width":""},"categories":[132],"tags":[],"yoast_head":"<!-- This site is optimized with the Yoast SEO plugin v19.10 - https:\/\/yoast.com\/wordpress\/plugins\/seo\/ -->\n<title>Yin Yoga Poses to Release Emotional and Physical Blockages - TINT Yoga<\/title>\n<meta name=\"description\" content=\"Yin Yoga poses is about releasing tension in the body – both physically and emotionally. The deep stretch helps to let go of blockages.\" \/>\n<meta name=\"robots\" content=\"index, follow, max-snippet:-1, max-image-preview:large, max-video-preview:-1\" \/>\n<link rel=\"canonical\" href=\"https:\/\/tintyoga.com\/magazine\/yin-yoga-poses\/\" \/>\n<meta property=\"og:locale\" content=\"en_US\" \/>\n<meta property=\"og:type\" content=\"article\" \/>\n<meta property=\"og:title\" content=\"Yin Yoga Poses to Release Emotional and Physical Blockages - TINT Yoga\" \/>\n<meta property=\"og:description\" content=\"Yin Yoga poses is about releasing tension in the body – both physically and emotionally. The deep stretch helps to let go of blockages.\" \/>\n<meta property=\"og:url\" content=\"https:\/\/tintyoga.com\/magazine\/yin-yoga-poses\/\" \/>\n<meta property=\"og:site_name\" content=\"TINT Yoga\" \/>\n<meta property=\"article:publisher\" content=\"https:\/\/www.facebook.com\/tintyoga\/\" \/>\n<meta property=\"article:published_time\" content=\"2021-11-23T11:05:37+00:00\" \/>\n<meta property=\"article:modified_time\" content=\"2021-12-08T17:15:29+00:00\" \/>\n<meta property=\"og:image\" content=\"https:\/\/tintyoga.com\/wp-content\/uploads\/2020\/04\/new-logo_dark_4x1.png\" \/>\n\t<meta property=\"og:image:width\" content=\"1201\" \/>\n\t<meta property=\"og:image:height\" content=\"301\" \/>\n\t<meta property=\"og:image:type\" content=\"image\/png\" \/>\n<meta name=\"author\" content=\"Saskia\" \/>\n<meta name=\"twitter:card\" content=\"summary_large_image\" \/>\n<meta name=\"twitter:label1\" content=\"Written by\" \/>\n\t<meta name=\"twitter:data1\" content=\"Saskia\" \/>\n\t<meta name=\"twitter:label2\" content=\"Est. reading time\" \/>\n\t<meta name=\"twitter:data2\" content=\"14 minutes\" \/>\n<script type=\"application\/ld+json\" class=\"yoast-schema-graph\">{\"@context\":\"https:\/\/schema.org\",\"@graph\":[{\"@type\":\"Article\",\"@id\":\"https:\/\/tintyoga.com\/magazine\/yin-yoga-poses\/#article\",\"isPartOf\":{\"@id\":\"https:\/\/tintyoga.com\/magazine\/yin-yoga-poses\/\"},\"author\":{\"name\":\"Saskia\",\"@id\":\"https:\/\/tintyoga.com\/#\/schema\/person\/448f6acd3a1c9b916bcf58f301c2a1f6\"},\"headline\":\"Yin Yoga Poses to Release Emotional and Physical Blockages\",\"datePublished\":\"2021-11-23T11:05:37+00:00\",\"dateModified\":\"2021-12-08T17:15:29+00:00\",\"mainEntityOfPage\":{\"@id\":\"https:\/\/tintyoga.com\/magazine\/yin-yoga-poses\/\"},\"wordCount\":2705,\"publisher\":{\"@id\":\"https:\/\/tintyoga.com\/#organization\"},\"articleSection\":[\"Yoga Styles\"],\"inLanguage\":\"en-US\"},{\"@type\":\"WebPage\",\"@id\":\"https:\/\/tintyoga.com\/magazine\/yin-yoga-poses\/\",\"url\":\"https:\/\/tintyoga.com\/magazine\/yin-yoga-poses\/\",\"name\":\"Yin Yoga Poses to Release Emotional and Physical Blockages - TINT Yoga\",\"isPartOf\":{\"@id\":\"https:\/\/tintyoga.com\/#website\"},\"datePublished\":\"2021-11-23T11:05:37+00:00\",\"dateModified\":\"2021-12-08T17:15:29+00:00\",\"description\":\"Yin Yoga poses is about releasing tension in the body – both physically and emotionally. The deep stretch helps to let go of blockages.\",\"breadcrumb\":{\"@id\":\"https:\/\/tintyoga.com\/magazine\/yin-yoga-poses\/#breadcrumb\"},\"inLanguage\":\"en-US\",\"potentialAction\":[{\"@type\":\"ReadAction\",\"target\":[\"https:\/\/tintyoga.com\/magazine\/yin-yoga-poses\/\"]}]},{\"@type\":\"BreadcrumbList\",\"@id\":\"https:\/\/tintyoga.com\/magazine\/yin-yoga-poses\/#breadcrumb\",\"itemListElement\":[{\"@type\":\"ListItem\",\"position\":1,\"name\":\"Home\",\"item\":\"https:\/\/tintyoga.com\/\"},{\"@type\":\"ListItem\",\"position\":2,\"name\":\"Yin Yoga Poses to Release Emotional and Physical Blockages\"}]},{\"@type\":\"WebSite\",\"@id\":\"https:\/\/tintyoga.com\/#website\",\"url\":\"https:\/\/tintyoga.com\/\",\"name\":\"TINT Yoga\",\"description\":\"TINT Yoga offers premium online yoga classes with the world&#039;s most popular yoga and movement instructors. Learn and work out with our online yoga videos.\",\"publisher\":{\"@id\":\"https:\/\/tintyoga.com\/#organization\"},\"potentialAction\":[{\"@type\":\"SearchAction\",\"target\":{\"@type\":\"EntryPoint\",\"urlTemplate\":\"https:\/\/tintyoga.com\/?s={search_term_string}\"},\"query-input\":\"required name=search_term_string\"}],\"inLanguage\":\"en-US\"},{\"@type\":\"Organization\",\"@id\":\"https:\/\/tintyoga.com\/#organization\",\"name\":\"TINT Yoga\",\"url\":\"https:\/\/tintyoga.com\/\",\"logo\":{\"@type\":\"ImageObject\",\"inLanguage\":\"en-US\",\"@id\":\"https:\/\/tintyoga.com\/#\/schema\/logo\/image\/\",\"url\":\"https:\/\/tintyoga.com\/wp-content\/uploads\/2021\/08\/logo_color_black.png\",\"contentUrl\":\"https:\/\/tintyoga.com\/wp-content\/uploads\/2021\/08\/logo_color_black.png\",\"width\":1001,\"height\":301,\"caption\":\"TINT Yoga\"},\"image\":{\"@id\":\"https:\/\/tintyoga.com\/#\/schema\/logo\/image\/\"},\"sameAs\":[\"https:\/\/www.instagram.com\/tint_yoga\/\",\"https:\/\/de.linkedin.com\/company\/tint-gmbh\",\"https:\/\/www.pinterest.de\/tintyoga\/\",\"https:\/\/www.youtube.com\/channel\/UC2HjTe0TL20qSk8e3s1d0DA\",\"https:\/\/www.facebook.com\/tintyoga\/\"]},{\"@type\":\"Person\",\"@id\":\"https:\/\/tintyoga.com\/#\/schema\/person\/448f6acd3a1c9b916bcf58f301c2a1f6\",\"name\":\"Saskia\",\"image\":{\"@type\":\"ImageObject\",\"inLanguage\":\"en-US\",\"@id\":\"https:\/\/tintyoga.com\/#\/schema\/person\/image\/\",\"url\":\"https:\/\/secure.gravatar.com\/avatar\/735ffa77aab5583689884ebd46803b82?s=96&d=mm&r=g\",\"contentUrl\":\"https:\/\/secure.gravatar.com\/avatar\/735ffa77aab5583689884ebd46803b82?s=96&d=mm&r=g\",\"caption\":\"Saskia\"},\"url\":\"https:\/\/tintyoga.com\/magazine\/author\/saskia\/\"}]}<\/script>\n<!-- \/ Yoast SEO plugin. -->","yoast_head_json":{"title":"Yin Yoga Poses to Release Emotional and Physical Blockages - TINT Yoga","description":"Yin Yoga poses is about releasing tension in the body – both physically and emotionally. The deep stretch helps to let go of blockages.","robots":{"index":"index","follow":"follow","max-snippet":"max-snippet:-1","max-image-preview":"max-image-preview:large","max-video-preview":"max-video-preview:-1"},"canonical":"https:\/\/tintyoga.com\/magazine\/yin-yoga-poses\/","og_locale":"en_US","og_type":"article","og_title":"Yin Yoga Poses to Release Emotional and Physical Blockages - TINT Yoga","og_description":"Yin Yoga poses is about releasing tension in the body – both physically and emotionally. The deep stretch helps to let go of blockages.","og_url":"https:\/\/tintyoga.com\/magazine\/yin-yoga-poses\/","og_site_name":"TINT Yoga","article_publisher":"https:\/\/www.facebook.com\/tintyoga\/","article_published_time":"2021-11-23T11:05:37+00:00","article_modified_time":"2021-12-08T17:15:29+00:00","og_image":[{"width":1201,"height":301,"url":"https:\/\/tintyoga.com\/wp-content\/uploads\/2020\/04\/new-logo_dark_4x1.png","type":"image\/png"}],"author":"Saskia","twitter_card":"summary_large_image","twitter_misc":{"Written by":"Saskia","Est. reading time":"14 minutes"},"schema":{"@context":"https:\/\/schema.org","@graph":[{"@type":"Article","@id":"https:\/\/tintyoga.com\/magazine\/yin-yoga-poses\/#article","isPartOf":{"@id":"https:\/\/tintyoga.com\/magazine\/yin-yoga-poses\/"},"author":{"name":"Saskia","@id":"https:\/\/tintyoga.com\/#\/schema\/person\/448f6acd3a1c9b916bcf58f301c2a1f6"},"headline":"Yin Yoga Poses to Release Emotional and Physical Blockages","datePublished":"2021-11-23T11:05:37+00:00","dateModified":"2021-12-08T17:15:29+00:00","mainEntityOfPage":{"@id":"https:\/\/tintyoga.com\/magazine\/yin-yoga-poses\/"},"wordCount":2705,"publisher":{"@id":"https:\/\/tintyoga.com\/#organization"},"articleSection":["Yoga Styles"],"inLanguage":"en-US"},{"@type":"WebPage","@id":"https:\/\/tintyoga.com\/magazine\/yin-yoga-poses\/","url":"https:\/\/tintyoga.com\/magazine\/yin-yoga-poses\/","name":"Yin Yoga Poses to Release Emotional and Physical Blockages - TINT Yoga","isPartOf":{"@id":"https:\/\/tintyoga.com\/#website"},"datePublished":"2021-11-23T11:05:37+00:00","dateModified":"2021-12-08T17:15:29+00:00","description":"Yin Yoga poses is about releasing tension in the body – both physically and emotionally. The deep stretch helps to let go of blockages.","breadcrumb":{"@id":"https:\/\/tintyoga.com\/magazine\/yin-yoga-poses\/#breadcrumb"},"inLanguage":"en-US","potentialAction":[{"@type":"ReadAction","target":["https:\/\/tintyoga.com\/magazine\/yin-yoga-poses\/"]}]},{"@type":"BreadcrumbList","@id":"https:\/\/tintyoga.com\/magazine\/yin-yoga-poses\/#breadcrumb","itemListElement":[{"@type":"ListItem","position":1,"name":"Home","item":"https:\/\/tintyoga.com\/"},{"@type":"ListItem","position":2,"name":"Yin Yoga Poses to Release Emotional and Physical Blockages"}]},{"@type":"WebSite","@id":"https:\/\/tintyoga.com\/#website","url":"https:\/\/tintyoga.com\/","name":"TINT Yoga","description":"TINT Yoga offers premium online yoga classes with the world&#039;s most popular yoga and movement instructors. Learn and work out with our online yoga videos.","publisher":{"@id":"https:\/\/tintyoga.com\/#organization"},"potentialAction":[{"@type":"SearchAction","target":{"@type":"EntryPoint","urlTemplate":"https:\/\/tintyoga.com\/?s={search_term_string}"},"query-input":"required name=search_term_string"}],"inLanguage":"en-US"},{"@type":"Organization","@id":"https:\/\/tintyoga.com\/#organization","name":"TINT Yoga","url":"https:\/\/tintyoga.com\/","logo":{"@type":"ImageObject","inLanguage":"en-US","@id":"https:\/\/tintyoga.com\/#\/schema\/logo\/image\/","url":"https:\/\/tintyoga.com\/wp-content\/uploads\/2021\/08\/logo_color_black.png","contentUrl":"https:\/\/tintyoga.com\/wp-content\/uploads\/2021\/08\/logo_color_black.png","width":1001,"height":301,"caption":"TINT Yoga"},"image":{"@id":"https:\/\/tintyoga.com\/#\/schema\/logo\/image\/"},"sameAs":["https:\/\/www.instagram.com\/tint_yoga\/","https:\/\/de.linkedin.com\/company\/tint-gmbh","https:\/\/www.pinterest.de\/tintyoga\/","https:\/\/www.youtube.com\/channel\/UC2HjTe0TL20qSk8e3s1d0DA","https:\/\/www.facebook.com\/tintyoga\/"]},{"@type":"Person","@id":"https:\/\/tintyoga.com\/#\/schema\/person\/448f6acd3a1c9b916bcf58f301c2a1f6","name":"Saskia","image":{"@type":"ImageObject","inLanguage":"en-US","@id":"https:\/\/tintyoga.com\/#\/schema\/person\/image\/","url":"https:\/\/secure.gravatar.com\/avatar\/735ffa77aab5583689884ebd46803b82?s=96&d=mm&r=g","contentUrl":"https:\/\/secure.gravatar.com\/avatar\/735ffa77aab5583689884ebd46803b82?s=96&d=mm&r=g","caption":"Saskia"},"url":"https:\/\/tintyoga.com\/magazine\/author\/saskia\/"}]}},"acf":[],"_links":{"self":[{"href":"https:\/\/tintyoga.com\/wp-json\/wp\/v2\/posts\/157298"}],"collection":[{"href":"https:\/\/tintyoga.com\/wp-json\/wp\/v2\/posts"}],"about":[{"href":"https:\/\/tintyoga.com\/wp-json\/wp\/v2\/types\/post"}],"author":[{"embeddable":true,"href":"https:\/\/tintyoga.com\/wp-json\/wp\/v2\/users\/16"}],"replies":[{"embeddable":true,"href":"https:\/\/tintyoga.com\/wp-json\/wp\/v2\/comments?post=157298"}],"version-history":[{"count":63,"href":"https:\/\/tintyoga.com\/wp-json\/wp\/v2\/posts\/157298\/revisions"}],"predecessor-version":[{"id":158670,"href":"https:\/\/tintyoga.com\/wp-json\/wp\/v2\/posts\/157298\/revisions\/158670"}],"wp:featuredmedia":[{"embeddable":true,"href":"https:\/\/tintyoga.com\/wp-json\/wp\/v2\/media\/158206"}],"wp:attachment":[{"href":"https:\/\/tintyoga.com\/wp-json\/wp\/v2\/media?parent=157298"}],"wp:term":[{"taxonomy":"category","embeddable":true,"href":"https:\/\/tintyoga.com\/wp-json\/wp\/v2\/categories?post=157298"},{"taxonomy":"post_tag","embeddable":true,"href":"https:\/\/tintyoga.com\/wp-json\/wp\/v2\/tags?post=157298"}],"curies":[{"name":"wp","href":"https:\/\/api.w.org\/{rel}","templated":true}]}}