{"id":157825,"date":"2021-12-03T14:40:43","date_gmt":"2021-12-03T13:40:43","guid":{"rendered":"https:\/\/tintyoga.com\/?p=157825"},"modified":"2021-12-09T14:51:14","modified_gmt":"2021-12-09T13:51:14","slug":"savasana","status":"publish","type":"post","link":"https:\/\/tintyoga.com\/magazine\/savasana\/","title":{"rendered":"Why Would You Want to Skip Savasana?"},"content":{"rendered":"\n<p class=\"intro-text\">When it comes to <strong>the final relaxation Savasana<\/strong>&nbsp; – also spelled Shavasana – many yoga teachers experience the same: It doesn’t matter how early the class starts and whether the class ends on time, there will always be one or two students who leave before Savasana.<\/p>\n\n\n\n<p>And it may seem like a smart idea to skip the final 10 minutes of class to get in the shower before everyone else or to head out of the studio before the big rush starts.&nbsp;<\/p>\n\n\n\n<p>However, most yoga teachers say that <strong>Savasana is the most important pose <\/strong>of the yoga class and should never be skipped. But is that true? What does Savasana mean? Why do we actually practice Savasana? And what different possibilities are there for your final relaxation?<\/p>\n\n\n\n<div class=\"toc-wrapper\">\n<p>In this article, you&#8217;ll learn:<\/p>\n\n<ul class=\"fa-ul toc-list\">\n  <li>\n  <span class=\"fa-li\"><i class=\"fa fa-long-arrow-right\"><\/i><\/span>\n  <a href=\"#1\">1. What Is Savasana?<\/a><\/li>\n  <li>\n  <span class=\"fa-li\"><i class=\"fa fa-long-arrow-right\"><\/i><\/span>\n  <a href=\"#2\">2. Why Do We Practice Savasana?<\/a><\/li>\n  <li>\n  <span class=\"fa-li\"><i class=\"fa fa-long-arrow-right\"><\/i><\/span>\n  <a href=\"#3\">3. Five Alternative Ways of Practicing Savasana<\/a><\/li>\n<\/ul>\n<\/div>\n\n\n\n<div class=\"quote-wrapper\">\n<p class=\"quote\">&#8220;Savasana is being without was, being without will be. It is being without anyone who is.&#8221;<\/p>\n<p class=\"quote-author\">– B.K.S. Iyengar.<\/p>\n<\/div>\n\n\n\n<h1 id=\"1\">1. What is Savasana?<\/h1>\n\n\n\n<h2>1.1. The Meaning of Savasana&nbsp;<\/h2>\n\n\n\n<p>Savasana – or Shavasana – is the <strong>final relaxation pose <\/strong>usually practiced at the <a href=\"https:\/\/magazine.tintyoga.com\/yoga-cool-down\">end of a yoga class<\/a>. It probably is the first Sanskrit word learned by yoga students – and is often the only one they can remember.&nbsp;<\/p>\n\n\n\n<p>But what does Savasana actually mean? The word can be broken down into its two parts: <em>sava<\/em> meaning “corpse” and <em>asana<\/em> meaning “posture”. Hence its <strong>English name Corpse pose<\/strong>.<\/p>\n\n\n\n<p>The name refers to the <strong>state of calmness, rest, and relaxation<\/strong> that is the aim of this pose. Sometimes, this can even mean drifting away or napping when the well-exercised body and relaxed mind settle into the mat at the end of the yoga practice.<\/p>\n\n\n\n<p>To practice Corpse pose, close your eyes and breathe naturally. Allow this final relaxation asana to eliminate tension from the body. Ideally, you stay there for <strong>10 to 20 minutes<\/strong>. However, even a few minutes of Savasana are better than nothing and can already have tremendous benefits.<\/p>\n\n\n\n<p>Although Savasana might look like a nap at the end of the yoga practice, it actually is <strong>a fully conscious pose <\/strong>aimed at being awake, yet completely relaxed. Lying down on the back and relaxing body and mind allows yoga practitioners to fully assimilate the benefits of the asana practice.<\/p>\n\n\n\n<h2>1.2. Why Savasana Is the Hardest Yoga Pose<\/h2>\n\n\n\n<p>The complete stillness in mind and body makes Savasana for many people the easiest pose physically, but at the same time, the most challenging pose mentally and\/or emotionally. Maybe that’s why <strong>some yoga students are so tempted to skip Savasana<\/strong>.&nbsp;<\/p>\n\n\n\n<p>So, this final relaxation pose is intended to gradually relax one body part at a time, one muscle at a time, and one thought at a time. Practiced constantly over a longer period of time, relaxing in Corpse pose conditions the body to <a href=\"https:\/\/magazine.tintyoga.com\/yoga-for-stress-relief\" target=\"_blank\" rel=\"noreferrer noopener\">release stress<\/a>.<\/p>\n\n\n\n<p>However, many yoga practitioners have well exercised their bodies – as well as in their minds. This makes relaxing — even when you lie down — <strong>a seemingly impossible task<\/strong>.&nbsp;<\/p>\n\n\n\n<p>Therefore, it’s important to practice the more active asanas before attempting Savasana as they help the body to stretch and release tension in the muscles. Apart from that, the active asana practice helps relax the diaphragm to allow the breath to move freely.<\/p>\n\n\n\n<p>But here’s the thing: Even if your body is able to calm down, <strong>your mind may do quite the opposite<\/strong>. Suddenly, when you’re completely motionless on your mat, the thoughts in your head seem to whirl around like crazy.&nbsp;<\/p>\n\n\n\n<p>You may find yourself thinking:<\/p>\n\n\n\n<ul><li>Did I close the window at home?<\/li><li>What should I cook for dinner?<\/li><li>I have to send that email later.<\/li><li>Did I just snore?<\/li><li>I can’t get that song out of my head.<\/li><li>What time is it?<\/li><li>I hope I’ll catch the bus afterward.<\/li><li>Should I put my socks on?<\/li><\/ul>\n\n\n\n<p>Sounds familiar to you? Don’t worry. It’s totally normal for your mind to try to resist that state of deep relaxation. Savasana is the <strong>ultimate act of conscious surrender<\/strong> – and that it takes time and practice to learn to surrender.<\/p>\n\n\n<span style=\"--tl-form-height-m:1213.05px;--tl-form-height-t:638.781px;--tl-form-height-d:638.781px;\" class=\"tl-placeholder-f-type-shortcode_158494 tl-preload-form\"><span><\/span><\/span>\n\n\n<h1 id=\"2\">2. Why Do We Practice Savasana?<\/h1>\n\n\n\n<p>The main purpose of Savasana is to <strong>calm down the mind<\/strong>. While it is true that physical strain and engagement are great ways to calm down, ending a yoga class in Corpse pose is the most direct way to relax.&nbsp;&nbsp;<\/p>\n\n\n\n<p>The main tools used for this purpose are <strong>breath and awareness<\/strong>. The breath plays a crucial role for our mind and body. By consciously extending exhalation, for example, we can activate the parasympathetic nervous system, i.e. the part of our nervous system that is responsible for switching from the fight-or-flight mode into the rest-and-digest mode.&nbsp;<\/p>\n\n\n\n<p>The second element to calm down our mind is awareness. Our <strong>cognitive system<\/strong> is usually busy with reflecting, decision-making and planning. When we’re in these thought processes, we usually neglect awareness and mindfulness. <\/p>\n\n\n\n<p>Savasana can be used to consciously extend cognitive thought processes that <strong>focus on feeling and experiencing<\/strong>. This includes body scans, progressive muscle relaxation (PMR), traditional savasana meditations, and Yinvasana, which is a combination of Yin yoga and Savasana. These are just a few among many methods to focus on consciously experiencing – and thus enjoying – the present moment.&nbsp;<\/p>\n\n\n\n<p>However, one common misconception about Savasana is that it is always practiced in the same way. The truth is that <strong>it can be done in various ways<\/strong>. In his series <a href=\"https:\/\/watch.tintyoga.com\/programs\/calm-down-with-shavasana\">Calm Down with Shavasana<\/a>, TINT Instructor <a href=\"https:\/\/tintyoga.com\/instructors\/hie-kim\">Hie Kim<\/a> shows you how multifaceted the world of Savasana can be.&nbsp;<\/p>\n\n\n\n<p>He has put together a colorful collection of <strong>beautiful Shavasana sequences<\/strong> for you, which will give you the chance to find balance amidst the stress of everyday life.<\/p>\n\n\n\n<div class=\"video-wrapper\">\n<div class=\"video-wrapper-inner\">\n\n<!-- YOUTUBE VIDEO GOES HERE -->\n<iframe width=\"560\" height=\"315\" src=\"https:\/\/www.youtube.com\/embed\/AulW38XJ0ww\" frameborder=\"0\" allow=\"accelerometer; autoplay; encrypted-media; gyroscope; picture-in-picture\" allowfullscreen=\"\"><\/iframe>\n\n<!-- CAPTION -->\n<p class=\"caption\">In his series <a href=\"https:\/\/watch.tintyoga.com\/programs\/calm-down-with-shavasana\">Calm Down with Shavasana<\/a>, TINT Instructor <a href=\"https:\/\/tintyoga.com\/instructors\/hie-kim\">Hie Kim<\/a> shows you how multifaceted the world of Savasana can be.<\/p>\n\n<\/div>\n<\/div>\n\n\n\n<h2>2.1. The Benefits of Savasana&nbsp;<\/h2>\n\n\n\n<p>Since our world is moving so quickly, giving your body and mind a break in Savasana is a very valuable practice. While our society places more and more emphasis on speed and productivity, learning how to relax actually helps you <strong>become more productive<\/strong>.<\/p>\n\n\n\n<p>Regular practice of Savasana will help you <strong>train your ability to relax<\/strong>. This is not only an essential quality for meditation but it also completes the true yoga experience. Releasing your physical body in Corpse pose may even enable you to discover another part of yourself that is light and free.<\/p>\n\n\n\n<p>In addition, Savasana helps to <strong>balance our nervous system<\/strong>: while the asana practice is mostly designed to stimulate the body and even provide healthy stress, Savasana is the counterpart. It shifts the activity away from the sympathetic nervous system (responsible for our flight-or-fight reaction) to the parasympathetic (rest-and-digest) mode.<\/p>\n\n\n\n<p>This is very important because a state of hyperstimulation creates <a href=\"https:\/\/www.apa.org\/topics\/stress\/health\" target=\"_blank\" rel=\"noreferrer noopener\">stress<\/a> that can even lead to anxiety, fatigue, high blood pressure, and impact the immune system.&nbsp;<\/p>\n\n\n\n<p>Over time, Savasana teaches us to move from anxiety and hyper-stimulation to this state of down-regulation where digestion, the immune system, and other essential systems of <strong>the body can recalibrate and reset <\/strong>in order to work unimpededly and efficiently.<\/p>\n\n\n\n<p>As you can see, the <strong>benefits of Savasana<\/strong>, or Corpse pose, are numerous and include (but are not limited to):<\/p>\n\n\n\n<ul><li>Teaching muscles to release and, thus, reducing muscular tension;<\/li><li>Activating the parasympathetic nervous system and its relaxation response;<\/li><li>Reinforcing and integrating the experience of the preceding yoga class;<\/li><li>Increasing heart rate variability and, thus, resilience;<\/li><li>Lowering blood pressure and slowing down the heart rate;<\/li><li>Promoting better sleep;<\/li><li>Supporting immune system functionality;<\/li><\/ul>\n\n\n\n<p>and many more.&nbsp;<\/p>\n\n\n<span style=\"--tl-form-height-m:1213.05px;--tl-form-height-t:638.781px;--tl-form-height-d:638.781px;\" class=\"tl-placeholder-f-type-shortcode_158494 tl-preload-form\"><span><\/span><\/span>\n\n\n<h2>2.2. Six Tips for a Successful Savasana<\/h2>\n\n\n\n<p>Not every Savasana is the same. One day your mind is more restless than on the next day. Sometimes, you have no problem emptying your mind and sometimes it just feels impossible to do it at all.<\/p>\n\n\n\n<p>The trick is to <strong>not put too much pressure<\/strong> on yourself to stay focused. Here are <strong>six tips<\/strong> on how you can get the most out of your final relaxation.<\/p>\n\n\n\n<h3>Tip #1: Make Yourself Comfortable<\/h3>\n\n\n\n<p>Stretch out on your mat and make yourself really comfortable. If you want, you can even <strong>use bolsters, pillows, and blankets<\/strong> to find a relaxing position. You can also cover your eyes with an eye pillow or towel to help you withdraw your senses from the outside world.&nbsp;<\/p>\n\n\n\n<p>The more comfortable you are, the more easily you can surrender. The more you surrender, the more relaxed you will become. And the more relaxed you are, the greater the benefits of your Savasana.<\/p>\n\n\n\n<h3>Tip #2: Exhale Completely<\/h3>\n\n\n\n<p>Exhaling completely and audibly – maybe even with a sigh – signals to your body to <strong>let go and release<\/strong> into the pose. Therefore, this relieving breath also tells your parasympathetic nervous system to relax as you are safe and can just be as you are.<\/p>\n\n\n\n<h3>Tip #3: Scan Your Body&nbsp;<\/h3>\n\n\n\n<p>If you’re having trouble centering yourself, <strong>bring your awareness into your body<\/strong> by scanning it from bottom to top. Run through every single part of your body and check in with each individual muscle and limb to make sure that you don’t hold tension anywhere.<\/p>\n\n\n\n<p>Be particularly aware of possible tension hiding in the jaw, forehead, temples, and shoulders.<\/p>\n\n\n\n<h3>Tip #4: Let Go<\/h3>\n\n\n\n<p>Close your eyes – both physically and mentally. With every breath, sink a little bit deeper into your yoga mat.<\/p>\n\n\n\n<p>Some days, this will be easier than others, but that’s part of the practice. However restless your mind might be, s<strong>tay still and at ease<\/strong>. Simply trust that the breath will carry you to the next moment.&nbsp;<\/p>\n\n\n\n<p>Maybe, you even want to <strong>visualize<\/strong> how the earth beneath you supports you or how your body heavily sinks into the ground.&nbsp;<\/p>\n\n\n\n<p>Eventually, you will find some <strong>peaceful moments of quietness<\/strong> between your buzzing thoughts. Over time, these moments will become longer and more frequent, helping you to find more inner peace.<\/p>\n\n\n\n<h3>Tip #5: Be Patient With Yourself&nbsp;<\/h3>\n\n\n\n<p>We’ve all been there at least once: We fell asleep during Savasana. Note, however, that <strong>the final relaxation is not a time to sleep<\/strong>. If you have a tendency to fall asleep, this actually is a sign of over-exhaustion.&nbsp;<\/p>\n\n\n\n<p>In this case, the first step is to <strong>be compassionate with yourself<\/strong>. Acknowledge that your body needed some rest. Next time, make a conscious effort to stay awake. You could do this, for example, by connecting your awareness to one specific part of your body. Over time, you will be able to rest and release without falling asleep.<\/p>\n\n\n\n<h3>Tip #6: Adjust Yourself<\/h3>\n\n\n\n<p>You can make your Savasana even more enjoyable by bringing your body into the perfect position. To do so, <strong>lengthen your neck <\/strong>and lift the chin slightly. You want your neck to be wrinkle-free. This helps you to breathe better.&nbsp;<\/p>\n\n\n\n<p>Next, instead of just letting your feet fall outside, lift up one leg after another, lift up the buttock and inwardly rotate the thigh. Then, lengthen your leg before you let it drop to the ground again. This way, the legs will still fall outside, but you will have <strong>more space in your lower back<\/strong>.&nbsp;<\/p>\n\n\n\n<p>Apply the same actions to the <strong>shoulders and arms<\/strong>: Lift up one after the other, push the shoulder slightly outward and up. Internally rotate the arm and let it fall down on the mat. This gives you more space to breathe.&nbsp;<\/p>\n\n\n\n<p>And here’s an extra tip: Give your Savasana <strong>the same attention you would give to any other pose <\/strong>– say <a href=\"https:\/\/magazine.tintyoga.com\/downward-facing-dog-alignment\">Downward-Facing Dog<\/a>. If you continue to practice releasing tension and surrendering on the mat, it will become easier with time – just like any other pose gets easier with practice.<\/p>\n\n\n\n<!-- IMAGE 16:9 -->\n<div class=\"image-wrapper\">\n<div class=\"aspectratio\" data-ratio=\"16:9\" position=\"bottom\">\n  <div>\n   <img decoding=\"async\" src=\"https:\/\/tintyoga.com\/wp-content\/uploads\/2021\/12\/tint_magazine_savasana_young_ho_kim.jpeg\">\n  <\/div>\n<\/div>\n\n<!-- CAPTION -->\n<p class=\"caption\">Give your Savasana the same attention you&#8217;d give any other yoga pose. <i>Photo: TINT Instructor <a href=\"https:\/\/tintyoga.com\/instructors\/young-ho-kim\/\">Young Ho Kim<\/a><\/i>.<\/p>\n<\/div>\n\n\n\n<h1 id=\"3\">3. Five Alternative Ways of Practicing Savasana<\/h1>\n\n\n\n<p>There is no one-size-fits-all Savasana. So, the final relaxation part at the end of a yoga class can be as individual as the yoga teachers and students are. Here are some ideas on how you can bring some variety to your Savasana.&nbsp;&nbsp;&nbsp;&nbsp;<\/p>\n\n\n\n<h2>3.1. Guided Savasana<\/h2>\n\n\n\n<p>As most students will have trouble <a href=\"https:\/\/magazine.tintyoga.com\/quietening-our-thougths-through-meditation\/\">calming their minds<\/a> with nothing to focus on but their<strong> own body and breath<\/strong>, a great way to facilitate relaxation is a guided Savasana. This can include anything from breathing instructions, body-scan guidance, Yoga Nidra, or progressive muscle relaxation (PMR).<\/p>\n\n\n\n<p>The general intention is to aid the mind to stay alert by giving it an object of observation.<\/p>\n\n\n\n<p>In Hie Kim’s series “Calm Down With Savasana”, you’ll find four guided Savasana sessions each with a different focus.&nbsp;<\/p>\n\n\n\n<p>A great and quite <strong>easily accessible way is a body scan <\/strong>where you run your awareness through the entire body, focusing on individual parts of the body. In his <a href=\"https:\/\/www.youtube.com\/watch?v=JL3U65JZOMk&amp;t=1s\">5-Minute Body Journey<\/a>, Hie Kim gives you an idea of how to guide a body scan as an alternative to Savasana.<\/p>\n\n\n\n<!-- IMAGE 16:9 -->\n<div class=\"image-wrapper\">\n<div class=\"aspectratio\" data-ratio=\"16:9\" position=\"bottom\">\n  <div>\n   <a href=\"https:\/\/watch.tintyoga.com\/programs\/body-journey-5-min-shavasana\"><img decoding=\"async\" src=\"https:\/\/tintyoga.com\/wp-content\/uploads\/2021\/12\/tint_magazine_hie_kim_savasana_body_journey_en.jpg\"><\/a>\n  <\/div>\n<\/div>\n\n<!-- CAPTION -->\n<p class=\"caption\">Join Hie Kim for a <a href=\"https:\/\/watch.tintyoga.com\/programs\/body-journey-5-min-shavasana\">5-Minute Body Journey<\/a> on TINT.<\/p>\n<\/div>\n\n\n\n<h2>3.2. Savasana Meditation<\/h2>\n\n\n\n<p><a href=\"https:\/\/magazine.tintyoga.com\/yoga-meditation-a-practice-of-mindfulness\/\">Meditation<\/a> is a helpful tool to calm down the mind, reduce stress and anxiety, and promote well-being by <strong>activating the parasympathetic nervous system<\/strong>. Brain scans even showed that yoga and meditation can reduce the volume of the amygdala – our fear center located in the brain – on the right-hand side of the brain, which is more related to negative emotions such as anxiety. Researchers found that a consistent meditation practice can reduce fear-related amygdala activity.<\/p>\n\n\n\n<p>As it has almost the same goals as the final relaxation in Corpse pose, <strong>meditation is a great alternative <\/strong>to lying flat on the back.&nbsp;<\/p>\n\n\n\n<p>That is, while meditation is usually practiced in a <a href=\"https:\/\/magazine.tintyoga.com\/meditation-sitting-position\">seated position<\/a>, you can also lie down on the floor. However, this makes it harder to resist the temptation to fall asleep.&nbsp;<\/p>\n\n\n\n<p>In his Savasana series, Hie Kim provides you with two meditation sessions that can be practiced as an alternative to the traditional Savasana: A <a href=\"https:\/\/watch.tintyoga.com\/programs\/lunar-meditation-left-nostril-pranayama\">lunar meditation<\/a> and a <a href=\"https:\/\/watch.tintyoga.com\/programs\/solar-meditation-right-nostril-pranayama\">solar meditation<\/a> that help you change your energy level, depending on whether you want to up-scale or down-regulate your energy.&nbsp;<\/p>\n\n\n\n<!-- GALLERY 2x1 -->\n<div class=\"grid-wrapper\">\n<div class=\"grid-2x1-container\">\n\n<!-- Image 1 -->\n<div class=\"aspectratio\" data-ratio=\"16:9\"><div>\n<a href=\"https:\/\/watch.tintyoga.com\/programs\/lunar-meditation-left-nostril-pranayama\"><img decoding=\"async\" position=\"center\" src=\"https:\/\/tintyoga.com\/wp-content\/uploads\/2021\/12\/tint_magazine_hie_kim_savasana_lunar_meditation_en.jpg\"><\/a>\n<\/div><\/div>\n\n<!-- Image 2 -->\n<div class=\"aspectratio\" data-ratio=\"16:9\"><div>\n<a href=\"https:\/\/watch.tintyoga.com\/programs\/solar-meditation-right-nostril-pranayama\"><img decoding=\"async\" position=\"center\" src=\"https:\/\/tintyoga.com\/wp-content\/uploads\/2021\/12\/tint_magazine_hie_kim_savasana_solar_meditation_en.jpg\"><\/a>\n<\/div><\/div>\n\n<\/div>\n\n<!-- CAPTION -->\n<p class=\"caption\">Change your energy level with a <a href=\"https:\/\/watch.tintyoga.com\/programs\/lunar-meditation-left-nostril-pranayama\">Lunar Meditation<\/a> or a <a href=\"https:\/\/watch.tintyoga.com\/programs\/solar-meditation-right-nostril-pranayama\">Solar Mediation<\/a> on TINT.<\/p>\n<\/div>\n\n\n\n<h2>3.3. Savasana Readings &amp; Poems&nbsp;<\/h2>\n\n\n\n<p>If you’re a <a href=\"https:\/\/magazine.tintyoga.com\/successful-yoga-teacher\">yoga teacher<\/a>, a very special treat to <strong>win the hearts of your yoga students<\/strong> is by amplifying their final relaxation part with a poem or a little story. Of course, this should not be just any story. Ideally, you give them some food for thought or some comforting words to promote kindness and mindfulness.&nbsp;<\/p>\n\n\n\n<p>To get some inspiration on what to read to your students in Savasana, check out Hie Kim’s Savasana poems <a href=\"https:\/\/watch.tintyoga.com\/programs\/shavasana-poem-connection\">Connection<\/a> and <a href=\"https:\/\/watch.tintyoga.com\/programs\/shavasana-poem-blackout\">Black Out<\/a>.<\/p>\n\n\n\n<p>Of course, you can also read your own poems or inspirational stories and poetry you can find in books or on the internet. However, <strong>check the atmosphere in the yoga room <\/strong>first to get a feeling of whether your students are open to this.&nbsp;<\/p>\n\n\n\n<!-- GALLERY 2x1 -->\n<div class=\"grid-wrapper\">\n<div class=\"grid-2x1-container\">\n\n<!-- Image 1 -->\n<div class=\"aspectratio\" data-ratio=\"16:9\"><div>\n<a href=\"https:\/\/watch.tintyoga.com\/programs\/shavasana-poem-connection\"><img decoding=\"async\" position=\"center\" src=\"https:\/\/tintyoga.com\/wp-content\/uploads\/2021\/12\/tint_magazine_hie_kim_savasana_connection_en.jpg\"><\/a>\n<\/div><\/div>\n\n<!-- Image 2 -->\n<div class=\"aspectratio\" data-ratio=\"16:9\"><div>\n<a href=\"https:\/\/watch.tintyoga.com\/programs\/shavasana-poem-blackout\"><img decoding=\"async\" position=\"center\" src=\"https:\/\/tintyoga.com\/wp-content\/uploads\/2021\/12\/tint_magazine_hie_kim_savasana_black_out_en.jpg\"><\/a>\n<\/div><\/div>\n\n<\/div>\n\n<!-- CAPTION -->\n<p class=\"caption\">Get some inspiration for your Savasana readings in <a href=\"https:\/\/watch.tintyoga.com\/programs\/calm-down-with-shavasana\">Calm Down With Shavasana<\/a> on TINT.<\/p>\n<\/div>\n\n\n\n<h2>3.4. Savasana &amp; Pranayama<\/h2>\n\n\n\n<p>The breath is the only part of the vegetative nervous system that we can consciously control. As such, it allows us to access anything that usually lies beyond our control. Therefore, <strong>the breath is the most important internal tool<\/strong> that we can use to calm down our system. By using all our respiratory muscles, we can easily prolong the breath cycle and, thus, signal our body to calm down.&nbsp;<\/p>\n\n\n\n<p>This is why breathing exercises – called <a href=\"https:\/\/magazine.tintyoga.com\/pranayama-an-intro-to-the-power-of-yogic-breathing\/\">Pranayama<\/a> – are a great tool to enhance the benefits of Savasana. Experience the relaxing effect of Pranayama in Hie Kim’s <a href=\"https:\/\/watch.tintyoga.com\/programs\/the-3-phases-of-breath\">3 Phases of Breath<\/a> or <a href=\"https:\/\/watch.tintyoga.com\/programs\/7-second-breath-6-min-pranayama\">7-Second Breath<\/a>.&nbsp;<\/p>\n\n\n\n<!-- GALLERY 2x1 -->\n<div class=\"grid-wrapper\">\n<div class=\"grid-2x1-container\">\n\n<!-- Image 1 -->\n<div class=\"aspectratio\" data-ratio=\"16:9\"><div>\n<a href=\"https:\/\/watch.tintyoga.com\/programs\/the-3-phases-of-breath\"><img decoding=\"async\" position=\"center\" src=\"https:\/\/tintyoga.com\/wp-content\/uploads\/2021\/12\/tint_magazine_hie_kim_savasana_3phases_of_breath_en.jpg\"><\/a>\n<\/div><\/div>\n\n<!-- Image 2 -->\n<div class=\"aspectratio\" data-ratio=\"16:9\"><div>\n<a href=\"https:\/\/watch.tintyoga.com\/programs\/7-second-breath-6-min-pranayama\"><img decoding=\"async\" position=\"center\" src=\"https:\/\/tintyoga.com\/wp-content\/uploads\/2021\/12\/tint_magazine_hie_kim_savasana_7second_breath_en.jpg\"><\/a>\n<\/div><\/div>\n\n<\/div>\n\n<!-- CAPTION -->\n<p class=\"caption\">Pranayama – breathing exercises – are a great tool for your Savasana.<\/p>\n<\/div>\n\n\n\n<h2>3.5. Yinvasana&nbsp;<\/h2>\n\n\n\n<p>Yinvasana is a combination of <a href=\"https:\/\/tintyoga.com\/magazine\/yin-yoga-poses\">Yin yoga<\/a> and Savasana that can be practiced at the end of a yoga class. The slow and conscious movements help you to create a <strong>deep body-and-mind connection <\/strong>and release any remaining tension from the body. So, this is a great way to promote relaxation and let go.&nbsp;<\/p>\n\n\n\n<p>You can also create <strong>a very slow vinyasa flow<\/strong> with simple, repetitive movements to create a zen-like state of mind. This way, movement and breath are connected in one of the simplest, yet most beautiful ways. If you could use a little relaxation right now, roll out your yoga mat and flow through Hie Kim’s <a href=\"https:\/\/youtu.be\/mVTfsvR8eGc\">Super Slow Flow<\/a>. <\/p>\n\n\n\n<p>Happy Savasana!<\/p>\n\n\n\n<div class=\"video-wrapper\">\n<div class=\"video-wrapper-inner\">\n\n<!-- YOUTUBE VIDEO GOES HERE -->\n<iframe width=\"560\" height=\"315\" src=\"https:\/\/www.youtube.com\/embed\/mVTfsvR8eGc\" frameborder=\"0\" allow=\"accelerometer; autoplay; encrypted-media; gyroscope; picture-in-picture\" allowfullscreen=\"\"><\/iframe>\n\n<!-- CAPTION -->\n<p class=\"caption\">Practice a <a href=\"https:\/\/watch.tintyoga.com\/programs\/super-slow-shavasana-flow\">Super Slow Flow<\/a> as an alternative to Savasana at the end of your yoga class.<\/p>\n\n<\/div>\n<\/div>\n\n\n\n<p><em>Additional sources: Sciences of Yoga by Ann Swanson <\/em><\/p>\n\n\n<span style=\"--tl-form-height-m:1213.05px;--tl-form-height-t:638.781px;--tl-form-height-d:638.781px;\" class=\"tl-placeholder-f-type-shortcode_158494 tl-preload-form\"><span><\/span><\/span>","protected":false},"excerpt":{"rendered":"<p>When it comes to the final relaxation Savasana, many yoga teachers experience the same: There are always students who leave before Savasana. <\/p>\n","protected":false},"author":6,"featured_media":158293,"comment_status":"closed","ping_status":"closed","sticky":false,"template":"","format":"standard","meta":{"_et_pb_use_builder":"","_et_pb_old_content":"","_et_gb_content_width":""},"categories":[134],"tags":[],"yoast_head":"<!-- This site is optimized with the Yoast SEO plugin v19.10 - https:\/\/yoast.com\/wordpress\/plugins\/seo\/ -->\n<title>Why Would You Want to Skip Savasana? - TINT Yoga<\/title>\n<meta name=\"description\" content=\"When it comes to the final relaxation Savasana, many yoga teachers experience the same: There are always students who leave before Savasana.\" \/>\n<meta name=\"robots\" content=\"index, follow, max-snippet:-1, max-image-preview:large, max-video-preview:-1\" \/>\n<link rel=\"canonical\" href=\"https:\/\/tintyoga.com\/magazine\/savasana\/\" \/>\n<meta property=\"og:locale\" content=\"en_US\" \/>\n<meta property=\"og:type\" content=\"article\" \/>\n<meta property=\"og:title\" content=\"Why Would You Want to Skip Savasana? - TINT Yoga\" \/>\n<meta property=\"og:description\" content=\"When it comes to the final relaxation Savasana, many yoga teachers experience the same: There are always students who leave before Savasana.\" \/>\n<meta property=\"og:url\" content=\"https:\/\/tintyoga.com\/magazine\/savasana\/\" \/>\n<meta property=\"og:site_name\" content=\"TINT Yoga\" \/>\n<meta property=\"article:publisher\" content=\"https:\/\/www.facebook.com\/tintyoga\/\" \/>\n<meta property=\"article:published_time\" content=\"2021-12-03T13:40:43+00:00\" \/>\n<meta property=\"article:modified_time\" content=\"2021-12-09T13:51:14+00:00\" \/>\n<meta property=\"og:image\" content=\"https:\/\/tintyoga.com\/wp-content\/uploads\/2021\/12\/tint_magazine_savasana_header_v1.jpeg\" \/>\n\t<meta property=\"og:image:width\" content=\"1350\" \/>\n\t<meta property=\"og:image:height\" content=\"500\" \/>\n\t<meta property=\"og:image:type\" content=\"image\/jpeg\" \/>\n<meta name=\"author\" content=\"doreen\" \/>\n<meta name=\"twitter:card\" content=\"summary_large_image\" \/>\n<meta name=\"twitter:label1\" content=\"Written by\" \/>\n\t<meta name=\"twitter:data1\" content=\"doreen\" \/>\n\t<meta name=\"twitter:label2\" content=\"Est. reading time\" \/>\n\t<meta name=\"twitter:data2\" content=\"14 minutes\" \/>\n<script type=\"application\/ld+json\" class=\"yoast-schema-graph\">{\"@context\":\"https:\/\/schema.org\",\"@graph\":[{\"@type\":\"Article\",\"@id\":\"https:\/\/tintyoga.com\/magazine\/savasana\/#article\",\"isPartOf\":{\"@id\":\"https:\/\/tintyoga.com\/magazine\/savasana\/\"},\"author\":{\"name\":\"doreen\",\"@id\":\"https:\/\/tintyoga.com\/#\/schema\/person\/581877dfb2f1e012aa8f2a2a39a44c3b\"},\"headline\":\"Why Would You Want to Skip Savasana?\",\"datePublished\":\"2021-12-03T13:40:43+00:00\",\"dateModified\":\"2021-12-09T13:51:14+00:00\",\"mainEntityOfPage\":{\"@id\":\"https:\/\/tintyoga.com\/magazine\/savasana\/\"},\"wordCount\":2786,\"publisher\":{\"@id\":\"https:\/\/tintyoga.com\/#organization\"},\"articleSection\":[\"Mindfulness\"],\"inLanguage\":\"en-US\"},{\"@type\":\"WebPage\",\"@id\":\"https:\/\/tintyoga.com\/magazine\/savasana\/\",\"url\":\"https:\/\/tintyoga.com\/magazine\/savasana\/\",\"name\":\"Why Would You Want to Skip Savasana? - TINT Yoga\",\"isPartOf\":{\"@id\":\"https:\/\/tintyoga.com\/#website\"},\"datePublished\":\"2021-12-03T13:40:43+00:00\",\"dateModified\":\"2021-12-09T13:51:14+00:00\",\"description\":\"When it comes to the final relaxation Savasana, many yoga teachers experience the same: There are always students who leave before Savasana.\",\"breadcrumb\":{\"@id\":\"https:\/\/tintyoga.com\/magazine\/savasana\/#breadcrumb\"},\"inLanguage\":\"en-US\",\"potentialAction\":[{\"@type\":\"ReadAction\",\"target\":[\"https:\/\/tintyoga.com\/magazine\/savasana\/\"]}]},{\"@type\":\"BreadcrumbList\",\"@id\":\"https:\/\/tintyoga.com\/magazine\/savasana\/#breadcrumb\",\"itemListElement\":[{\"@type\":\"ListItem\",\"position\":1,\"name\":\"Home\",\"item\":\"https:\/\/tintyoga.com\/\"},{\"@type\":\"ListItem\",\"position\":2,\"name\":\"Why Would You Want to Skip Savasana?\"}]},{\"@type\":\"WebSite\",\"@id\":\"https:\/\/tintyoga.com\/#website\",\"url\":\"https:\/\/tintyoga.com\/\",\"name\":\"TINT Yoga\",\"description\":\"TINT Yoga offers premium online yoga classes with the world&#039;s most popular yoga and movement instructors. Learn and work out with our online yoga videos.\",\"publisher\":{\"@id\":\"https:\/\/tintyoga.com\/#organization\"},\"potentialAction\":[{\"@type\":\"SearchAction\",\"target\":{\"@type\":\"EntryPoint\",\"urlTemplate\":\"https:\/\/tintyoga.com\/?s={search_term_string}\"},\"query-input\":\"required name=search_term_string\"}],\"inLanguage\":\"en-US\"},{\"@type\":\"Organization\",\"@id\":\"https:\/\/tintyoga.com\/#organization\",\"name\":\"TINT Yoga\",\"url\":\"https:\/\/tintyoga.com\/\",\"logo\":{\"@type\":\"ImageObject\",\"inLanguage\":\"en-US\",\"@id\":\"https:\/\/tintyoga.com\/#\/schema\/logo\/image\/\",\"url\":\"https:\/\/tintyoga.com\/wp-content\/uploads\/2021\/08\/logo_color_black.png\",\"contentUrl\":\"https:\/\/tintyoga.com\/wp-content\/uploads\/2021\/08\/logo_color_black.png\",\"width\":1001,\"height\":301,\"caption\":\"TINT Yoga\"},\"image\":{\"@id\":\"https:\/\/tintyoga.com\/#\/schema\/logo\/image\/\"},\"sameAs\":[\"https:\/\/www.instagram.com\/tint_yoga\/\",\"https:\/\/de.linkedin.com\/company\/tint-gmbh\",\"https:\/\/www.pinterest.de\/tintyoga\/\",\"https:\/\/www.youtube.com\/channel\/UC2HjTe0TL20qSk8e3s1d0DA\",\"https:\/\/www.facebook.com\/tintyoga\/\"]},{\"@type\":\"Person\",\"@id\":\"https:\/\/tintyoga.com\/#\/schema\/person\/581877dfb2f1e012aa8f2a2a39a44c3b\",\"name\":\"doreen\",\"image\":{\"@type\":\"ImageObject\",\"inLanguage\":\"en-US\",\"@id\":\"https:\/\/tintyoga.com\/#\/schema\/person\/image\/\",\"url\":\"https:\/\/secure.gravatar.com\/avatar\/5ac132c6e49e85e81542f95a7a9e124e?s=96&d=mm&r=g\",\"contentUrl\":\"https:\/\/secure.gravatar.com\/avatar\/5ac132c6e49e85e81542f95a7a9e124e?s=96&d=mm&r=g\",\"caption\":\"doreen\"},\"url\":\"https:\/\/tintyoga.com\/magazine\/author\/doreen\/\"}]}<\/script>\n<!-- \/ Yoast SEO plugin. -->","yoast_head_json":{"title":"Why Would You Want to Skip Savasana? - TINT Yoga","description":"When it comes to the final relaxation Savasana, many yoga teachers experience the same: There are always students who leave before Savasana.","robots":{"index":"index","follow":"follow","max-snippet":"max-snippet:-1","max-image-preview":"max-image-preview:large","max-video-preview":"max-video-preview:-1"},"canonical":"https:\/\/tintyoga.com\/magazine\/savasana\/","og_locale":"en_US","og_type":"article","og_title":"Why Would You Want to Skip Savasana? - TINT Yoga","og_description":"When it comes to the final relaxation Savasana, many yoga teachers experience the same: There are always students who leave before Savasana.","og_url":"https:\/\/tintyoga.com\/magazine\/savasana\/","og_site_name":"TINT Yoga","article_publisher":"https:\/\/www.facebook.com\/tintyoga\/","article_published_time":"2021-12-03T13:40:43+00:00","article_modified_time":"2021-12-09T13:51:14+00:00","og_image":[{"width":1350,"height":500,"url":"https:\/\/tintyoga.com\/wp-content\/uploads\/2021\/12\/tint_magazine_savasana_header_v1.jpeg","type":"image\/jpeg"}],"author":"doreen","twitter_card":"summary_large_image","twitter_misc":{"Written by":"doreen","Est. reading time":"14 minutes"},"schema":{"@context":"https:\/\/schema.org","@graph":[{"@type":"Article","@id":"https:\/\/tintyoga.com\/magazine\/savasana\/#article","isPartOf":{"@id":"https:\/\/tintyoga.com\/magazine\/savasana\/"},"author":{"name":"doreen","@id":"https:\/\/tintyoga.com\/#\/schema\/person\/581877dfb2f1e012aa8f2a2a39a44c3b"},"headline":"Why Would You Want to Skip Savasana?","datePublished":"2021-12-03T13:40:43+00:00","dateModified":"2021-12-09T13:51:14+00:00","mainEntityOfPage":{"@id":"https:\/\/tintyoga.com\/magazine\/savasana\/"},"wordCount":2786,"publisher":{"@id":"https:\/\/tintyoga.com\/#organization"},"articleSection":["Mindfulness"],"inLanguage":"en-US"},{"@type":"WebPage","@id":"https:\/\/tintyoga.com\/magazine\/savasana\/","url":"https:\/\/tintyoga.com\/magazine\/savasana\/","name":"Why Would You Want to Skip Savasana? - TINT Yoga","isPartOf":{"@id":"https:\/\/tintyoga.com\/#website"},"datePublished":"2021-12-03T13:40:43+00:00","dateModified":"2021-12-09T13:51:14+00:00","description":"When it comes to the final relaxation Savasana, many yoga teachers experience the same: There are always students who leave before Savasana.","breadcrumb":{"@id":"https:\/\/tintyoga.com\/magazine\/savasana\/#breadcrumb"},"inLanguage":"en-US","potentialAction":[{"@type":"ReadAction","target":["https:\/\/tintyoga.com\/magazine\/savasana\/"]}]},{"@type":"BreadcrumbList","@id":"https:\/\/tintyoga.com\/magazine\/savasana\/#breadcrumb","itemListElement":[{"@type":"ListItem","position":1,"name":"Home","item":"https:\/\/tintyoga.com\/"},{"@type":"ListItem","position":2,"name":"Why Would You Want to Skip Savasana?"}]},{"@type":"WebSite","@id":"https:\/\/tintyoga.com\/#website","url":"https:\/\/tintyoga.com\/","name":"TINT Yoga","description":"TINT Yoga offers premium online yoga classes with the world&#039;s most popular yoga and movement instructors. Learn and work out with our online yoga videos.","publisher":{"@id":"https:\/\/tintyoga.com\/#organization"},"potentialAction":[{"@type":"SearchAction","target":{"@type":"EntryPoint","urlTemplate":"https:\/\/tintyoga.com\/?s={search_term_string}"},"query-input":"required name=search_term_string"}],"inLanguage":"en-US"},{"@type":"Organization","@id":"https:\/\/tintyoga.com\/#organization","name":"TINT Yoga","url":"https:\/\/tintyoga.com\/","logo":{"@type":"ImageObject","inLanguage":"en-US","@id":"https:\/\/tintyoga.com\/#\/schema\/logo\/image\/","url":"https:\/\/tintyoga.com\/wp-content\/uploads\/2021\/08\/logo_color_black.png","contentUrl":"https:\/\/tintyoga.com\/wp-content\/uploads\/2021\/08\/logo_color_black.png","width":1001,"height":301,"caption":"TINT Yoga"},"image":{"@id":"https:\/\/tintyoga.com\/#\/schema\/logo\/image\/"},"sameAs":["https:\/\/www.instagram.com\/tint_yoga\/","https:\/\/de.linkedin.com\/company\/tint-gmbh","https:\/\/www.pinterest.de\/tintyoga\/","https:\/\/www.youtube.com\/channel\/UC2HjTe0TL20qSk8e3s1d0DA","https:\/\/www.facebook.com\/tintyoga\/"]},{"@type":"Person","@id":"https:\/\/tintyoga.com\/#\/schema\/person\/581877dfb2f1e012aa8f2a2a39a44c3b","name":"doreen","image":{"@type":"ImageObject","inLanguage":"en-US","@id":"https:\/\/tintyoga.com\/#\/schema\/person\/image\/","url":"https:\/\/secure.gravatar.com\/avatar\/5ac132c6e49e85e81542f95a7a9e124e?s=96&d=mm&r=g","contentUrl":"https:\/\/secure.gravatar.com\/avatar\/5ac132c6e49e85e81542f95a7a9e124e?s=96&d=mm&r=g","caption":"doreen"},"url":"https:\/\/tintyoga.com\/magazine\/author\/doreen\/"}]}},"acf":[],"_links":{"self":[{"href":"https:\/\/tintyoga.com\/wp-json\/wp\/v2\/posts\/157825"}],"collection":[{"href":"https:\/\/tintyoga.com\/wp-json\/wp\/v2\/posts"}],"about":[{"href":"https:\/\/tintyoga.com\/wp-json\/wp\/v2\/types\/post"}],"author":[{"embeddable":true,"href":"https:\/\/tintyoga.com\/wp-json\/wp\/v2\/users\/6"}],"replies":[{"embeddable":true,"href":"https:\/\/tintyoga.com\/wp-json\/wp\/v2\/comments?post=157825"}],"version-history":[{"count":33,"href":"https:\/\/tintyoga.com\/wp-json\/wp\/v2\/posts\/157825\/revisions"}],"predecessor-version":[{"id":158837,"href":"https:\/\/tintyoga.com\/wp-json\/wp\/v2\/posts\/157825\/revisions\/158837"}],"wp:featuredmedia":[{"embeddable":true,"href":"https:\/\/tintyoga.com\/wp-json\/wp\/v2\/media\/158293"}],"wp:attachment":[{"href":"https:\/\/tintyoga.com\/wp-json\/wp\/v2\/media?parent=157825"}],"wp:term":[{"taxonomy":"category","embeddable":true,"href":"https:\/\/tintyoga.com\/wp-json\/wp\/v2\/categories?post=157825"},{"taxonomy":"post_tag","embeddable":true,"href":"https:\/\/tintyoga.com\/wp-json\/wp\/v2\/tags?post=157825"}],"curies":[{"name":"wp","href":"https:\/\/api.w.org\/{rel}","templated":true}]}}