{"id":159353,"date":"2022-01-14T14:33:12","date_gmt":"2022-01-14T13:33:12","guid":{"rendered":"https:\/\/tintyoga.com\/?p=159353"},"modified":"2022-03-09T16:25:35","modified_gmt":"2022-03-09T15:25:35","slug":"yoga-therapy","status":"publish","type":"post","link":"https:\/\/tintyoga.com\/magazine\/yoga-therapy\/","title":{"rendered":"Yoga Therapy – A Practice for the Sick and Feeble?"},"content":{"rendered":"\n<p class=\"intro-text\">Traditionally, <strong>yoga<\/strong> was not primarily intended as a <strong>therapeutic<\/strong> practice or <strong>therapy<\/strong> for injured or sick persons. It was rather for healthy people who were interested in, and capable of, improving their general health and fitness as well as their mental well-being.<\/p>\n\n\n\n<p>While yoga is <strong>neither physical nor psychological therapy<\/strong>, many yoga practices contain therapeutic elements. However, it’s mainly a tradition of psycho-spiritual growth leading to inner peace and freedom.&nbsp;<\/p>\n\n\n\n<p>In Western societies, yoga is nowadays almost universally pursued as a health fitness routine that <strong>has proven to be highly effective <\/strong>and is, thus, discovered by more and more people. And quite a few practitioners turn to yoga for therapeutic purposes – be it to <a href=\"https:\/\/watch.tintyoga.com\/search?custom_fields=%7B%22custom_field_5271%22%3A%228%22%7D\">soothe physical pain<\/a> or overcome mental challenges such as stress or anxiety. But what is therapeutic yoga actually? And how is it different from ‘regular’ yoga?<\/p>\n\n\n\n<div class=\"toc-wrapper\">\n<p>Table of Contents<\/p>\n\n<ul class=\"fa-ul toc-list\">\n  <li>\n  <span class=\"fa-li\"><i class=\"fa fa-long-arrow-right\"><\/i><\/span>\n  <a href=\"#1\">1. What Is Therapeutic Yoga?<\/a><\/li>\n  <li>\n  <span class=\"fa-li\"><i class=\"fa fa-long-arrow-right\"><\/i><\/span>\n  <a href=\"#2\">2. Difference Between Therapeutic Yoga and Yoga<\/a><\/li>\n  <li>\n  <span class=\"fa-li\"><i class=\"fa fa-long-arrow-right\"><\/i><\/span>\n  <a href=\"#3\">3. What Does a Yoga Therapist Do?<\/a><\/li>\n  <li>\n  <span class=\"fa-li\"><i class=\"fa fa-long-arrow-right\"><\/i><\/span>\n  <a href=\"#4\">4. How Does Yoga Therapy Work?<\/a><\/li>\n  <li>\n  <span class=\"fa-li\"><i class=\"fa fa-long-arrow-right\"><\/i><\/span>\n  <a href=\"#5\">5. Conclusion: Is Yoga Therapy an Alternative to Medical Treatment?<\/a><\/li>\n<\/ul>\n<\/div>\n\n\n\n<h1 id=\"1\">1.&nbsp;What Is Therapeutic Yoga?<\/h1>\n\n\n\n<p>Yoga therapy or therapeutic yoga is a form of therapy that applies yoga practices to <strong>improve mental and physical health<\/strong>. While yoga is generally associated with stress relief, yoga therapy, in particular, can help to treat several other mental health conditions. As such, it can even be applied in combination with other types of therapy.<\/p>\n\n\n\n<p>The <a href=\"https:\/\/www.iayt.org\/\" target=\"_blank\" rel=\"noreferrer noopener\">International Association of Yoga Therapists<\/a> (IAYT), which is responsible for certifying yoga therapists and accrediting yoga therapy schools, defines the term <em>yoga therapy<\/em> as follows:&nbsp;<\/p>\n\n\n\n<div class=\"quote-wrapper\">\n<p class=\"quote\">&#8220;Yoga therapy is the professional application of the principles and practices of yoga to promote health and well-being within a therapeutic relationship that includes personalized assessment, goal setting, lifestyle management, and yoga practices for individuals or small groups.&#8221;<\/p>\n<p class=\"quote-author\">– International Association of Yoga Therapists.<\/p>\n<\/div>\n\n\n\n<p><a href=\"https:\/\/watch.tintyoga.com\/search?custom_fields=%7B%22custom_field_5271%22%3A%228%22%7D\">Therapeutic yoga<\/a> includes techniques and practices that <strong>support the body to deal with physical issues<\/strong> such as tension, pains and aches and – to a certain degree – injuries. The aim is to release tension and relieve the body from unpleasant sensations. Instead of flowing through powerful <a href=\"https:\/\/tools.tintyoga.com\/\">sequences<\/a>, the focus rather is on static poses. These poses target specific body parts and areas of the body to strengthen and lengthen them in order to achieve long-term benefits and increase overall well-being.<\/p>\n\n\n\n<p>In summary, yoga therapy is intended as a <strong>preventative, curative, or palliative practice<\/strong> – depending on the individual’s needs. Ideally, therapeutic yoga is an empowering experience that leaves practitioners with an increased feeling of overall well-being.<\/p>\n\n\n\n<!-- IMAGE 16:9 -->\n<div class=\"image-wrapper\">\n<div class=\"aspectratio\" data-ratio=\"16:9\" position=\"bottom\">\n  <div>\n   <img decoding=\"async\" src=\"https:\/\/tintyoga.com\/wp-content\/uploads\/2022\/01\/tint_magazine_Therapeutic-Yoga_Barbra-Noh.jpeg\">\n  <\/div>\n<\/div>\n\n<!-- CAPTION -->\n<p class=\"caption\">Learn a therapeutic approach to yoga in <a href=\"https:\/\/tintyoga.com\/instructors\/barbra-noh\/\">Barbra Noh<\/a>&#8216;s <a href=\"https:\/\/watch.tintyoga.com\/programs\/therapeutic-alignment-immersion\">Therapeutic Alignment Immersion<\/a> on TINT.<\/p>\n<\/div>\n\n\n\n<h1 id=\"1\">2.&nbsp;Difference Between Therapeutic Yoga and Yoga<\/h1>\n\n\n\n<p>Although yoga, in general, is intended to be therapeutic and healing, yoga therapy refers to the <strong>specific use of yogic practices<\/strong> aimed at alleviating the practitioners’ physical, mental, and emotional suffering. These tools include anything from yoga poses (<em>Asana<\/em>), breathing exercises (<a href=\"https:\/\/magazine.tintyoga.com\/pranayama-an-intro-to-the-power-of-yogic-breathing\/\"><em>Pranayama<\/em><\/a>), <a href=\"https:\/\/magazine.tintyoga.com\/quietening-our-thougths-through-meditation\/\">meditation<\/a>, and other physical exercises and <a href=\"https:\/\/magazine.tintyoga.com\/yoga-meditation-a-practice-of-mindfulness\/\">mindfulness<\/a> practices.<\/p>\n\n\n\n<p>If you compare a therapeutic yoga class to your average yoga class, you will certainly find some overlaps. However, there are also differences.&nbsp;<\/p>\n\n\n\n<h2>2.1. Therapeutic Yoga Clients vs. Yoga Students<\/h2>\n\n\n\n<p>While the aim of a ‘regular’ student in a ‘regular’ yoga class (note: We use the word ‘regular’ here in contrast to ‘therapeutic’.) usually is to stay healthy and fit, increase and maintain flexibility, or find mental and emotional balance, a student in a therapeutic yoga class will want to <strong>address specific physical, mental and\/or emotional needs<\/strong>.<\/p>\n\n\n\n<p>Thus, <strong>yoga therapy<\/strong> can be more specifically defined as “the process of empowering individuals to progress toward improved health and well-being through the application of the teachings and practices of yoga” (according to the IAYT).&nbsp;<\/p>\n\n\n\n<p>In contrast to the regular yoga student, who is usually in good health, yoga therapy clients usually have been <strong>diagnosed with a physical or mental health issue<\/strong>. In addition to other potential medical or therapeutic approaches, they are looking for complementary means to resolve their health problems.&nbsp;<\/p>\n\n\n\n<p>This is why yoga therapists usually spend a lot of time <strong>listening and observing their clients <\/strong>during practice. This way, they are able to find different ways to alleviate their clients’ symptoms and improve their body’s functionality.&nbsp;<\/p>\n\n\n\n<p>This means that yoga therapy includes yoga <strong>techniques that are tailored to the individual client <\/strong>so that they may practice them at their convenience. The intention behind this approach is to give yoga therapy students the feeling of self-efficacy, i.e. they learn that they are in control of their recovery instead of being at the mercy of their health condition.&nbsp;<\/p>\n\n\n\n<h2>2.2. Therapeutic Focus<\/h2>\n\n\n\n<p>You may have already noticed though that the difference between yoga and therapeutic yoga\/yoga therapy is not always that obvious. You may think that any time a person practices yoga in order to relieve or overcome a health condition, they practice yoga therapy.&nbsp;<\/p>\n\n\n\n<p>This is true to some extent as many yoga practitioners seek to <strong>improve their strength, flexibility, and overall well-being<\/strong>. More and more people also engage in yoga because they hope to manage or improve specific physical or mental health conditions. Nowadays, as the popularity of yoga rises on all continents of the world, it has become established in the public psyche that yoga can have significant <a href=\"https:\/\/www.ncbi.nlm.nih.gov\/pmc\/articles\/PMC3193654\/\" target=\"_blank\" rel=\"noreferrer noopener\">therapeutic benefits<\/a>.&nbsp;<\/p>\n\n\n\n<p>But therapeutic yoga goes beyond a ‘regular’ yoga practice. Yoga therapy applies yoga and mindfulness practices <strong>based on scientific research <\/strong>in order to offer a comprehensive, effective and efficient approach to alleviating health conditions.&nbsp;<\/p>\n\n\n\n<p>The aim of yoga therapy is to <strong>get a full picture of the clients’ symptoms <\/strong>that trouble them and, as a result, identify the most appropriate yogic methods to manage these symptoms. In many cases, this often goes along with other pharmaceutical and\/or therapeutic treatments.<\/p>\n\n\n\n<p>Yoga therapy also aims at empowering practitioners to <strong>overcome their health challenges<\/strong> by means of practices that they can easily integrate into their lives. This way, they gain independence as they are able to take a more active role in their self-care.&nbsp;<\/p>\n\n\n\n<h2>2.3. The Yoga Therapist’s Skill Set<\/h2>\n\n\n\n<p>Yoga therapy requires specialized training and <strong>a broad skill set <\/strong>in order to be able to build a strong relationship between the yoga therapy student (often referred to as ‘client’) and yoga therapy teacher (also referred to as ‘yoga therapist’). This is necessary in order to effect positive change for the client.<\/p>\n\n\n\n<p>Furthermore, yoga therapy combines <strong>knowledge from a variety of fields<\/strong>: from modern research in anatomy and physiology to medical studies, psychology, and yoga.<\/p>\n\n\n\n<p>It must be mentioned here that yoga, contrary to common belief, is not necessarily suitable for everyone. Or more specifically: <strong>Not every yoga practice is suitable for everyone<\/strong>. <\/p>\n\n\n\n<p>The truth is that many yoga poses that are taught in regular yoga classes <em>(check out a variety of them in our tool, the <a href=\"https:\/\/tools.tintyoga.com\/\">Yoga Sequence Builder<\/a>)<\/em> are contraindicated for people with health issues such as high blood pressure, heart disease, diabetes, asthma, or autoimmune diseases. The same goes for participants with physical ailments including serious posture imbalances, scoliosis, herniated discs, hip dysplasia, and others. <\/p>\n\n\n\n<p>What is more, yoga can also be counterproductive for people suffering from mental illnesses such as eating disorders, clinical depression, posttraumatic stress disorder (PTSD), and panic disorder if the teacher is not sufficiently trained.<\/p>\n\n\n\n<p>This is why the yoga therapist needs to have <strong>sound knowledge of modern medicine<\/strong> and <a href=\"https:\/\/tintyoga.com\/magazine\/overcoming-trauma-through-yoga\/\">trauma-informed psychology<\/a> in order to safely and effectively meet the yoga therapy students’ needs. In some cases, it may even be advisable to collaborate with other health practitioners to continuously develop yoga therapy as an adapted, safe and complementary treatment form.<\/p>\n\n\n\n<!-- IMAGE 16:9 -->\n<div class=\"image-wrapper\">\n<div class=\"aspectratio\" data-ratio=\"16:9\" position=\"bottom\">\n  <div>\n   <img decoding=\"async\" src=\"https:\/\/tintyoga.com\/wp-content\/uploads\/2022\/01\/tint_magazine_Therapeutic-Yoga_Young-Ho-Kim_EN.jpg\">\n  <\/div>\n<\/div>\n\n<!-- CAPTION -->\n<p class=\"caption\">TINT Instructor <a href=\"https:\/\/tintyoga.com\/instructors\/young-ho-kim\/\">Young Ho Kim<\/a> shows you therapeutic yoga poses to soothe <a href=\"https:\/\/watch.tintyoga.com\/programs\/yoga-for-neck-shoulders\">neck and shoulder pain<\/a>.<\/p>\n<\/div>\n\n\n\n<h2>2.4. Application of Therapeutic Yoga&nbsp;<\/h2>\n\n\n\n<p>With <strong>new insights and regular updates<\/strong> regarding new medical treatments for disease, yoga therapy also needs to continuously develop and adapt. For example, yoga inversions have long been considered the most important <em>Asanas<\/em> as they were thought to be beneficial for the brain as a preparation for meditation. Thanks to modern medical research and insights we know today that inversions can <a href=\"https:\/\/www.expandinglight.org\/free\/yoga-teacher\/articles\/general\/inversions-cardiovascular-heart.php\" target=\"_blank\" rel=\"noreferrer noopener\">cause a stroke<\/a> in people with a predisposition for cardiovascular diseases.&nbsp;<\/p>\n\n\n\n<p>In contrast to that, inversions have long been contraindicated for menstruating women as it was thought that the blood from the uterus may penetrate into other organs. Needless to say that this has also been proven wrong.<\/p>\n\n\n\n<p>This is why yoga therapy (and – to be frank – ANY yoga practice) <strong>demands a highly developed skill set<\/strong> including knowledge about a variety of contraindications, modifications, and variations that need to be implemented when working with clients with special needs due to, for example, obesity, elevated blood pressure, diabetics, herniated discs and other back problems, or a history of heart disease.<\/p>\n\n\n\n<p>In addition to that, yoga therapy also is both <strong>trauma-informed and trauma-sensitive<\/strong> based on the work of Bessel van der Kolk and other specialists in this field. This is why it can also be applied as a supplementary treatment in trauma therapy and to approach psychological and psycho-somatic ailments like depression, anxiety, and panic disorders or eating disorders.<\/p>\n\n\n<span style=\"--tl-form-height-m:1213.05px;--tl-form-height-t:638.781px;--tl-form-height-d:638.781px;\" class=\"tl-placeholder-f-type-shortcode_158494 tl-preload-form\"><span><\/span><\/span>\n\n\n<p><\/p>\n\n\n\n<h1 id=\"3\">3. What Does a Yoga Therapist Do?<\/h1>\n\n\n\n<p>As mentioned above, there is some overlap in the work of yoga teachers and yoga therapists, but each has a different focus and particular skill set.<\/p>\n\n\n\n<h2>3.1. Tailor-Made Training&nbsp;<\/h2>\n\n\n\n<p>While yoga teachers usually aim at delivering an overall yoga experience to their students, yoga therapists target their clients’ specific issues and support them with <strong>tailor-made techniques<\/strong> that contribute specifically to their physical, emotional, and\/or psychological health.&nbsp;<\/p>\n\n\n\n<p>Therapeutic yoga teachers need a <strong>more thorough and deeper training and academic work<\/strong> in order to gain the medical knowledge and psychotherapeutic skills required to meet people’s various health needs and to provide yogic techniques that are suitable for their clients’ health status.&nbsp;<\/p>\n\n\n\n<h2>3.2. Assessment and Individualised Treatment&nbsp;<\/h2>\n\n\n\n<p>While yoga therapy can be applied in a group setting or on a one-on-one basis, there are some basic steps any yoga therapist will need to follow. Typically, a yoga therapist will start by <strong>assessing their clients’ health status<\/strong> in order to design a program that is aimed at alleviating their specific symptoms. An individualised treatment plan will then be drawn up and, depending on the clients’ response, may be modified as the treatment progresses.<\/p>\n\n\n\n<p>This means that yoga therapists must <strong>understand why their clients have come to them<\/strong> and decide what they can do to help them. This is why yoga therapists should also be trained in listening, questioning, observing, and touching skills in order to assess clients in the best possible way.&nbsp;<\/p>\n\n\n\n<h2>3.3. Comprehensive Training and Qualifications<\/h2>\n\n\n\n<p>Also, in contrast to ‘general’ yoga teachers, those with a therapeutic approach to yoga will benefit from <strong>more comprehensive training <\/strong>to avoid health complications during treatment and to be aware of potential contraindications.&nbsp;<\/p>\n\n\n\n<p>Therefore, a qualified yoga therapist will have to complete special training to develop the necessary skills such as:<\/p>\n\n\n\n<ul><li>the ability to read and understand <strong>medical diagnoses<\/strong>;<\/li><li>knowledge of a wide range of both physical and mental health issues and associated <strong>contraindications<\/strong>;<\/li><li>a basic understanding of typical <strong>symptomes<\/strong>, maybe even depending on the client’s current disease state.<\/li><li>awareness of the effects of <strong>medication<\/strong> and, as a result, potential contraindications;<\/li><li>a comprehensive understanding of the roles of <strong>other health professionals <\/strong>in order to refer clients when they need additional support;<\/li><li>awareness of the <strong>limitations of their work<\/strong> as a yoga therapist, i.e. they must consider whether they are sufficiently qualified to address aspects of a certain condition; and, of course,<\/li><li>knowledge of <strong>yoga practices and techniques<\/strong> and their application with regard to a particular diagnosis.&nbsp;<\/li><\/ul>\n\n\n\n<!-- GALLERY 2x1 -->\n<div class=\"grid-wrapper\">\n<div class=\"grid-2x1-container\">\n\n<!-- Image 1 -->\n<div class=\"aspectratio\" data-ratio=\"16:9\"><div>\n<a href=\"https:\/\/watch.tintyoga.com\/programs\/shoulders-upper-spine\"><img decoding=\"async\" position=\"center\" src=\"https:\/\/tintyoga.com\/wp-content\/uploads\/2022\/01\/tint_magazine_Therapeutic-Yoga_David-Lurey-and-Mirjam-Wagner1.jpg\"><\/a>\n<\/div><\/div>\n\n<!-- Image 2 -->\n<div class=\"aspectratio\" data-ratio=\"16:9\"><div>\n<a href=\"https:\/\/watch.tintyoga.com\/programs\/yin-yang-for-hips-lower-spine\"><img decoding=\"async\" position=\"center\" src=\"https:\/\/tintyoga.com\/wp-content\/uploads\/2022\/01\/tint_magazine_Therapeutic-Yoga_David-Lurey-and-Mirjam-Wagner2.jpg\"><\/a>\n<\/div><\/div>\n\n<\/div>\n\n<!-- CAPTION -->\n<p class=\"caption\">Our TINT instructors <a href=\"\">Mirjam Wagner and David Lurey<\/a> teach you a therapeutic apporach to release pain in the shoulders and in the hips.<\/p>\n<\/div>\n\n\n\n<h1 id=\"4\">4. How Does Yoga Therapy Work?<\/h1>\n\n\n\n<p>Yoga, as we often practice it in the West, usually focuses on the <strong>physical practice <\/strong>of <em>Asanas<\/em> in a group (fitness) setting. Sometimes, pranayama and meditation are incorporated. In general, students adapt their practice according to the yoga teacher and the yoga style and <a href=\"https:\/\/tools.tintyoga.com\/\">yoga sequence<\/a> that is being taught. <\/p>\n\n\n\n<p>This doesn’t mean that yoga, in general, doesn’t already provide a lot of <a href=\"https:\/\/www.health.harvard.edu\/staying-healthy\/yoga-benefits-beyond-the-mat\" target=\"_blank\" rel=\"noreferrer noopener\">benefits<\/a> for practitioners. However, these are usually general and not aimed at specific physical and\/or emotional conditions.<\/p>\n\n\n\n<h2>4.1. Client-Focused Approach<\/h2>\n\n\n\n<p>Therapeutic yoga, on the other hand, <strong>focuses on the individual practitioner<\/strong> and takes into account their specific needs and, in particular, health restrictions. It uses a comprehensive approach to help improve the practitioners’ overall health and well-being by applying various yoga techniques. <\/p>\n\n\n\n<p>As such, therapeutic yoga is not only taught by yoga teachers or therapists but is also used by <strong>physical therapists and psychologists<\/strong> to heal, for example, chronic pain or emotional trauma.<\/p>\n\n\n\n<p>By choosing techniques in relation to how they will specifically benefit individual clients with certain health conditions, therapeutic yoga can help <strong>manage the symptoms of different diseases<\/strong>. These range from chronic pain to fatigue, or sleeplessness.&nbsp;<\/p>\n\n\n\n<p>In addition, yoga therapy can empower clients to take <strong>a more active role in self-care <\/strong>to overcome their health issues and gain independence.<\/p>\n\n\n\n<h2>4.2. Impacts on Mental Health<\/h2>\n\n\n\n<p>A <a href=\"https:\/\/bjsm.bmj.com\/content\/55\/17\/992\" target=\"_blank\" rel=\"noreferrer noopener\">2021 study<\/a> found that yoga, therapeutically applied, can help manage a variety of psychological conditions. And a <a href=\"https:\/\/pubmed.ncbi.nlm.nih.gov\/22132353\/\" target=\"_blank\" rel=\"noreferrer noopener\">2011 study<\/a> suggests that yoga therapy can be applied as a complementary form of therapy for mental health illnesses. Usually, it also has fewer side effects than medication.<\/p>\n\n\n\n<p>To be more specific, yoga therapy can help with the <strong>treatment of mental health conditions<\/strong> such as:<\/p>\n\n\n\n<ul><li>Alcohol and substance dependence<\/li><li>Anxiety and panic disorders<\/li><li>Attention deficit hyperactivity disorder<\/li><li>Autism<\/li><li>Bipolar disorder<\/li><li>Depression<\/li><li>Eating disorders<\/li><li>Insomnia<\/li><li>Post-traumatic stress disorder<\/li><li>Schizophrenia<\/li><li>Stress<\/li><\/ul>\n\n\n\n<p>What is more, therapeutic yoga does not only have positive impacts on mental health but can also be effective in <strong>treating physical health conditions<\/strong> like chronic pain caused by stress or trauma that has been stored in the body and manifests through bodily symptoms. So, yoga therapy has a variety of other objectives and benefits.<\/p>\n\n\n\n<h2>4.3. Objectives and Benefits of Yoga Therapy<\/h2>\n\n\n\n<h3>Mind-Body Focus&nbsp;<\/h3>\n\n\n\n<p>The exercises and techniques used in yoga therapy focus on the mind and body simultaneously. This way, it supports practitioners in developing both <strong>mental and physical awareness<\/strong>. This improves their mind-body connection and trains their mindfulness.<\/p>\n\n\n\n<h3>Improves Overall Fitness<\/h3>\n\n\n\n<p>Therapeutic yoga does not only hold benefits for the sick and injured. Persons with no specific health issues can also benefit from therapeutic yoga classes and improve their physical fitness, correct their posture and increase strength, balance, and flexibility.&nbsp;<\/p>\n\n\n\n<p>Yoga therapy is also said to have <strong>positive effects on poor health conditions <\/strong>such as high blood pressure, overweight, poor posture, and poor fitness in general.<\/p>\n\n\n\n<h3>Fewer Side Effects<\/h3>\n\n\n\n<p>Any medication that is used to treat mental or physical health conditions can have side effects. In some medications, the list may be longer and scarier than in others. In contrast to that, yoga therapy – if applied correctly and by a well-trained therapist – has few to no side effects.<\/p>\n\n\n\n<h3>Alternative Form of Therapy<\/h3>\n\n\n\n<p>Finally, conventional medicine also has its limits. There are some individuals or conditions where mainstream medicine may not provide the desired cure. In other instances, the side effects of medication and\/or treatment may simply be too scary for the individual to bear.&nbsp;<\/p>\n\n\n\n<p>In such cases, yoga therapy can be a great<strong> alternative or additional form of therapy<\/strong>, especially for those who find more meaningful results through a holistic mind-body approach.<\/p>\n\n\n<span style=\"--tl-form-height-m:1213.05px;--tl-form-height-t:638.781px;--tl-form-height-d:638.781px;\" class=\"tl-placeholder-f-type-shortcode_158494 tl-preload-form\"><span><\/span><\/span>\n\n\n<h2>4.4. Techniques Used in Yoga Therapy<\/h2>\n\n\n\n<p>Yoga therapy is typically performed on a one-on-one basis, but can also be practiced in small groups. In these cases, the power of the group may even amplify the healing process.<\/p>\n\n\n\n<p>A therapeutic yoga class can include the application of the following techniques.<\/p>\n\n\n\n<h3>Yoga Poses\/Asanas<\/h3>\n\n\n\n<p>Like any yoga class, therapeutic yoga includes a <a href=\"https:\/\/tools.tintyoga.com\/\">variety of poses<\/a> that are called <em>Asanas<\/em>. In yoga therapy, the therapist will specifically choose and teach appropriate <strong>yoga poses that address the clients’ problem areas<\/strong>. Here, yoga props such as blocks, straps or chairs are commonly used to support the client.<\/p>\n\n\n\n<p>For example, a gentle and rather accessible inversion in a therapeutic yoga class may be the “Legs Up the Wall” pose (instead of Shoulderstand for instance). This position is said to bring relief in conditions like anxiety and insomnia.<\/p>\n\n\n\n<div class=\"video-wrapper\">\n<div class=\"video-wrapper-inner\">\n\n<!-- YOUTUBE VIDEO GOES HERE -->\n<iframe width=\"560\" height=\"315\" src=\"https:\/\/www.youtube.com\/embed\/Ye8Pro_YF5A\" frameborder=\"0\" allow=\"accelerometer; autoplay; encrypted-media; gyroscope; picture-in-picture\" allowfullscreen=\"\"><\/iframe>\n\n<!-- CAPTION -->\n<p class=\"caption\">Practice a therapeutic approach to release neck &amp; shoulder with Young Ho Kim on TINT.<\/p>\n\n<\/div>\n<\/div>\n\n\n\n<h3>Breathing Exercises\/Pranayama<\/h3>\n\n\n\n<p>The yoga therapist will guide the client(s) through a series of breathing exercises, also called <em>Pranayama<\/em> in yoga. These practices can range from energizing breathwork to balancing breathing exercises.<\/p>\n\n\n\n<h3>Meditation and Relaxation<\/h3>\n\n\n\n<p>Yoga therapy can also include relaxation and mindfulness practices. This is where meditation can be used either separately or in combination with <em>Asanas<\/em> or <em>Pranayama<\/em>.<\/p>\n\n\n\n<h3>Visualization<\/h3>\n\n\n\n<p>Yoga therapists may also use visualization practices or guided imagery. The aim here is to calm the body and mind by providing a guided visualization in order to bring inner peace.<\/p>\n\n\n\n<p>More traditional forms of yoga therapy can also include techniques such as chanting, prayer, readings, rituals, and spiritual counseling.<\/p>\n\n\n\n<h3>Homework<\/h3>\n\n\n\n<p>Another important technique used in yoga therapy – and this again differs from the ‘regular’ yoga class – is homework. Students or clients will benefit tremendously if they learn to <strong>build the practices into their daily life<\/strong> instead of practicing them only once a week in the context of a therapeutic yoga class.<\/p>\n\n\n\n<p>The treatment plan and techniques employed in yoga therapy usually vary according to <strong>age, physical ability, and specific needs <\/strong>of the students or clients. Besides, all exercises and techniques used in yoga therapy are aimed at maximizing the connection between mind and body.&nbsp;<\/p>\n\n\n\n<p>While this is true for any yoga practice, a yoga therapist will specifically explain the importance and meaning of each exercise and yoga pose with regard to the underlying health concern. This way, yoga therapy creates a bridge between the practice and its cognitive framework.&nbsp;<\/p>\n\n\n\n<p>If a practitioner suffers from anxiety, for example, a yoga therapist will explain how the poses practiced can help relieve anxiety.<\/p>\n\n\n\n<h1 id=\"5\">5. Conclusion: Is Yoga Therapy an Alternative to Medical Treatment?<\/h1>\n\n\n\n<p>While yoga therapy does not claim to be disease-curative, <strong>it can address various symptoms <\/strong>that may accompany illnesses or health issues, specifically pain, fatigue, and mental challenges.<\/p>\n\n\n\n<p>As such, <strong>yoga therapy can be used in addition to other forms of therapy.<\/strong> Note that it should always be considered whether and to what extent therapeutic yoga practices can be helpful to the individual and how it would work in combination with other forms of therapy.<\/p>\n\n\n\n<p>Although many clients report great results from yoga therapy, it is important to remember that <strong>yoga is not a cure-all or magical bullet<\/strong>. Besides, the communication between therapy seeker and therapy giver must be very clear as to the underlying health issues, medical history, and desired outcome of yoga therapy.&nbsp;<\/p>\n\n\n\n<p>However, if this is taken into account, <strong>anyone can participate in yoga therapy<\/strong> regardless of age, flexibility, or strength. This is especially true since therapeutic yoga sessions can be simple or advanced, depending on the abilities and needs of the students or clients.<\/p>\n\n\n\n<p>If you want to dive deeper into yoga therapy and the application of therapeutic yoga practices, make sure you check out the <a href=\"https:\/\/watch.tintyoga.com\/categories\/live-stream-replay\">replays of the live classes<\/a> involving therapeutic approaches to yoga.  <\/p>\n\n\n\n<p>Each session includes techniques and practices that <strong>support the body to deal with physical issues <\/strong>such as tension, pains and aches, and – to a certain degree – injuries. The aim is to release tension and relieve the body from unpleasant sensations.<\/p>\n\n\n\n<p>While Young Ho Kim,  Desirée Rumbaugh and Matt Giordano all focused on different parts of the body like the lower back and the shoulders, they all rather practice static poses instead of powerful flows to strengthen and lengthen those areas of the body in order to achieve long-term benefits and increase overall well-being.<\/p>\n\n\n\n<!-- GALLERY 2x1 -->\n<div class=\"grid-wrapper\">\n<div class=\"grid-2x1-container\">\n\n<!-- Image 1 -->\n<div class=\"aspectratio\" data-ratio=\"16:9\"><div>\n<a href=\"https:\/\/watch.tintyoga.com\/programs\/therapeutic-yoga-3\"><img decoding=\"async\" position=\"center\" src=\"https:\/\/tintyoga.com\/wp-content\/uploads\/2022\/03\/Thumbnails-Young-Ho-Kim.jpg\"><\/a>\n<\/div><\/div>\n\n<!-- Image 2 -->\n<div class=\"aspectratio\" data-ratio=\"16:9\"><div>\n<a href=\"https:\/\/watch.tintyoga.com\/programs\/shoulder-therapeutics\"><img decoding=\"async\" position=\"center\" src=\"https:\/\/tintyoga.com\/wp-content\/uploads\/2022\/03\/Matt-Giordano-Thumbnails.jpg\"><\/a>\n<\/div><\/div>\n\n<\/div>\n\n\n<!-- CAPTION -->\n<p class=\"caption\">Relieve pain in your lower back or your shoulders with Young Ho Kim and Matt Giordano in the <a href=\"https:\/\/watch.tintyoga.com\/categories\/live-stream-replay\">replays of their Live Classes<\/a> focussing in therapeutic yoga.<\/p>\n<\/div>\n\n\n<span style=\"--tl-form-height-m:1213.05px;--tl-form-height-t:638.781px;--tl-form-height-d:638.781px;\" class=\"tl-placeholder-f-type-shortcode_158494 tl-preload-form\"><span><\/span><\/span>","protected":false},"excerpt":{"rendered":"<p>Many turn to yoga for therapeutic purposes, e.g. to release pain. But what is therapeutic yoga? And how is it different from ‘regular’ yoga?<\/p>\n","protected":false},"author":6,"featured_media":159379,"comment_status":"closed","ping_status":"closed","sticky":false,"template":"","format":"standard","meta":{"_et_pb_use_builder":"off","_et_pb_old_content":"<!-- wp:paragraph {\"className\":\"intro-text\"} -->\n<p class=\"intro-text\">Traditionally, <strong>yoga<\/strong> was not primarily intended as a <strong>therapeutic<\/strong> practice or <strong>therapy<\/strong> for injured or sick persons. It was rather for healthy people who were interested in, and capable of, improving their general health and fitness as well as their mental well-being.<\/p>\n<!-- \/wp:paragraph -->\n\n<!-- wp:paragraph -->\n<p>While yoga is <strong>neither physical nor psychological therapy<\/strong>, many yoga practices contain therapeutic elements. However, it’s mainly a tradition of psycho-spiritual growth leading to inner peace and freedom.&nbsp;<\/p>\n<!-- \/wp:paragraph -->\n\n<!-- wp:paragraph -->\n<p>In Western societies, yoga is nowadays almost universally pursued as a health fitness routine that <strong>has proven to be highly effective <\/strong>and is, thus, discovered by more and more people. And quite a few practitioners turn to yoga for therapeutic purposes – be it to <a href=\"https:\/\/watch.tintyoga.com\/search?custom_fields=%7B%22custom_field_5271%22%3A%228%22%7D\">soothe physical pain<\/a> or overcome mental challenges such as stress or anxiety. But what is therapeutic yoga actually? And how is it different from ‘regular’ yoga?<\/p>\n<!-- \/wp:paragraph -->\n\n<!-- wp:html -->\n<div class=\"toc-wrapper\">\n<p>Table of Contents<\/p>\n\n<ul class=\"fa-ul toc-list\">\n  <li>[toc-icon]<a href=\"#1\">1. What Is Therapeutic Yoga?<\/a><\/li>\n  <li>[toc-icon]<a href=\"#2\">2. Difference Between Therapeutic Yoga and Yoga<\/a><\/li>\n  <li>[toc-icon]<a href=\"#3\">3. What Does a Yoga Therapist Do?<\/a><\/li>\n  <li>[toc-icon]<a href=\"#4\">4. How Does Yoga Therapy Work?<\/a><\/li>\n  <li>[toc-icon]<a href=\"#5\">5. Conclusion: Is Yoga Therapy an Alternative to Medical Treatment?<\/a><\/li>\n<\/ul>\n<\/div>\n<!-- \/wp:html -->\n\n<!-- wp:heading {\"level\":1} -->\n<h1 id=\"1\">1.&nbsp;What Is Therapeutic Yoga?<\/h1>\n<!-- \/wp:heading -->\n\n<!-- wp:paragraph -->\n<p>Yoga therapy or therapeutic yoga is a form of therapy that applies yoga practices to <strong>improve mental and physical health<\/strong>. While yoga is generally associated with stress relief, yoga therapy, in particular, can help to treat several other mental health conditions. As such, it can even be applied in combination with other types of therapy.<\/p>\n<!-- \/wp:paragraph -->\n\n<!-- wp:paragraph -->\n<p>The <a href=\"https:\/\/www.iayt.org\/\" target=\"_blank\" rel=\"noreferrer noopener\">International Association of Yoga Therapists<\/a> (IAYT), which is responsible for certifying yoga therapists and accrediting yoga therapy schools, defines the term <em>yoga therapy<\/em> as follows:&nbsp;<\/p>\n<!-- \/wp:paragraph -->\n\n<!-- wp:html -->\n<div class=\"quote-wrapper\">\n<p class=\"quote\">\"Yoga therapy is the professional application of the principles and practices of yoga to promote health and well-being within a therapeutic relationship that includes personalized assessment, goal setting, lifestyle management, and yoga practices for individuals or small groups.\"<\/p>\n<p class=\"quote-author\">– International Association of Yoga Therapists.<\/p>\n<\/div>\n<!-- \/wp:html -->\n\n<!-- wp:paragraph -->\n<p><a href=\"https:\/\/watch.tintyoga.com\/search?custom_fields=%7B%22custom_field_5271%22%3A%228%22%7D\">Therapeutic yoga<\/a> includes techniques and practices that <strong>support the body to deal with physical issues<\/strong> such as tension, pains and aches and – to a certain degree – injuries. The aim is to release tension and relieve the body from unpleasant sensations. Instead of flowing through powerful sequences, the focus rather is on static poses. These poses target specific body parts and areas of the body to strengthen and lengthen them in order to achieve long-term benefits and increase overall well-being.<\/p>\n<!-- \/wp:paragraph -->\n\n<!-- wp:paragraph -->\n<p>In summary, yoga therapy is intended as a <strong>preventative, curative, or palliative practice<\/strong> – depending on the individual’s needs. Ideally, therapeutic yoga is an empowering experience that leaves practitioners with an increased feeling of overall well-being.<\/p>\n<!-- \/wp:paragraph -->\n\n<!-- wp:html -->\n<!-- IMAGE 16:9 -->\n<div class=\"image-wrapper\">\n<div class=\"aspectratio\" data-ratio=\"16:9\" position=\"bottom\">\n  <div>\n   <img src=\"https:\/\/tintyoga.com\/wp-content\/uploads\/2022\/01\/tint_magazine_Therapeutic-Yoga_Barbra-Noh.jpeg\">\n  <\/div>\n<\/div>\n\n<!-- CAPTION -->\n<p class=\"caption\">Learn a therapeutic approach to yoga in <a href=\"https:\/\/tintyoga.com\/instructors\/barbra-noh\/\">Barbra Noh<\/a>'s <a href=\"https:\/\/watch.tintyoga.com\/programs\/therapeutic-alignment-immersion\">Therapeutic Alignment Immersion<\/a> on TINT.<\/p>\n<\/div>\n<!-- \/wp:html -->\n\n<!-- wp:heading {\"level\":1} -->\n<h1 id=\"1\">2.&nbsp;Difference Between Therapeutic Yoga and Yoga<\/h1>\n<!-- \/wp:heading -->\n\n<!-- wp:paragraph -->\n<p>Although yoga, in general, is intended to be therapeutic and healing, yoga therapy refers to the s<strong>pecific use of yogic practices<\/strong> aimed at alleviating the practitioners’ physical, mental, and emotional suffering. These tools include anything from yoga poses (<em>Asana<\/em>), breathing exercises (<a href=\"https:\/\/magazine.tintyoga.com\/pranayama-an-intro-to-the-power-of-yogic-breathing\/\"><em>Pranayama<\/em><\/a>), <a href=\"https:\/\/magazine.tintyoga.com\/quietening-our-thougths-through-meditation\/\">meditation<\/a>, and other physical exercises and <a href=\"https:\/\/magazine.tintyoga.com\/yoga-meditation-a-practice-of-mindfulness\/\">mindfulness<\/a> practices.<\/p>\n<!-- \/wp:paragraph -->\n\n<!-- wp:paragraph -->\n<p>If you compare a therapeutic yoga class to your average yoga class, you will certainly find some overlaps. However, there are also differences.&nbsp;<\/p>\n<!-- \/wp:paragraph -->\n\n<!-- wp:heading -->\n<h2>2.1. Therapeutic Yoga Clients vs. Yoga Students<\/h2>\n<!-- \/wp:heading -->\n\n<!-- wp:paragraph -->\n<p>While the aim of a ‘regular’ student in a ‘regular’ yoga class (note: We use the word ‘regular’ here in contrast to ‘therapeutic’.) usually is to stay healthy and fit, increase and maintain flexibility, or find mental and emotional balance, a student in a therapeutic yoga class will want to <strong>address specific physical, mental and\/or emotional needs<\/strong>.<\/p>\n<!-- \/wp:paragraph -->\n\n<!-- wp:paragraph -->\n<p>Thus, <strong>yoga therapy<\/strong> can be more specifically defined as “the process of empowering individuals to progress toward improved health and well-being through the application of the teachings and practices of yoga” (according to the IAYT).&nbsp;<\/p>\n<!-- \/wp:paragraph -->\n\n<!-- wp:paragraph -->\n<p>In contrast to the regular yoga student, who is usually in good health, yoga therapy clients usually have been <strong>diagnosed with a physical or mental health issue<\/strong>. In addition to other potential medical or therapeutic approaches, they are looking for complementary means to resolve their health problems.&nbsp;<\/p>\n<!-- \/wp:paragraph -->\n\n<!-- wp:paragraph -->\n<p>This is why yoga therapists usually spend a lot of time <strong>listening and observing their clients <\/strong>during practice. This way, they are able to find different ways to alleviate their clients’ symptoms and improve their body’s functionality.&nbsp;<\/p>\n<!-- \/wp:paragraph -->\n\n<!-- wp:paragraph -->\n<p>This means that yoga therapy includes yoga <strong>techniques that are tailored to the individual client <\/strong>so that they may practice them at their convenience. The intention behind this approach is to give yoga therapy students the feeling of self-efficacy, i.e. they learn that they are in control of their recovery instead of being at the mercy of their health condition.&nbsp;<\/p>\n<!-- \/wp:paragraph -->\n\n<!-- wp:heading -->\n<h2>2.2. Therapeutic Focus<\/h2>\n<!-- \/wp:heading -->\n\n<!-- wp:paragraph -->\n<p>You may have already noticed though that the difference between yoga and therapeutic yoga\/yoga therapy is not always that obvious. You may think that any time a person practices yoga in order to relieve or overcome a health condition, they practice yoga therapy.&nbsp;<\/p>\n<!-- \/wp:paragraph -->\n\n<!-- wp:paragraph -->\n<p>This is true to some extent as many yoga practitioners seek to <strong>improve their strength, flexibility, and overall well-being<\/strong>. More and more people also engage in yoga because they hope to manage or improve specific physical or mental health conditions. Nowadays, as the popularity of yoga rises on all continents of the world, it has become established in the public psyche that yoga can have significant <a href=\"https:\/\/www.ncbi.nlm.nih.gov\/pmc\/articles\/PMC3193654\/\" target=\"_blank\" rel=\"noreferrer noopener\">therapeutic benefits<\/a>.&nbsp;<\/p>\n<!-- \/wp:paragraph -->\n\n<!-- wp:paragraph -->\n<p>But therapeutic yoga goes beyond a ‘regular’ yoga practice. Yoga therapy applies yoga and mindfulness practices <strong>based on scientific research <\/strong>in order to offer a comprehensive, effective and efficient approach to alleviating health conditions.&nbsp;<\/p>\n<!-- \/wp:paragraph -->\n\n<!-- wp:paragraph -->\n<p>The aim of yoga therapy is to <strong>get a full picture of the clients’ symptoms <\/strong>that trouble them and, as a result, identify the most appropriate yogic methods to manage these symptoms. In many cases, this often goes along with other pharmaceutical and\/or therapeutic treatments.<\/p>\n<!-- \/wp:paragraph -->\n\n<!-- wp:paragraph -->\n<p>Yoga therapy also aims at empowering practitioners to <strong>overcome their health challenges<\/strong> by means of practices that they can easily integrate into their lives. This way, they gain independence as they are able to take a more active role in their self-care.&nbsp;<\/p>\n<!-- \/wp:paragraph -->\n\n<!-- wp:heading -->\n<h2>2.3. The Yoga Therapist’s Skill Set<\/h2>\n<!-- \/wp:heading -->\n\n<!-- wp:paragraph -->\n<p>Yoga therapy requires specialized training and <strong>a broad skill set <\/strong>in order to be able to build a strong relationship between the yoga therapy student (often referred to as ‘client’) and yoga therapy teacher (also referred to as ‘yoga therapist’). This is necessary in order to effect positive change for the client.<\/p>\n<!-- \/wp:paragraph -->\n\n<!-- wp:paragraph -->\n<p>Furthermore, yoga therapy combines <strong>knowledge from a variety of fields<\/strong>: from modern research in anatomy and physiology to medical studies, psychology, and yoga.<\/p>\n<!-- \/wp:paragraph -->\n\n<!-- wp:paragraph -->\n<p>It must be mentioned here that yoga, contrary to common belief, is not necessarily suitable for everyone. Or more specifically: <strong>Not every yoga practice is suitable for everyone<\/strong>. <\/p>\n<!-- \/wp:paragraph -->\n\n<!-- wp:paragraph -->\n<p>The truth is that many yoga poses that are taught in regular yoga classes are contraindicated for people with health issues such as high blood pressure, heart disease, diabetes, asthma, or autoimmune diseases. The same goes for participants with physical ailments including serious posture imbalances, scoliosis, herniated discs, hip dysplasia, and others. <\/p>\n<!-- \/wp:paragraph -->\n\n<!-- wp:paragraph -->\n<p>What is more, yoga can also be counterproductive for people suffering from mental illnesses such as eating disorders, clinical depression, posttraumatic stress disorder (PTSD), and panic disorder if the teacher is not sufficiently trained.<\/p>\n<!-- \/wp:paragraph -->\n\n<!-- wp:paragraph -->\n<p>This is why the yoga therapist needs to have <strong>sound knowledge of modern medicine<\/strong> and <a href=\"https:\/\/tintyoga.com\/magazine\/overcoming-trauma-through-yoga\/\">trauma-informed psychology<\/a> in order to safely and effectively meet the yoga therapy students’ needs. In some cases, it may even be advisable to collaborate with other health practitioners to continuously develop yoga therapy as an adapted, safe and complementary treatment form.<\/p>\n<!-- \/wp:paragraph -->\n\n<!-- wp:html -->\n<!-- IMAGE 16:9 -->\n<div class=\"image-wrapper\">\n<div class=\"aspectratio\" data-ratio=\"16:9\" position=\"bottom\">\n  <div>\n   <img src=\"https:\/\/tintyoga.com\/wp-content\/uploads\/2022\/01\/tint_magazine_Therapeutic-Yoga_Young-Ho-Kim_EN.jpg\">\n  <\/div>\n<\/div>\n\n<!-- CAPTION -->\n<p class=\"caption\">TINT Instructor <a href=\"https:\/\/tintyoga.com\/instructors\/young-ho-kim\/\">Young Ho Kim<\/a> shows you therapeutic yoga poses to soothe <a href=\"https:\/\/watch.tintyoga.com\/programs\/yoga-for-neck-shoulders\">neck and shoulder pain<\/a>.<\/p>\n<\/div>\n<!-- \/wp:html -->\n\n<!-- wp:heading -->\n<h2>2.4. Application of Therapeutic Yoga&nbsp;<\/h2>\n<!-- \/wp:heading -->\n\n<!-- wp:paragraph -->\n<p>With <strong>new insights and regular updates<\/strong> regarding new medical treatments for disease, yoga therapy also needs to continuously develop and adapt. For example, yoga inversions have long been considered the most important <em>Asanas<\/em> as they were thought to be beneficial for the brain as a preparation for meditation. Thanks to modern medical research and insights we know today that inversions can <a href=\"https:\/\/www.expandinglight.org\/free\/yoga-teacher\/articles\/general\/inversions-cardiovascular-heart.php\" target=\"_blank\" rel=\"noreferrer noopener\">cause a stroke<\/a> in people with a predisposition for cardiovascular diseases.&nbsp;<\/p>\n<!-- \/wp:paragraph -->\n\n<!-- wp:paragraph -->\n<p>In contrast to that, inversions have long been contraindicated for menstruating women as it was thought that the blood from the uterus may penetrate into other organs. Needless to say that this has also been proven wrong.<\/p>\n<!-- \/wp:paragraph -->\n\n<!-- wp:paragraph -->\n<p>This is why yoga therapy (and – to be frank – ANY yoga practice) <strong>demands a highly developed skill set<\/strong> including knowledge about a variety of contraindications, modifications, and variations that need to be implemented when working with clients with special needs due to, for example, obesity, elevated blood pressure, diabetics, herniated discs and other back problems, or a history of heart disease.<\/p>\n<!-- \/wp:paragraph -->\n\n<!-- wp:paragraph -->\n<p>In addition to that, yoga therapy also is both <strong>trauma-informed and trauma-sensitive<\/strong> based on the work of Bessel van der Kolk and other specialists in this field. This is why it can also be applied as a supplementary treatment in trauma therapy and to approach psychological and psycho-somatic ailments like depression, anxiety, and panic disorders or eating disorders.<\/p>\n<!-- \/wp:paragraph -->\n\n<!-- wp:thrive\/leads-block {\"selectedBlock\":158494} \/-->\n\n<!-- wp:paragraph -->\n<p><\/p>\n<!-- \/wp:paragraph -->\n\n<!-- wp:heading {\"level\":1} -->\n<h1 id=\"3\">3. What Does a Yoga Therapist Do?<\/h1>\n<!-- \/wp:heading -->\n\n<!-- wp:paragraph -->\n<p>As mentioned above, there is some overlap in the work of yoga teachers and yoga therapists, but each has a different focus and particular skill set.<\/p>\n<!-- \/wp:paragraph -->\n\n<!-- wp:heading -->\n<h2>3.1. Tailor-Made Training&nbsp;<\/h2>\n<!-- \/wp:heading -->\n\n<!-- wp:paragraph -->\n<p>While yoga teachers usually aim at delivering an overall yoga experience to their students, yoga therapists target their clients’ specific issues and support them with <strong>tailor-made techniques<\/strong> that contribute specifically to their physical, emotional, and\/or psychological health.&nbsp;<\/p>\n<!-- \/wp:paragraph -->\n\n<!-- wp:paragraph -->\n<p>Therapeutic yoga teachers need a <strong>more thorough and deeper training and academic work<\/strong> in order to gain the medical knowledge and psychotherapeutic skills required to meet people’s various health needs and to provide yogic techniques that are suitable for their clients’ health status.&nbsp;<\/p>\n<!-- \/wp:paragraph -->\n\n<!-- wp:heading -->\n<h2>3.2. Assessment and Individualised Treatment&nbsp;<\/h2>\n<!-- \/wp:heading -->\n\n<!-- wp:paragraph -->\n<p>While yoga therapy can be applied in a group setting or on a one-on-one basis, there are some basic steps any yoga therapist will need to follow. Typically, a yoga therapist will start by <strong>assessing their clients’ health status<\/strong> in order to design a program that is aimed at alleviating their specific symptoms. An individualised treatment plan will then be drawn up and, depending on the clients’ response, may be modified as the treatment progresses.<\/p>\n<!-- \/wp:paragraph -->\n\n<!-- wp:paragraph -->\n<p>This means that yoga therapists must <strong>understand why their clients have come to them<\/strong> and decide what they can do to help them. This is why yoga therapists should also be trained in listening, questioning, observing, and touching skills in order to assess clients in the best possible way.&nbsp;<\/p>\n<!-- \/wp:paragraph -->\n\n<!-- wp:heading -->\n<h2>3.3. Comprehensive Training and Qualifications<\/h2>\n<!-- \/wp:heading -->\n\n<!-- wp:paragraph -->\n<p>Also, in contrast to ‘general’ yoga teachers, those with a therapeutic approach to yoga will benefit from <strong>more comprehensive training <\/strong>to avoid health complications during treatment and to be aware of potential contraindications.&nbsp;<\/p>\n<!-- \/wp:paragraph -->\n\n<!-- wp:paragraph -->\n<p>Therefore, a qualified yoga therapist will have to complete special training to develop the necessary skills such as:<\/p>\n<!-- \/wp:paragraph -->\n\n<!-- wp:list -->\n<ul><li>the ability to read and understand <strong>medical diagnoses<\/strong>;<\/li><li>knowledge of a wide range of both physical and mental health issues and associated <strong>contraindications<\/strong>;<\/li><li>a basic understanding of typical <strong>symptomes<\/strong>, maybe even depending on the client’s current disease state.<\/li><li>awareness of the effects of <strong>medication<\/strong> and, as a result, potential contraindications;<\/li><li>a comprehensive understanding of the roles of <strong>other health professionals <\/strong>in order to refer clients when they need additional support;<\/li><li>awareness of the <strong>limitations of their work<\/strong> as a yoga therapist, i.e. they must consider whether they are sufficiently qualified to address aspects of a certain condition; and, of course,<\/li><li>knowledge of <strong>yoga practices and techniques<\/strong> and their application with regard to a particular diagnosis.&nbsp;<\/li><\/ul>\n<!-- \/wp:list -->\n\n<!-- wp:html -->\n<!-- GALLERY 2x1 -->\n<div class=\"grid-wrapper\">\n<div class=\"grid-2x1-container\">\n\n<!-- Image 1 -->\n<div class=\"aspectratio\" data-ratio=\"16:9\"><div>\n<a href=\"https:\/\/watch.tintyoga.com\/programs\/shoulders-upper-spine\"><img position=\"center\" src=\"https:\/\/tintyoga.com\/wp-content\/uploads\/2022\/01\/tint_magazine_Therapeutic-Yoga_David-Lurey-and-Mirjam-Wagner1.jpg\"><\/a>\n<\/div><\/div>\n\n<!-- Image 2 -->\n<div class=\"aspectratio\" data-ratio=\"16:9\"><div>\n<a href=\"https:\/\/watch.tintyoga.com\/programs\/yin-yang-for-hips-lower-spine\"><img position=\"center\" src=\"https:\/\/tintyoga.com\/wp-content\/uploads\/2022\/01\/tint_magazine_Therapeutic-Yoga_David-Lurey-and-Mirjam-Wagner2.jpg\"><\/a>\n<\/div><\/div>\n\n<\/div>\n\n<!-- CAPTION -->\n<p class=\"caption\">Our TINT instructors <a href=\"\">Mirjam Wagner and David Lurey<\/a> teach you a therapeutic apporach to release pain in the shoulders and in the hips.<\/p>\n<\/div>\n<!-- \/wp:html -->\n\n<!-- wp:heading {\"level\":1} -->\n<h1 id=\"4\">4. How Does Yoga Therapy Work?<\/h1>\n<!-- \/wp:heading -->\n\n<!-- wp:paragraph -->\n<p>Yoga, as we often practice it in the West, usually focuses on the <strong>physical practice <\/strong>of <em>Asana<\/em> in a group (fitness) setting. Sometimes, pranayama and meditation are incorporated. In general, students adapt their practice according to the yoga teacher and the yoga style that is being taught.&nbsp;<\/p>\n<!-- \/wp:paragraph -->\n\n<!-- wp:paragraph -->\n<p>This doesn’t mean that yoga, in general, doesn’t already provide a lot of <a href=\"https:\/\/www.health.harvard.edu\/staying-healthy\/yoga-benefits-beyond-the-mat\" target=\"_blank\" rel=\"noreferrer noopener\">benefits<\/a> for practitioners. However, these are usually general and not aimed at specific physical and\/or emotional conditions.<\/p>\n<!-- \/wp:paragraph -->\n\n<!-- wp:heading -->\n<h2>4.1. Client-Focused Approach<\/h2>\n<!-- \/wp:heading -->\n\n<!-- wp:paragraph -->\n<p>Therapeutic yoga, on the other hand, <strong>focuses on the individual practitioner<\/strong> and takes into account their specific needs and, in particular, health restrictions. It uses a comprehensive approach to help improve the practitioners’ overall health and well-being by applying various yoga techniques. <\/p>\n<!-- \/wp:paragraph -->\n\n<!-- wp:paragraph -->\n<p>As such, therapeutic yoga is not only taught by yoga teachers or therapists but is also used by <strong>physical therapists and psychologists<\/strong> to heal, for example, chronic pain or emotional trauma.<\/p>\n<!-- \/wp:paragraph -->\n\n<!-- wp:paragraph -->\n<p>By choosing techniques in relation to how they will specifically benefit individual clients with certain health conditions, therapeutic yoga can help <strong>manage the symptoms of different diseases<\/strong>. These range from chronic pain to fatigue, or sleeplessness.&nbsp;<\/p>\n<!-- \/wp:paragraph -->\n\n<!-- wp:paragraph -->\n<p>In addition, yoga therapy can empower clients to take <strong>a more active role in self-care <\/strong>to overcome their health issues and gain independence.<\/p>\n<!-- \/wp:paragraph -->\n\n<!-- wp:heading -->\n<h2>4.2. Impacts on Mental Health<\/h2>\n<!-- \/wp:heading -->\n\n<!-- wp:paragraph -->\n<p>A <a href=\"https:\/\/bjsm.bmj.com\/content\/55\/17\/992\" target=\"_blank\" rel=\"noreferrer noopener\">2021 study<\/a> found that yoga, therapeutically applied, can help manage a variety of psychological conditions. And a <a href=\"https:\/\/pubmed.ncbi.nlm.nih.gov\/22132353\/\" target=\"_blank\" rel=\"noreferrer noopener\">2011 study<\/a> suggests that yoga therapy can be applied as a complementary form of therapy for mental health illnesses. Usually, it also has fewer side effects than medication.<\/p>\n<!-- \/wp:paragraph -->\n\n<!-- wp:paragraph -->\n<p>To be more specific, yoga therapy can help with the <strong>treatment of mental health conditions<\/strong> such as:<\/p>\n<!-- \/wp:paragraph -->\n\n<!-- wp:list -->\n<ul><li>Alcohol and substance dependence<\/li><li>Anxiety and panic disorders<\/li><li>Attention deficit hyperactivity disorder<\/li><li>Autism<\/li><li>Bipolar disorder<\/li><li>Depression<\/li><li>Eating disorders<\/li><li>Insomnia<\/li><li>Post-traumatic stress disorder<\/li><li>Schizophrenia<\/li><li>Stress<\/li><\/ul>\n<!-- \/wp:list -->\n\n<!-- wp:paragraph -->\n<p>What is more, therapeutic yoga does not only have positive impacts on mental health but can also be effective in t<strong>reating physical health conditions<\/strong> like chronic pain caused by stress or trauma that has been stored in the body and manifests through bodily symptoms. So, yoga therapy has a variety of other objectives and benefits.<\/p>\n<!-- \/wp:paragraph -->\n\n<!-- wp:heading -->\n<h2>4.3. Objectives and Benefits of Yoga Therapy<\/h2>\n<!-- \/wp:heading -->\n\n<!-- wp:heading {\"level\":3} -->\n<h3>Mind-Body Focus&nbsp;<\/h3>\n<!-- \/wp:heading -->\n\n<!-- wp:paragraph -->\n<p>The exercises and techniques used in yoga therapy focus on the mind and body simultaneously. This way, it supports practitioners in developing both <strong>mental and physical awareness<\/strong>. This improves their mind-body connection and trains their mindfulness.<\/p>\n<!-- \/wp:paragraph -->\n\n<!-- wp:heading {\"level\":3} -->\n<h3>Improves Overall Fitness<\/h3>\n<!-- \/wp:heading -->\n\n<!-- wp:paragraph -->\n<p>Therapeutic yoga does not only hold benefits for the sick and injured. Persons with no specific health issues can also benefit from therapeutic yoga classes and improve their physical fitness, correct their posture and increase strength, balance, and flexibility.&nbsp;<\/p>\n<!-- \/wp:paragraph -->\n\n<!-- wp:paragraph -->\n<p>Yoga therapy is also said to have <strong>positive effects on poor health conditions <\/strong>such as high blood pressure, overweight, poor posture, and poor fitness in general.<\/p>\n<!-- \/wp:paragraph -->\n\n<!-- wp:heading {\"level\":3} -->\n<h3>Fewer Side Effects<\/h3>\n<!-- \/wp:heading -->\n\n<!-- wp:paragraph -->\n<p>Any medication that is used to treat mental or physical health conditions can have side effects. In some medications, the list may be longer and scarier than in others. In contrast to that, yoga therapy – if applied correctly and by a well-trained therapist – has few to no side effects.<\/p>\n<!-- \/wp:paragraph -->\n\n<!-- wp:heading {\"level\":3} -->\n<h3>Alternative Form of Therapy<\/h3>\n<!-- \/wp:heading -->\n\n<!-- wp:paragraph -->\n<p>Finally, conventional medicine also has its limits. There are some individuals or conditions where mainstream medicine may not provide the desired cure. In other instances, the side effects of medication and\/or treatment may simply be too scary for the individual to bear.&nbsp;<\/p>\n<!-- \/wp:paragraph -->\n\n<!-- wp:paragraph -->\n<p>In such cases, yoga therapy can be a great<strong> alternative or additional form of therapy<\/strong>, especially for those who find more meaningful results through a holistic mind-body approach.<\/p>\n<!-- \/wp:paragraph -->\n\n<!-- wp:thrive\/leads-block {\"selectedBlock\":158494} \/-->\n\n<!-- wp:heading -->\n<h2>4.4. Techniques Used in Yoga Therapy<\/h2>\n<!-- \/wp:heading -->\n\n<!-- wp:paragraph -->\n<p>Yoga therapy is typically performed on a one-on-one basis, but can also be practiced in small groups. In these cases, the power of the group may even amplify the healing process.<\/p>\n<!-- \/wp:paragraph -->\n\n<!-- wp:paragraph -->\n<p>A therapeutic yoga class can include the application of the following techniques.<\/p>\n<!-- \/wp:paragraph -->\n\n<!-- wp:heading {\"level\":3} -->\n<h3>Yoga Poses\/Asanas<\/h3>\n<!-- \/wp:heading -->\n\n<!-- wp:paragraph -->\n<p>Like any yoga class, therapeutic yoga includes a variety of poses that are called <em>Asanas<\/em>. In yoga therapy, the therapist will specifically choose and teach appropriate <strong>yoga poses that address the clients’ problem areas<\/strong>. Here, yoga props such as blocks, straps or chairs are commonly used to support the client.<\/p>\n<!-- \/wp:paragraph -->\n\n<!-- wp:paragraph -->\n<p>For example, a gentle and rather accessible inversion in a therapeutic yoga class may be the “Legs Up the Wall” pose (instead of Shoulderstand for instance). This position is said to bring relief in conditions like anxiety and insomnia.<\/p>\n<!-- \/wp:paragraph -->\n\n<!-- wp:html -->\n<div class=\"video-wrapper\">\n<div class=\"video-wrapper-inner\">\n\n<!-- YOUTUBE VIDEO GOES HERE -->\n<iframe width=\"560\" height=\"315\" src=\"https:\/\/www.youtube.com\/embed\/Ye8Pro_YF5A\" frameborder=\"0\" allow=\"accelerometer; autoplay; encrypted-media; gyroscope; picture-in-picture\" allowfullscreen=\"\"><\/iframe>\n\n<!-- CAPTION -->\n<p class=\"caption\">Practice a therapeutic approach to release neck &amp; shoulder with Young Ho Kim on TINT.<\/p>\n\n<\/div>\n<\/div>\n<!-- \/wp:html -->\n\n<!-- wp:heading {\"level\":3} -->\n<h3>Breathing Exercises\/Pranayama<\/h3>\n<!-- \/wp:heading -->\n\n<!-- wp:paragraph -->\n<p>The yoga therapist will guide the client(s) through a series of breathing exercises, also called <em>Pranayama<\/em> in yoga. These practices can range from energizing breathwork to balancing breathing exercises.<\/p>\n<!-- \/wp:paragraph -->\n\n<!-- wp:heading {\"level\":3} -->\n<h3>Meditation and Relaxation<\/h3>\n<!-- \/wp:heading -->\n\n<!-- wp:paragraph -->\n<p>Yoga therapy can also include relaxation and mindfulness practices. This is where meditation can be used either separately or in combination with <em>Asanas<\/em> or <em>Pranayama<\/em>.<\/p>\n<!-- \/wp:paragraph -->\n\n<!-- wp:heading {\"level\":3} -->\n<h3>Visualization<\/h3>\n<!-- \/wp:heading -->\n\n<!-- wp:paragraph -->\n<p>Yoga therapists may also use visualization practices or guided imagery. The aim here is to calm the body and mind by providing a guided visualization in order to bring inner peace.<\/p>\n<!-- \/wp:paragraph -->\n\n<!-- wp:heading {\"level\":3} -->\n<h3>Homework<\/h3>\n<!-- \/wp:heading -->\n\n<!-- wp:paragraph -->\n<p>Another important technique used in yoga therapy – and this again differs from the ‘regular’ yoga class – is homework. Students or clients will benefit tremendously if they learn to <strong>build the practices into their daily life<\/strong> instead of practicing them only once a week in the context of a therapeutic yoga class.<\/p>\n<!-- \/wp:paragraph -->\n\n<!-- wp:paragraph -->\n<p>More traditional forms of yoga therapy can also include techniques such as chanting, prayer, readings, rituals, and spiritual counseling.<\/p>\n<!-- \/wp:paragraph -->\n\n<!-- wp:paragraph -->\n<p>The treatment plan and techniques employed in yoga therapy usually vary according to <strong>age, physical ability, and specific needs <\/strong>of the students or clients. Besides, all exercises and techniques used in yoga therapy are aimed at maximizing the connection between mind and body.&nbsp;<\/p>\n<!-- \/wp:paragraph -->\n\n<!-- wp:paragraph -->\n<p>While this is true for any yoga practice, a yoga therapist will specifically explain the importance and meaning of each exercise and yoga pose with regard to the underlying health concern. This way, yoga therapy creates a bridge between the practice and its cognitive framework.&nbsp;<\/p>\n<!-- \/wp:paragraph -->\n\n<!-- wp:paragraph -->\n<p>If a practitioner suffers from anxiety, for example, a yoga therapist will explain how the poses practiced can help relieve anxiety.<\/p>\n<!-- \/wp:paragraph -->\n\n<!-- wp:heading {\"level\":1} -->\n<h1 id=\"5\">5. Conclusion: Is Yoga Therapy an Alternative to Medical Treatment?<\/h1>\n<!-- \/wp:heading -->\n\n<!-- wp:paragraph -->\n<p>While yoga therapy does not claim to be disease-curative, <strong>it can address various symptoms <\/strong>that may accompany illnesses or health issues, specifically pain, fatigue, and mental challenges.<\/p>\n<!-- \/wp:paragraph -->\n\n<!-- wp:paragraph -->\n<p>As such, <strong>yoga therapy can be used in addition to other forms of therapy.<\/strong> Note that it should always be considered whether and to what extent therapeutic yoga practices can be helpful to the individual and how it would work in combination with other forms of therapy.<\/p>\n<!-- \/wp:paragraph -->\n\n<!-- wp:paragraph -->\n<p>Although many clients report great results from yoga therapy, it is important to remember that <strong>yoga is not a cure-all or magical bullet<\/strong>. Besides, the communication between therapy seeker and therapy giver must be very clear as to the underlying health issues, medical history, and desired outcome of yoga therapy.&nbsp;<\/p>\n<!-- \/wp:paragraph -->\n\n<!-- wp:paragraph -->\n<p>However, if this is taken into account, <strong>anyone can participate in yoga therapy<\/strong> regardless of age, flexibility, or strength. This is especially true since therapeutic yoga sessions can be simple or advanced, depending on the abilities and needs of the students or clients.<\/p>\n<!-- \/wp:paragraph -->\n\n<!-- wp:paragraph -->\n<p>If you want to dive deeper into yoga therapy and the application of therapeutic yoga practices, make sure you attend our next <a href=\"https:\/\/watch.tintyoga.com\/pages\/live\">live classes<\/a> which will all focus on therapeutic yoga.&nbsp;<\/p>\n<!-- \/wp:paragraph -->\n\n<!-- wp:paragraph -->\n<p>Each session includes techniques and practices that <strong>support the body to deal with physical issues <\/strong>such as tension, pains and aches, and – to a certain degree – injuries. The aim is to release tension and relieve the body from unpleasant sensations.<\/p>\n<!-- \/wp:paragraph -->\n\n<!-- wp:paragraph -->\n<p>Instead of flowing through powerful sequences, the focus will rather be on static poses that target specific body parts and areas of the body to strengthen and lengthen them in order to achieve long-term benefits and increase overall well-being.<\/p>\n<!-- \/wp:paragraph -->\n\n<!-- wp:html -->\n<!-- GALLERY 2x2 -->\n<div class=\"grid-wrapper\">\n<div class=\"grid-2x2-container\">\n\n<!-- Image 1 -->\n<div class=\"aspectratio\" data-ratio=\"16:9\"><div>\n<img position=\"bottom\" src=\"https:\/\/tintyoga.com\/wp-content\/uploads\/2022\/01\/tint_magazine_therapeutic-yoga_live-classes_Barbra.jpg\">\n<\/div><\/div>\n\n<!-- Image 2 -->\n<div class=\"aspectratio\" data-ratio=\"16:9\"><div>\n<img position=\"left\" src=\"https:\/\/tintyoga.com\/wp-content\/uploads\/2022\/01\/tint_magazine_therapeutic-yoga_live-classes_Desiree.jpg\">\n<\/div><\/div>\n\n<!-- Image 3 -->\n<div class=\"aspectratio\" data-ratio=\"16:9\"><div>\n<img position=\"top\" src=\"https:\/\/tintyoga.com\/wp-content\/uploads\/2022\/01\/tint_magazine_therapeutic-yoga_live-classes_matt.jpg\">\n<\/div><\/div>\n\n<!-- Image 4 -->\n<div class=\"aspectratio\" data-ratio=\"16:9\"><div>\n<img position=\"left\" src=\"https:\/\/tintyoga.com\/wp-content\/uploads\/2022\/01\/tint_magazine_therapeutic-yoga_live-classes_young-ho.jpg\">\n<\/div><\/div>\n\n<\/div>\n\n<!-- CAPTION -->\n<p class=\"caption\">Join our <a href=\"https:\/\/tintyoga.com\/live\">Live Classes<\/a> foussing in therapeutic yoga.<\/p>\n<\/div>\n<!-- \/wp:html -->\n\n<!-- wp:thrive\/leads-block {\"selectedBlock\":158494} \/-->","_et_gb_content_width":""},"categories":[132],"tags":[],"yoast_head":"<!-- This site is optimized with the Yoast SEO plugin v19.10 - https:\/\/yoast.com\/wordpress\/plugins\/seo\/ -->\n<title>Yoga Therapy – A Practice for the Sick and Feeble? - TINT Yoga<\/title>\n<meta name=\"description\" content=\"Many turn to yoga for therapeutic purposes, e.g. to release pain. But what is therapeutic yoga? And how is it different from ‘regular’ yoga?\" \/>\n<meta name=\"robots\" content=\"index, follow, max-snippet:-1, max-image-preview:large, max-video-preview:-1\" \/>\n<link rel=\"canonical\" href=\"https:\/\/tintyoga.com\/magazine\/yoga-therapy\/\" \/>\n<meta property=\"og:locale\" content=\"en_US\" \/>\n<meta property=\"og:type\" content=\"article\" \/>\n<meta property=\"og:title\" content=\"Yoga Therapy – A Practice for the Sick and Feeble? - TINT Yoga\" \/>\n<meta property=\"og:description\" content=\"Many turn to yoga for therapeutic purposes, e.g. to release pain. But what is therapeutic yoga? And how is it different from ‘regular’ yoga?\" \/>\n<meta property=\"og:url\" content=\"https:\/\/tintyoga.com\/magazine\/yoga-therapy\/\" \/>\n<meta property=\"og:site_name\" content=\"TINT Yoga\" \/>\n<meta property=\"article:publisher\" content=\"https:\/\/www.facebook.com\/tintyoga\/\" \/>\n<meta property=\"article:published_time\" content=\"2022-01-14T13:33:12+00:00\" \/>\n<meta property=\"article:modified_time\" content=\"2022-03-09T15:25:35+00:00\" \/>\n<meta property=\"og:image\" content=\"https:\/\/tintyoga.com\/wp-content\/uploads\/2022\/01\/tint_magazine_therapeutic-yoga_header.jpg\" \/>\n\t<meta property=\"og:image:width\" content=\"1300\" \/>\n\t<meta property=\"og:image:height\" content=\"500\" \/>\n\t<meta property=\"og:image:type\" content=\"image\/jpeg\" \/>\n<meta name=\"author\" content=\"doreen\" \/>\n<meta name=\"twitter:card\" content=\"summary_large_image\" \/>\n<meta name=\"twitter:label1\" content=\"Written by\" \/>\n\t<meta name=\"twitter:data1\" content=\"doreen\" \/>\n\t<meta name=\"twitter:label2\" content=\"Est. reading time\" \/>\n\t<meta name=\"twitter:data2\" content=\"16 minutes\" \/>\n<script type=\"application\/ld+json\" class=\"yoast-schema-graph\">{\"@context\":\"https:\/\/schema.org\",\"@graph\":[{\"@type\":\"Article\",\"@id\":\"https:\/\/tintyoga.com\/magazine\/yoga-therapy\/#article\",\"isPartOf\":{\"@id\":\"https:\/\/tintyoga.com\/magazine\/yoga-therapy\/\"},\"author\":{\"name\":\"doreen\",\"@id\":\"https:\/\/tintyoga.com\/#\/schema\/person\/581877dfb2f1e012aa8f2a2a39a44c3b\"},\"headline\":\"Yoga Therapy – A Practice for the Sick and Feeble?\",\"datePublished\":\"2022-01-14T13:33:12+00:00\",\"dateModified\":\"2022-03-09T15:25:35+00:00\",\"mainEntityOfPage\":{\"@id\":\"https:\/\/tintyoga.com\/magazine\/yoga-therapy\/\"},\"wordCount\":3347,\"publisher\":{\"@id\":\"https:\/\/tintyoga.com\/#organization\"},\"articleSection\":[\"Yoga Styles\"],\"inLanguage\":\"en-US\"},{\"@type\":\"WebPage\",\"@id\":\"https:\/\/tintyoga.com\/magazine\/yoga-therapy\/\",\"url\":\"https:\/\/tintyoga.com\/magazine\/yoga-therapy\/\",\"name\":\"Yoga Therapy – A Practice for the Sick and Feeble? - TINT Yoga\",\"isPartOf\":{\"@id\":\"https:\/\/tintyoga.com\/#website\"},\"datePublished\":\"2022-01-14T13:33:12+00:00\",\"dateModified\":\"2022-03-09T15:25:35+00:00\",\"description\":\"Many turn to yoga for therapeutic purposes, e.g. to release pain. But what is therapeutic yoga? And how is it different from ‘regular’ yoga?\",\"breadcrumb\":{\"@id\":\"https:\/\/tintyoga.com\/magazine\/yoga-therapy\/#breadcrumb\"},\"inLanguage\":\"en-US\",\"potentialAction\":[{\"@type\":\"ReadAction\",\"target\":[\"https:\/\/tintyoga.com\/magazine\/yoga-therapy\/\"]}]},{\"@type\":\"BreadcrumbList\",\"@id\":\"https:\/\/tintyoga.com\/magazine\/yoga-therapy\/#breadcrumb\",\"itemListElement\":[{\"@type\":\"ListItem\",\"position\":1,\"name\":\"Home\",\"item\":\"https:\/\/tintyoga.com\/\"},{\"@type\":\"ListItem\",\"position\":2,\"name\":\"Yoga Therapy – A Practice for the Sick and Feeble?\"}]},{\"@type\":\"WebSite\",\"@id\":\"https:\/\/tintyoga.com\/#website\",\"url\":\"https:\/\/tintyoga.com\/\",\"name\":\"TINT Yoga\",\"description\":\"TINT Yoga offers premium online yoga classes with the world&#039;s most popular yoga and movement instructors. Learn and work out with our online yoga videos.\",\"publisher\":{\"@id\":\"https:\/\/tintyoga.com\/#organization\"},\"potentialAction\":[{\"@type\":\"SearchAction\",\"target\":{\"@type\":\"EntryPoint\",\"urlTemplate\":\"https:\/\/tintyoga.com\/?s={search_term_string}\"},\"query-input\":\"required name=search_term_string\"}],\"inLanguage\":\"en-US\"},{\"@type\":\"Organization\",\"@id\":\"https:\/\/tintyoga.com\/#organization\",\"name\":\"TINT Yoga\",\"url\":\"https:\/\/tintyoga.com\/\",\"logo\":{\"@type\":\"ImageObject\",\"inLanguage\":\"en-US\",\"@id\":\"https:\/\/tintyoga.com\/#\/schema\/logo\/image\/\",\"url\":\"https:\/\/tintyoga.com\/wp-content\/uploads\/2021\/08\/logo_color_black.png\",\"contentUrl\":\"https:\/\/tintyoga.com\/wp-content\/uploads\/2021\/08\/logo_color_black.png\",\"width\":1001,\"height\":301,\"caption\":\"TINT Yoga\"},\"image\":{\"@id\":\"https:\/\/tintyoga.com\/#\/schema\/logo\/image\/\"},\"sameAs\":[\"https:\/\/www.instagram.com\/tint_yoga\/\",\"https:\/\/de.linkedin.com\/company\/tint-gmbh\",\"https:\/\/www.pinterest.de\/tintyoga\/\",\"https:\/\/www.youtube.com\/channel\/UC2HjTe0TL20qSk8e3s1d0DA\",\"https:\/\/www.facebook.com\/tintyoga\/\"]},{\"@type\":\"Person\",\"@id\":\"https:\/\/tintyoga.com\/#\/schema\/person\/581877dfb2f1e012aa8f2a2a39a44c3b\",\"name\":\"doreen\",\"image\":{\"@type\":\"ImageObject\",\"inLanguage\":\"en-US\",\"@id\":\"https:\/\/tintyoga.com\/#\/schema\/person\/image\/\",\"url\":\"https:\/\/secure.gravatar.com\/avatar\/5ac132c6e49e85e81542f95a7a9e124e?s=96&d=mm&r=g\",\"contentUrl\":\"https:\/\/secure.gravatar.com\/avatar\/5ac132c6e49e85e81542f95a7a9e124e?s=96&d=mm&r=g\",\"caption\":\"doreen\"},\"url\":\"https:\/\/tintyoga.com\/magazine\/author\/doreen\/\"}]}<\/script>\n<!-- \/ Yoast SEO plugin. -->","yoast_head_json":{"title":"Yoga Therapy – A Practice for the Sick and Feeble? - TINT Yoga","description":"Many turn to yoga for therapeutic purposes, e.g. to release pain. But what is therapeutic yoga? And how is it different from ‘regular’ yoga?","robots":{"index":"index","follow":"follow","max-snippet":"max-snippet:-1","max-image-preview":"max-image-preview:large","max-video-preview":"max-video-preview:-1"},"canonical":"https:\/\/tintyoga.com\/magazine\/yoga-therapy\/","og_locale":"en_US","og_type":"article","og_title":"Yoga Therapy – A Practice for the Sick and Feeble? - TINT Yoga","og_description":"Many turn to yoga for therapeutic purposes, e.g. to release pain. But what is therapeutic yoga? And how is it different from ‘regular’ yoga?","og_url":"https:\/\/tintyoga.com\/magazine\/yoga-therapy\/","og_site_name":"TINT Yoga","article_publisher":"https:\/\/www.facebook.com\/tintyoga\/","article_published_time":"2022-01-14T13:33:12+00:00","article_modified_time":"2022-03-09T15:25:35+00:00","og_image":[{"width":1300,"height":500,"url":"https:\/\/tintyoga.com\/wp-content\/uploads\/2022\/01\/tint_magazine_therapeutic-yoga_header.jpg","type":"image\/jpeg"}],"author":"doreen","twitter_card":"summary_large_image","twitter_misc":{"Written by":"doreen","Est. reading time":"16 minutes"},"schema":{"@context":"https:\/\/schema.org","@graph":[{"@type":"Article","@id":"https:\/\/tintyoga.com\/magazine\/yoga-therapy\/#article","isPartOf":{"@id":"https:\/\/tintyoga.com\/magazine\/yoga-therapy\/"},"author":{"name":"doreen","@id":"https:\/\/tintyoga.com\/#\/schema\/person\/581877dfb2f1e012aa8f2a2a39a44c3b"},"headline":"Yoga Therapy – A Practice for the Sick and Feeble?","datePublished":"2022-01-14T13:33:12+00:00","dateModified":"2022-03-09T15:25:35+00:00","mainEntityOfPage":{"@id":"https:\/\/tintyoga.com\/magazine\/yoga-therapy\/"},"wordCount":3347,"publisher":{"@id":"https:\/\/tintyoga.com\/#organization"},"articleSection":["Yoga Styles"],"inLanguage":"en-US"},{"@type":"WebPage","@id":"https:\/\/tintyoga.com\/magazine\/yoga-therapy\/","url":"https:\/\/tintyoga.com\/magazine\/yoga-therapy\/","name":"Yoga Therapy – A Practice for the Sick and Feeble? - TINT Yoga","isPartOf":{"@id":"https:\/\/tintyoga.com\/#website"},"datePublished":"2022-01-14T13:33:12+00:00","dateModified":"2022-03-09T15:25:35+00:00","description":"Many turn to yoga for therapeutic purposes, e.g. to release pain. But what is therapeutic yoga? And how is it different from ‘regular’ yoga?","breadcrumb":{"@id":"https:\/\/tintyoga.com\/magazine\/yoga-therapy\/#breadcrumb"},"inLanguage":"en-US","potentialAction":[{"@type":"ReadAction","target":["https:\/\/tintyoga.com\/magazine\/yoga-therapy\/"]}]},{"@type":"BreadcrumbList","@id":"https:\/\/tintyoga.com\/magazine\/yoga-therapy\/#breadcrumb","itemListElement":[{"@type":"ListItem","position":1,"name":"Home","item":"https:\/\/tintyoga.com\/"},{"@type":"ListItem","position":2,"name":"Yoga Therapy – A Practice for the Sick and Feeble?"}]},{"@type":"WebSite","@id":"https:\/\/tintyoga.com\/#website","url":"https:\/\/tintyoga.com\/","name":"TINT Yoga","description":"TINT Yoga offers premium online yoga classes with the world&#039;s most popular yoga and movement instructors. Learn and work out with our online yoga videos.","publisher":{"@id":"https:\/\/tintyoga.com\/#organization"},"potentialAction":[{"@type":"SearchAction","target":{"@type":"EntryPoint","urlTemplate":"https:\/\/tintyoga.com\/?s={search_term_string}"},"query-input":"required name=search_term_string"}],"inLanguage":"en-US"},{"@type":"Organization","@id":"https:\/\/tintyoga.com\/#organization","name":"TINT Yoga","url":"https:\/\/tintyoga.com\/","logo":{"@type":"ImageObject","inLanguage":"en-US","@id":"https:\/\/tintyoga.com\/#\/schema\/logo\/image\/","url":"https:\/\/tintyoga.com\/wp-content\/uploads\/2021\/08\/logo_color_black.png","contentUrl":"https:\/\/tintyoga.com\/wp-content\/uploads\/2021\/08\/logo_color_black.png","width":1001,"height":301,"caption":"TINT Yoga"},"image":{"@id":"https:\/\/tintyoga.com\/#\/schema\/logo\/image\/"},"sameAs":["https:\/\/www.instagram.com\/tint_yoga\/","https:\/\/de.linkedin.com\/company\/tint-gmbh","https:\/\/www.pinterest.de\/tintyoga\/","https:\/\/www.youtube.com\/channel\/UC2HjTe0TL20qSk8e3s1d0DA","https:\/\/www.facebook.com\/tintyoga\/"]},{"@type":"Person","@id":"https:\/\/tintyoga.com\/#\/schema\/person\/581877dfb2f1e012aa8f2a2a39a44c3b","name":"doreen","image":{"@type":"ImageObject","inLanguage":"en-US","@id":"https:\/\/tintyoga.com\/#\/schema\/person\/image\/","url":"https:\/\/secure.gravatar.com\/avatar\/5ac132c6e49e85e81542f95a7a9e124e?s=96&d=mm&r=g","contentUrl":"https:\/\/secure.gravatar.com\/avatar\/5ac132c6e49e85e81542f95a7a9e124e?s=96&d=mm&r=g","caption":"doreen"},"url":"https:\/\/tintyoga.com\/magazine\/author\/doreen\/"}]}},"acf":[],"_links":{"self":[{"href":"https:\/\/tintyoga.com\/wp-json\/wp\/v2\/posts\/159353"}],"collection":[{"href":"https:\/\/tintyoga.com\/wp-json\/wp\/v2\/posts"}],"about":[{"href":"https:\/\/tintyoga.com\/wp-json\/wp\/v2\/types\/post"}],"author":[{"embeddable":true,"href":"https:\/\/tintyoga.com\/wp-json\/wp\/v2\/users\/6"}],"replies":[{"embeddable":true,"href":"https:\/\/tintyoga.com\/wp-json\/wp\/v2\/comments?post=159353"}],"version-history":[{"count":12,"href":"https:\/\/tintyoga.com\/wp-json\/wp\/v2\/posts\/159353\/revisions"}],"predecessor-version":[{"id":163084,"href":"https:\/\/tintyoga.com\/wp-json\/wp\/v2\/posts\/159353\/revisions\/163084"}],"wp:featuredmedia":[{"embeddable":true,"href":"https:\/\/tintyoga.com\/wp-json\/wp\/v2\/media\/159379"}],"wp:attachment":[{"href":"https:\/\/tintyoga.com\/wp-json\/wp\/v2\/media?parent=159353"}],"wp:term":[{"taxonomy":"category","embeddable":true,"href":"https:\/\/tintyoga.com\/wp-json\/wp\/v2\/categories?post=159353"},{"taxonomy":"post_tag","embeddable":true,"href":"https:\/\/tintyoga.com\/wp-json\/wp\/v2\/tags?post=159353"}],"curies":[{"name":"wp","href":"https:\/\/api.w.org\/{rel}","templated":true}]}}